[
    {
        "text": "Q: An apple orchard has 5572 apples and they want to pack them in boxes containing 3241 apples each. How many apples will be left unpacked?\nA: The number of apples left unpacked will be 5572 mod 3241=2331.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<remainder>(5572,3241)=2331<eoe>"
        ],
        "tar_number": [
            "2331"
        ]
    },
    {
        "text": "Q: A pizza parlor has 5935 pizzas and each pizza can be cut into 3583 slices. If each person can have only one slice, how many slices of pizza will be left?\nA: The number of slices of pizza left is 5935%3583=2352.",
        "start_token_idx": [
            77
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<remainder>(5935,3583)=2352<eoe>"
        ],
        "tar_number": [
            "2352"
        ]
    },
    {
        "text": "Q: A pizza parlor has 7935 pizzas and each pizza can be cut into 2016 slices. If each person can have only one slice, how many slices of pizza will be left?\nA: The number of slices of pizza left is 7935%2016=1887.",
        "start_token_idx": [
            77
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<remainder>(7935,2016)=1887<eoe>"
        ],
        "tar_number": [
            "1887"
        ]
    },
    {
        "text": "Q: A construction worker has 2078 bricks. If he wants to stack them in piles of 1918 bricks each, how many bricks will be left over after he stacks as many full piles as possible?\nA: The number of bricks left over will be 2078 mod 1918=160.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<remainder>(2078,1918)=160<eoe>"
        ],
        "tar_number": [
            "160"
        ]
    },
    {
        "text": "Q: A factory produces 7793 widgets per hour and needs to package them in boxes of 6472 widgets each. How many widgets will be left over after packaging the widgets produced in one hour?\nA: There will be 7793%6472 widgets left over after packaging the widgets produced in one hour, which is 1321.",
        "start_token_idx": [
            85
        ],
        "end_token_idx": [
            89
        ],
        "tar_eq": [
            "<remainder>(7793,6472)=1321<eoe>"
        ],
        "tar_number": [
            "1321"
        ]
    },
    {
        "text": "Q: A coach has 9994 players and wants to divide them into teams of 6794 players each. How many players will be left over?\nA: The number of players left over will be 9994 mod 6794=3200.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<remainder>(9994,6794)=3200<eoe>"
        ],
        "tar_number": [
            "3200"
        ]
    },
    {
        "text": "Q: A construction worker has 9638 bricks. If he wants to stack them in piles of 738 bricks each, how many bricks will be left over after he stacks as many full piles as possible?\nA: The number of bricks left over will be 9638 mod 738=44.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<remainder>(9638,738)=44<eoe>"
        ],
        "tar_number": [
            "44"
        ]
    },
    {
        "text": "Q: A bakery has 6650 cakes to distribute among 3340 customers. If each customer can only receive one cake, how many cakes will be left over?\nA: The number of cakes left over is 6650 mod 3340=3310.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<remainder>(6650,3340)=3310<eoe>"
        ],
        "tar_number": [
            "3310"
        ]
    },
    {
        "text": "Q: A store has 2842 shirts in stock and wants to display them in rows of 1205 shirts. How many shirts will be left over if they cannot fill out a complete row?\nA: The number of shirts left over will be 2842 mod 1205=432.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            79
        ],
        "tar_eq": [
            "<remainder>(2842,1205)=432<eoe>"
        ],
        "tar_number": [
            "432"
        ]
    },
    {
        "text": "Q: A farmer has 6128 eggs and wants to put them into 5900-packs. How many eggs will be left over?\nA: Divide 6128 by 5900, the remainder is 228.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<remainder>(6128,5900)=228<eoe>"
        ],
        "tar_number": [
            "228"
        ]
    },
    {
        "text": "Q: A company has a total of 8769 employees. If the employees need to be divided into teams of 2576 people, what is the remainder of employees that cannot be evenly divided into teams?\nA: The remainder is 1041.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<remainder>(8769,2576)=1041<eoe>"
        ],
        "tar_number": [
            "1041"
        ]
    },
    {
        "text": "Q: A store has 9995 shirts in stock and wants to display them in rows of 786 shirts. How many shirts will be left over if they cannot fill out a complete row?\nA: The number of shirts left over will be 9995 mod 786=563.",
        "start_token_idx": [
            74
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<remainder>(9995,786)=563<eoe>"
        ],
        "tar_number": [
            "563"
        ]
    },
    {
        "text": "Q: A pizza parlor has 9218 slices of pizza. If each pizza pie has 821 slices, how many leftover slices will there be?\nA: The number of leftover slices will be 9218 mod 821=187.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<remainder>(9218,821)=187<eoe>"
        ],
        "tar_number": [
            "187"
        ]
    },
    {
        "text": "Q: A baker is dividing 1087 pounds of dough into loaves of bread that weigh 691 pounds each. How many pounds of dough will be left over if they cannot make a complete loaf of bread with the remaining dough?\nA: The amount of dough left over will be 1087 mod 691=396 pounds.",
        "start_token_idx": [
            82
        ],
        "end_token_idx": [
            85
        ],
        "tar_eq": [
            "<remainder>(1087,691)=396<eoe>"
        ],
        "tar_number": [
            "396"
        ]
    },
    {
        "text": "Q: A factory produces 9300 products in a day. If each box can hold 4526 products, how many products will be left over?\nA: The number of products that will be left over is 9300%4526=248.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<remainder>(9300,4526)=248<eoe>"
        ],
        "tar_number": [
            "248"
        ]
    },
    {
        "text": "Q: A company has a total of 4450 employees. If the employees need to be divided into teams of 2663 people, what is the remainder of employees that cannot be evenly divided into teams?\nA: The remainder is 1787.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<remainder>(4450,2663)=1787<eoe>"
        ],
        "tar_number": [
            "1787"
        ]
    },
    {
        "text": "Q: A runner is planning a route that is 6002 miles long and wants to run for 2129 days. If the runner runs the same distance each day, how many extra miles will they have to run on the last day if the miles cannot be evenly divided?\nA: The runner will have to run 6002 mod 2129=1744 extra miles on the last day.",
        "start_token_idx": [
            83
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<remainder>(6002,2129)=1744<eoe>"
        ],
        "tar_number": [
            "1744"
        ]
    },
    {
        "text": "Q: A farmer has 1226 eggs to pack in cartons of 968 eggs each. How many eggs will be left over?\nA: The number of eggs left over will be 1226%968=258.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<remainder>(1226,968)=258<eoe>"
        ],
        "tar_number": [
            "258"
        ]
    },
    {
        "text": "Q: A pizza parlor has 2178 slices of pizza. If each customer orders 2137 slices, how many slices will remain after all customers are served?\nA: The number of slices remaining will be 2178%2137=41.",
        "start_token_idx": [
            66
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<remainder>(2178,2137)=41<eoe>"
        ],
        "tar_number": [
            "41"
        ]
    },
    {
        "text": "Q: A school has 7602 students and they need to be divided into classes of 3497 students each. How many students will be left out?\nA: Divide 7602 by 3497, the remainder is 608.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<remainder>(7602,3497)=608<eoe>"
        ],
        "tar_number": [
            "608"
        ]
    },
    {
        "text": "Q: A farmer has 9437 eggs and wants to distribute them evenly among 3970 baskets. How many eggs will be left over?\nA: Take 9437 divided by 3970, the remainder is 1497.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<remainder>(9437,3970)=1497<eoe>"
        ],
        "tar_number": [
            "1497"
        ]
    },
    {
        "text": "Q: A farmer is planning to put 3121 chickens into 1907 coops. If each coop can only hold a certain number of chickens and not all coops can be filled to capacity, how many chickens will be left over?\nA: The number of chickens left over will be 3121 mod 1907=1214.",
        "start_token_idx": [
            87
        ],
        "end_token_idx": [
            91
        ],
        "tar_eq": [
            "<remainder>(3121,1907)=1214<eoe>"
        ],
        "tar_number": [
            "1214"
        ]
    },
    {
        "text": "Q: A farmer has 6499 chickens and wants to put them in 4354 coops. What is the maximum number of chickens that can fit in each coop and how many chickens will be left over?\nA: The maximum number of chickens that can fit in each coop is 6499/4354 and there will be 6499%4354 chickens left over. Therefore, the remainder is 2145.",
        "start_token_idx": [
            110
        ],
        "end_token_idx": [
            114
        ],
        "tar_eq": [
            "<remainder>(6499,4354)=2145<eoe>"
        ],
        "tar_number": [
            "2145"
        ]
    },
    {
        "text": "Q: A farmer has a field of 3615 acres. If he wants to divide the field into plots of 2232 acres each, how many acres will be left over?\nA: The number of acres left over will be 3615%2232=1383.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<remainder>(3615,2232)=1383<eoe>"
        ],
        "tar_number": [
            "1383"
        ]
    },
    {
        "text": "Q: A pizza has 6679 slices and 3370 people want to share it equally. How many slices will be left?\nA: Divide 6679 by 3370, the remainder is 3309.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<remainder>(6679,3370)=3309<eoe>"
        ],
        "tar_number": [
            "3309"
        ]
    },
    {
        "text": "Q: A book has 5762 pages, and a student wants to read 4612 pages per day. How many days will it take to finish the book, and how many pages will be left unread?\nA: It will take 5762 divided by 4612 days to finish the book, and 5762 mod 4612 pages will be left unread. The remainder is 1150.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            100
        ],
        "tar_eq": [
            "<remainder>(5762,4612)=1150<eoe>"
        ],
        "tar_number": [
            "1150"
        ]
    },
    {
        "text": "Q: A pizza has 768 slices. If 268 people want to share the pizza equally, how many slices will each person get and how many slices will be left?\nA: Divide 768 by 268 to get the number of slices each person will get. The remainder is the number of slices that will be left over. The remainder is 232.",
        "start_token_idx": [
            89
        ],
        "end_token_idx": [
            92
        ],
        "tar_eq": [
            "<remainder>(768,268)=232<eoe>"
        ],
        "tar_number": [
            "232"
        ]
    },
    {
        "text": "Q: A factory produces 9424 products in a day. If each box can hold 9266 products, how many products will be left over?\nA: The number of products that will be left over is 9424%9266=158.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<remainder>(9424,9266)=158<eoe>"
        ],
        "tar_number": [
            "158"
        ]
    },
    {
        "text": "Q: A book has 4484 pages, and a student wants to read 1167 pages per day. How many days will it take to finish the book, and how many pages will be left unread?\nA: It will take 4484 divided by 1167 days to finish the book, and 4484 mod 1167 pages will be left unread. The remainder is 983.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            99
        ],
        "tar_eq": [
            "<remainder>(4484,1167)=983<eoe>"
        ],
        "tar_number": [
            "983"
        ]
    },
    {
        "text": "Q: A student has 9030 candies and wants to share them equally with 2870 friends. How many candies will be left over?\nA: The number of candies left over will be 9030 mod 2870=420.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<remainder>(9030,2870)=420<eoe>"
        ],
        "tar_number": [
            "420"
        ]
    },
    {
        "text": "Q: A company is packaging 9964 pens in boxes. Each box can hold 1621 pens. How many pens will be left over after all the boxes are filled?\nA: The number of pens left over will be 9964 mod 1621=238.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<remainder>(9964,1621)=238<eoe>"
        ],
        "tar_number": [
            "238"
        ]
    },
    {
        "text": "Q: A coach has 9146 players and wants to divide them into teams of 1784 players each. How many players will be left over?\nA: The number of players left over will be 9146 mod 1784=226.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<remainder>(9146,1784)=226<eoe>"
        ],
        "tar_number": [
            "226"
        ]
    },
    {
        "text": "Q: A farmer is planning to put 6464 chickens into 2915 coops. If each coop can only hold a certain number of chickens and not all coops can be filled to capacity, how many chickens will be left over?\nA: The number of chickens left over will be 6464 mod 2915=634.",
        "start_token_idx": [
            87
        ],
        "end_token_idx": [
            90
        ],
        "tar_eq": [
            "<remainder>(6464,2915)=634<eoe>"
        ],
        "tar_number": [
            "634"
        ]
    },
    {
        "text": "Q: A farmer has 728 eggs and wants to pack them into boxes of 315 eggs each. What will be the number of eggs left after packing all the boxes?\nA: The number of eggs left after packing all the boxes will be 728 mod 315=98.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<remainder>(728,315)=98<eoe>"
        ],
        "tar_number": [
            "98"
        ]
    },
    {
        "text": "Q: A company produces 3140 widgets per day. If they package the widgets in boxes of 882 widgets each, how many widgets will be left over at the end of the day?\nA: The number of widgets left over will be 3140%882=494.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<remainder>(3140,882)=494<eoe>"
        ],
        "tar_number": [
            "494"
        ]
    },
    {
        "text": "Q: A factory produces 694 products on a daily basis. If each box can hold 334 products, how many products will be left out of the last box?\nA: The number of products that will be left out of the last box is 694%334=26.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<remainder>(694,334)=26<eoe>"
        ],
        "tar_number": [
            "26"
        ]
    },
    {
        "text": "Q: A delivery company has 1404 packages to deliver and each truck can hold 1370 packages. How many packages will be left undelivered?\nA: The number of packages left undelivered is 1404%1370=34.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<remainder>(1404,1370)=34<eoe>"
        ],
        "tar_number": [
            "34"
        ]
    },
    {
        "text": "Q: A group of 628 friends want to split the cost of a bill that costs 1501. If they want to split the cost equally, how much will each individual have to pay, and how much will be left over?\nA: Each friend will have to pay 1501 divided by 628 with a remainder of 245 left over.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<remainder>(1501,628)=245<eoe>"
        ],
        "tar_number": [
            "245"
        ]
    },
    {
        "text": "Q: A farmer has 8014 eggs and wants to pack them in cartons. Each carton can hold 7647 eggs. How many eggs will be left over if the farmer tries to pack them all?\nA: The number of eggs left over will be 8014 mod 7647=367.",
        "start_token_idx": [
            74
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<remainder>(8014,7647)=367<eoe>"
        ],
        "tar_number": [
            "367"
        ]
    },
    {
        "text": "Q: A car tire rotates 7265 times per minute. If the speed of the car is 7047 miles per hour, how many times does the tire rotate per mile?\nA: Divide 7265 by 7047 to get the number of rotations per mile. The remainder is 218.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<remainder>(7265,7047)=218<eoe>"
        ],
        "tar_number": [
            "218"
        ]
    },
    {
        "text": "Q: A factory produces 5341 items per hour and a shift lasts 4703 hours. How many items will be left unproduced?\nA: The number of items left unproduced is 5341%4703=638.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<remainder>(5341,4703)=638<eoe>"
        ],
        "tar_number": [
            "638"
        ]
    },
    {
        "text": "Q: A school has 1147 students and wants to divide them into groups of 475 students each. How many students will be left over?\nA: The number of students left over is 1147%475=197.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<remainder>(1147,475)=197<eoe>"
        ],
        "tar_number": [
            "197"
        ]
    },
    {
        "text": "Q: A store has 1943 shirts available for sale. If they want to pack them into boxes that hold 246 shirts each, how many shirts will be left over after all boxes are filled?\nA: The number of shirts left over will be 1943 mod 246=221.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            79
        ],
        "tar_eq": [
            "<remainder>(1943,246)=221<eoe>"
        ],
        "tar_number": [
            "221"
        ]
    },
    {
        "text": "Q: A store has 396 shirts in stock and wants to display them in rows of 70 shirts. How many shirts will be left over if they cannot fill out a complete row?\nA: The number of shirts left over will be 396 mod 70=46.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<remainder>(396,70)=46<eoe>"
        ],
        "tar_number": [
            "46"
        ]
    },
    {
        "text": "Q: A pizza restaurant has 1136 slices of pizza and wants to divide them equally among 443 people. If each person can have the same number of slices, how many slices will be left over?\nA: The number of slices left over will be 1136 mod 443=250.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<remainder>(1136,443)=250<eoe>"
        ],
        "tar_number": [
            "250"
        ]
    },
    {
        "text": "Q: A store has 9947 shirts available for sale. If they want to pack them into boxes that hold 6474 shirts each, how many shirts will be left over after all boxes are filled?\nA: The number of shirts left over will be 9947 mod 6474=3473.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            82
        ],
        "tar_eq": [
            "<remainder>(9947,6474)=3473<eoe>"
        ],
        "tar_number": [
            "3473"
        ]
    },
    {
        "text": "Q: John has 4184 marbles in a bag. He wants to divide them equally among his 115 friends. If each friend gets the same number of marbles, what is the remainder of the marbles left in the bag?\nA: The remainder of marbles left in the bag is 44.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<remainder>(4184,115)=44<eoe>"
        ],
        "tar_number": [
            "44"
        ]
    },
    {
        "text": "Q: A baker wants to evenly divide a dough weighing 988 grams and another dough weighing 919 grams into equal parts. What is the largest weight of each part that can be made?\nA: The largest weight of each part that can be made is 1 grams.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<gcd>(988,919)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A factory produces 172 bolts and 119 nuts in each batch. What is the maximum number of batches that can be made such that the same number of bolts and nuts are used in each batch?\nA: The maximum number of batches that can be made such that the same number of bolts and nuts are used in each batch is the greatest common divisor of 172 and 119, which is 1.",
        "start_token_idx": [
            101
        ],
        "end_token_idx": [
            102
        ],
        "tar_eq": [
            "<gcd>(172,119)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A carpenter wants to cut a length of wood that is 597 meters long into smaller pieces that are all of equal length. What is the maximum length of each piece that can be cut?\nA: The maximum length of each piece that can be cut is the greatest common divisor of 597 and 27, which is 3.",
        "start_token_idx": [
            77
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<gcd>(597,27)=3<eoe>"
        ],
        "tar_number": [
            "3"
        ]
    },
    {
        "text": "Q: Two friends want to split a pizza evenly. If the pizza has 723 slices and they want to split it into 638 equal parts, what is the largest number of slices they can have on each part?\nA: The largest number of slices they can have on each part is the greatest common divisor of 723 and 638, which is 1.",
        "start_token_idx": [
            89
        ],
        "end_token_idx": [
            90
        ],
        "tar_eq": [
            "<gcd>(723,638)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A baker wants to cut a rectangular cake into square pieces. The cake is 144 inches long and 657 inches wide. What is the largest possible size (side length) of a square piece that can be cut?\nA: The largest possible side length of a square piece that can be cut is is 9.",
        "start_token_idx": [
            74
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<gcd>(144,657)=9<eoe>"
        ],
        "tar_number": [
            "9"
        ]
    },
    {
        "text": "Q: A tailor wants to cut a piece of cloth into identical squares. If the cloth is 641 cm long and 619 cm wide, what is the largest possible length of each square?\nA: The largest possible length of each square is the greatest common divisor of 641 and 619, which is 1.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<gcd>(641,619)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A music teacher wants to divide 997 students into groups of 161 students each. What is the maximum number of groups the teacher can form without any student left over?\nA: The maximum number of groups is the greatest common divisor of 997 and 161, which is 1.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<gcd>(997,161)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A farmer has 316 cows and 196 sheep. He wants to build pens to separate them, with each pen having the same number of animals in it. What is the largest number of cows and sheep that can be in each pen?\nA: The largest number of cows and sheep that can be in each pen is the greatest common divisor of 316 and 196, which is 4.",
        "start_token_idx": [
            95
        ],
        "end_token_idx": [
            96
        ],
        "tar_eq": [
            "<gcd>(316,196)=4<eoe>"
        ],
        "tar_number": [
            "4"
        ]
    },
    {
        "text": "Q: A store has 792 shirts in one color and 104 shirts in another color. The store wants to arrange them in rows with the same number of shirts in each row. What is the largest possible number of shirts in each row?\nA: The largest possible number of shirts in each row is the greatest common divisor of 792 and 104, which is 8.",
        "start_token_idx": [
            97
        ],
        "end_token_idx": [
            98
        ],
        "tar_eq": [
            "<gcd>(792,104)=8<eoe>"
        ],
        "tar_number": [
            "8"
        ]
    },
    {
        "text": "Q: A company has 80 workers, 565 machines, and 263 tools. They want to distribute them evenly among the departments. What is the largest possible number of workers, machines, and tools in each department?\nA: The largest possible number of workers, machines, and tools in each department is the greatest common divisor of 80, 565, and 263, which is 1.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<gcd>(80,565,263)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A construction company has 626 trucks, 762 cranes, and 839 bulldozers. They want to distribute them evenly among [ANSWER] construction sites. What is the largest number of each type of equipment that can be assigned to each site?\nA: The largest number of each type of equipment that can be assigned to each site is the greatest common divisor of 626, 762, and 839, which is 1.",
        "start_token_idx": [
            112
        ],
        "end_token_idx": [
            113
        ],
        "tar_eq": [
            "<gcd>(626,762,839)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A container can hold 647 liters of water and 19 liters of oil. What is the largest volume of liquid that can be measured using only jugs of those sizes?\nA: The largest volume of liquid that can be measured is 1 liters.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<gcd>(647,19)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A baker wants to evenly divide a dough weighing 76 grams and another dough weighing 526 grams into equal parts. What is the largest weight of each part that can be made?\nA: The largest weight of each part that can be made is 2 grams.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<gcd>(76,526)=2<eoe>"
        ],
        "tar_number": [
            "2"
        ]
    },
    {
        "text": "Q: A group of 229 students want to divide 609 candies evenly among themselves. What is the largest number of candies each student can have?\nA: The largest number of candies each student can have is the greatest common divisor of 229 and 609, which is 1.",
        "start_token_idx": [
            71
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<gcd>(229,609)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A rectangular room has a length of 342 meters and a width of 304 meters. What is the largest square tile that can be used to cover the entire floor without any cutting?\nA: The largest square tile that can be used to cover the entire floor without any cutting is the greatest common divisor of 342 and 304, which is 38.",
        "start_token_idx": [
            84
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<gcd>(342,304)=38<eoe>"
        ],
        "tar_number": [
            "38"
        ]
    },
    {
        "text": "Q: A company wants to arrange 935 chairs in rows and 799 chairs in columns for a conference. What is the maximum number of chairs that can be placed in each row and column so that all the chairs can be used without any left over?\nA: The maximum number of chairs in each row and column is the greatest common divisor of 935 and 799, which is 17.",
        "start_token_idx": [
            95
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<gcd>(935,799)=17<eoe>"
        ],
        "tar_number": [
            "17"
        ]
    },
    {
        "text": "Q: A rectangular garden has a length of 181 meters and a width of 61 meters. What is the largest possible size (side length) of a square fence that can be used to enclose the entire garden without any cutting?\nA: The largest possible size (side length) of a square fence that can be used to enclose the entire garden without any cutting is the greatest common divisor of 181 and 61, which is 1.",
        "start_token_idx": [
            102
        ],
        "end_token_idx": [
            103
        ],
        "tar_eq": [
            "<gcd>(181,61)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A rectangular garden has a length of 252 meters and a width of 316 meters. What is the maximum length of a path that can be laid diagonally across the garden without crossing over any plants?\nA: The maximum length of a path that can be laid diagonally across the garden without crossing over any plants is the greatest common divisor of 252 and 316, which is 4.",
        "start_token_idx": [
            94
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<gcd>(252,316)=4<eoe>"
        ],
        "tar_number": [
            "4"
        ]
    },
    {
        "text": "Q: A teacher wants to divide her class of 656 students into equal groups for a project. She has 105 project topics. What is the largest number of students that can be in each group if every group works on the same project topic?\nA: The largest number of students that can be in each group is the greatest common divisor of 656 and 105, which is 1.",
        "start_token_idx": [
            89
        ],
        "end_token_idx": [
            90
        ],
        "tar_eq": [
            "<gcd>(656,105)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A group of 484 students and a group of 773 students are standing in two lines for a group photo. If the two lines are to be of equal length, what is the maximum number of students that can be in each line?\nA: The maximum number of students that can be in each line is 1.",
        "start_token_idx": [
            71
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<gcd>(484,773)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: Two friends want to split a pizza evenly. If the pizza has 811 slices and they want to split it into 591 equal parts, what is the largest number of slices they can have on each part?\nA: The largest number of slices they can have on each part is the greatest common divisor of 811 and 591, which is 1.",
        "start_token_idx": [
            89
        ],
        "end_token_idx": [
            90
        ],
        "tar_eq": [
            "<gcd>(811,591)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A rectangular garden has a length of 46 meters and a width of 236 meters. What is the largest possible size of the square tiles that can be used to cover the garden without cutting any tile?\nA: The largest possible size of the square tiles that can be used to cover the garden without cutting any tile is the greatest common divisor of 46 and 236, which is 2.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            93
        ],
        "tar_eq": [
            "<gcd>(46,236)=2<eoe>"
        ],
        "tar_number": [
            "2"
        ]
    },
    {
        "text": "Q: A farmer has 956 cows and 813 chickens. He wants to divide them equally into pens with an equal number of cows and chickens in each pen. What is the maximum number of cows and chickens in each pen?\nA: The maximum number of cows and chickens in each pen is 1.",
        "start_token_idx": [
            79
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<gcd>(956,813)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: What is the largest number that can divide both 682 and 833 and leave a remainder of 4?\nA: The largest number that can divide both 682 and 833 and leave a remainder of 4 is 1.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<gcd>(682,833)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: John has 783 marbles and Tom has 299 marbles. They want to divide them into equal groups without any marbles left over. What is the largest number of groups that they can make?\nA: The largest number of groups that they can make is the greatest common divisor of 783 and 299, which is 1.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<gcd>(783,299)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: Two friends want to split a pizza evenly. If the pizza has 36 slices and they want to split it into 74 equal parts, what is the largest number of slices they can have on each part?\nA: The largest number of slices they can have on each part is the greatest common divisor of 36 and 74, which is 2.",
        "start_token_idx": [
            85
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<gcd>(36,74)=2<eoe>"
        ],
        "tar_number": [
            "2"
        ]
    },
    {
        "text": "Q: A construction worker wants to tile a floor with square tiles. The length of the room is 127 feet, and the width of the room is 687 feet. What is the largest possible size (side length) of a square tile that can be used?\nA: The largest possible side length of a square tile that can be used is the greatest common divisor of 127 and 687, which is 1.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<gcd>(127,687)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A factory produces 505 identical screws and 391 identical bolts. What is the largest number of identical boxes they can pack such that each box contains the same number of screws and bolts?\nA: The largest number of identical boxes they can pack is 1.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<gcd>(505,391)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A factory produces 365 widgets per day and needs to ship them in boxes that can hold 597 widgets each. What is the largest number of widgets that can be shipped in each box?\nA: The largest number of widgets that can be shipped in each box is the greatest common divisor of 365 and 597, which is 1.",
        "start_token_idx": [
            86
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<gcd>(365,597)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A factory produces 128 bolts and 116 nuts. What is the largest number of equal-sized packs of bolts and nuts that can be made without any leftovers?\nA: The largest number of equal-sized packs of bolts and nuts is 4.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<gcd>(128,116)=4<eoe>"
        ],
        "tar_number": [
            "4"
        ]
    },
    {
        "text": "Q: What is the largest number that can divide both 36 and 702 and leave a remainder of 4?\nA: The largest number that can divide both 36 and 702 and leave a remainder of 4 is 18.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            57
        ],
        "tar_eq": [
            "<gcd>(36,702)=18<eoe>"
        ],
        "tar_number": [
            "18"
        ]
    },
    {
        "text": "Q: A rectangular garden has a length of 486 feet and a width of 301 feet. What is the largest size of a square garden bed that can be made without any waste?\nA: The largest size of a square garden bed that can be made without any waste is the greatest common divisor of 486 and 301, which is 1.",
        "start_token_idx": [
            82
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<gcd>(486,301)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A teacher wants to cut a length of ribbon into equal pieces for her students. The ribbon is 432 meters long, and each piece of ribbon will be 76 centimeters long. What is the largest possible number of equal pieces that can be cut from the ribbon?\nA: The largest possible number of equal pieces that can be cut from the ribbon is the greatest common divisor of 432 and 76, which is 4.",
        "start_token_idx": [
            102
        ],
        "end_token_idx": [
            103
        ],
        "tar_eq": [
            "<gcd>(432,76)=4<eoe>"
        ],
        "tar_number": [
            "4"
        ]
    },
    {
        "text": "Q: A group of 562 people and a group of 453 people are to be seated in rows such that each row has the same number of people. What is the maximum number of people that can be seated in each row?\nA: The maximum number of people that can be seated in each row is 1.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<gcd>(562,453)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A school has 19 students and 301 textbooks. The teacher wants to distribute the textbooks equally to the students. What is the maximum number of textbooks that each student can get?\nA: The maximum number of textbooks that each student can get is the greatest common divisor of 19 and 301, which is 1.",
        "start_token_idx": [
            79
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<gcd>(19,301)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A school has 201 boys and 362 girls. They want to form teams where each team has the same number of boys and girls. What is the largest number of boys and girls that can be in each team?\nA: The largest number of boys and girls that can be in each team is the greatest common divisor of 201 and 362, which is 1.",
        "start_token_idx": [
            87
        ],
        "end_token_idx": [
            88
        ],
        "tar_eq": [
            "<gcd>(201,362)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A student has 498 pages of math homework and 82 pages of English homework. If the student wants to divide the work equally between two days, what is the largest number of pages the student can do each day?\nA: The largest number of pages the student can do each day is the greatest common divisor of 498 and 82, which is 2.",
        "start_token_idx": [
            85
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<gcd>(498,82)=2<eoe>"
        ],
        "tar_number": [
            "2"
        ]
    },
    {
        "text": "Q: A factory produces 140 bolts and 95 nuts. The factory wants to package them in boxes with the same number of bolts and nuts in each. What is the largest possible number of bolts and nuts in each box?\nA: The largest possible number of bolts and nuts in each box is the greatest common divisor of 140 and 95, which is 5.",
        "start_token_idx": [
            91
        ],
        "end_token_idx": [
            92
        ],
        "tar_eq": [
            "<gcd>(140,95)=5<eoe>"
        ],
        "tar_number": [
            "5"
        ]
    },
    {
        "text": "Q: A music teacher wants to organize her students into groups for a performance. If she wants to have 232 students in each group and has a total of 687 students, what is the largest possible number of groups she can form?\nA: The largest possible number of groups she can form is the greatest common divisor of 232 and 687, which is 1.",
        "start_token_idx": [
            86
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<gcd>(232,687)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A company has 808 workers, 380 machines, and 729 tools. They want to distribute them evenly among the departments. What is the largest possible number of workers, machines, and tools in each department?\nA: The largest possible number of workers, machines, and tools in each department is the greatest common divisor of 808, 380, and 729, which is 1.",
        "start_token_idx": [
            98
        ],
        "end_token_idx": [
            99
        ],
        "tar_eq": [
            "<gcd>(808,380,729)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A school has 264 students in a class and wants to divide them into equal groups for a project. If each group must have the same number of students, what is the largest number of students that can be in each group?\nA: The largest number of students that can be in each group is the greatest common divisor of 264, which is 264.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<gcd>(264)=264<eoe>"
        ],
        "tar_number": [
            "264"
        ]
    },
    {
        "text": "Q: A company wants to package their products in boxes that can hold 181 items each. If they have 547 items to package, what is the largest number of boxes they can fill completely?\nA: The largest number of boxes they can fill completely is the greatest common divisor of 181 and 547, which is 1.",
        "start_token_idx": [
            77
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<gcd>(181,547)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A school has 815 students in Class A and 419 students in Class B. The school wants to divide the students into equal groups for a game. What is the maximum number of students in each group?\nA: The maximum number of students in each group is the greatest common divisor of 815 and 419, which is 1.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<gcd>(815,419)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A carpenter has 688 wooden boards that are 446 feet long. He wants to cut the boards into pieces of equal length. What is the largest possible length for each piece he can cut?\nA: The largest possible length for each piece the carpenter can cut is the greatest common divisor of 688 and 446, which is 2.",
        "start_token_idx": [
            86
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<gcd>(688,446)=2<eoe>"
        ],
        "tar_number": [
            "2"
        ]
    },
    {
        "text": "Q: A group of students wants to divide 569 pencils and 895 erasers into equal piles such that each pile has the same number of pencils and erasers. What is the largest number of pencils and erasers that can be in each pile?\nA: The largest number of pencils and erasers that can be in each pile is the greatest common divisor of 569 and 895, which is 1.",
        "start_token_idx": [
            109
        ],
        "end_token_idx": [
            110
        ],
        "tar_eq": [
            "<gcd>(569,895)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A company wants to package their products in boxes that are the same size. The products are 465 inches long and 752 inches wide. What is the largest possible length and width (in inches) of the boxes that can be used?\nA: The largest possible length and width of the boxes that can be used is the greatest common divisor of 465 and 752, which is 1.",
        "start_token_idx": [
            91
        ],
        "end_token_idx": [
            92
        ],
        "tar_eq": [
            "<gcd>(465,752)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A rectangular field has dimensions of 620 meters and 181 meters. What is the largest size of a square tile that can be used to completely tile the field without any tile being cut?\nA: The largest size of a square tile that can be used is 1 meters.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<gcd>(620,181)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A rectangular garden has an area of 4073.28 square feet and a width of 4049.47 feet. What is the length of the garden?\nA: The length of the garden is 4073.28/4049.47=1.01 feet.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<divide>(4073.28, 4049.47)=1.01<eoe>"
        ],
        "tar_number": [
            "1.01"
        ]
    },
    {
        "text": "Q: A store sells 2356 items and has a total revenue of 1284.98 dollars. What is the average price of each item?\nA: The average price of each item is 1284.98/2356=1.83 dollars.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<divide>(1284.98, 2356)=1.83<eoe>"
        ],
        "tar_number": [
            "1.83"
        ]
    },
    {
        "text": "Q: A store sells 147 items and has a total revenue of 183.63 dollars. What is the average price of each item?\nA: The average price of each item is 183.63/147=0.8 dollars.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<divide>(183.63, 147)=0.8<eoe>"
        ],
        "tar_number": [
            "0.8"
        ]
    },
    {
        "text": "Q: A bag of candy contains 33540.99 pieces and costs 19668 dollars. How much does each piece of candy cost?\nA: Each piece of candy costs 19668/33540.99=1.71 dollars.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<divide>(19668, 33540.99)=1.71<eoe>"
        ],
        "tar_number": [
            "1.71"
        ]
    },
    {
        "text": "Q: A car travels 4096.04 miles on 2170.65 gallons of gas. What is its fuel efficiency in miles per gallon?\nA: The car's fuel efficiency is 4096.04/2170.65=1.89 miles per gallon.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<divide>(4096.04, 2170.65)=1.89<eoe>"
        ],
        "tar_number": [
            "1.89"
        ]
    },
    {
        "text": "Q: A company produces 4764 products in 1904.8 hours. How many products can they produce in one hour?\nA: They can produce 4764/1904.8=2.5 products in one hour.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<divide>(4764, 1904.8)=2.5<eoe>"
        ],
        "tar_number": [
            "2.5"
        ]
    },
    {
        "text": "Q: If a bag of apples weighs 58.5 pounds and there are 330 apples in the bag, how much does each apple weigh?\nA: Each apple weighs 58.5/330=0.18 pounds.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<divide>(58.5, 330)=0.18<eoe>"
        ],
        "tar_number": [
            "0.18"
        ]
    },
    {
        "text": "Q: A rectangular field has an area of 1588 square meters and a width of 319.06 meters. What is the length of the field?\nA: The length of the field is 1588/319.06=4.98 meters.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<divide>(1588, 319.06)=4.98<eoe>"
        ],
        "tar_number": [
            "4.98"
        ]
    },
    {
        "text": "Q: If a person walks 1831.06 miles in 811.4 hours, what is their average speed in miles per hour?\nA: The average speed of the person is 1831.06/811.4=2.26 miles per hour.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<divide>(1831.06, 811.4)=2.26<eoe>"
        ],
        "tar_number": [
            "2.26"
        ]
    },
    {
        "text": "Q: A store sells 494 candy bars for 239.68 dollars. How much does one candy bar cost?\nA: One candy bar costs 239.68/494=2.06 dollars.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            57
        ],
        "tar_eq": [
            "<divide>(239.68, 494)=2.06<eoe>"
        ],
        "tar_number": [
            "2.06"
        ]
    },
    {
        "text": "Q: A garden has a total area of 2041.07 square feet. If the garden is 4664.56 feet wide, how long is it?\nA: The garden is 2041.07/4664.56=0.44 feet long.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<divide>(2041.07, 4664.56)=0.44<eoe>"
        ],
        "tar_number": [
            "0.44"
        ]
    },
    {
        "text": "Q: A rectangular field has an area of 1711 square meters and a width of 4080.65 meters. What is the length of the field?\nA: The length of the field is 1711/4080.65=0.42 meters.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<divide>(1711, 4080.65)=0.42<eoe>"
        ],
        "tar_number": [
            "0.42"
        ]
    },
    {
        "text": "Q: A garden has a total area of 432.68 square feet. If the garden is 988.27 feet wide, how long is it?\nA: The garden is 432.68/988.27=0.44 feet long.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(432.68, 988.27)=0.44<eoe>"
        ],
        "tar_number": [
            "0.44"
        ]
    },
    {
        "text": "Q: A company's quarterly profits were 633.12 dollars. If it has 753 shareholders, how much profit does each shareholder receive?\nA: Each shareholder will receive 633.12/753=0.84 dollars in profit.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<divide>(633.12, 753)=0.84<eoe>"
        ],
        "tar_number": [
            "0.84"
        ]
    },
    {
        "text": "Q: A rectangular garden has an area of 919.8 square meters and a length of 660.05 meters. What is the width of the garden?\nA: The width of the garden is 919.8/660.05=1.39 meters.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<divide>(919.8, 660.05)=1.39<eoe>"
        ],
        "tar_number": [
            "1.39"
        ]
    },
    {
        "text": "Q: If a restaurant has 4373 customers and 1462 tables, how many customers can sit at each table if they are all seated equally?\nA: Each table can seat 4373/1462=2.99 customers.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<divide>(4373, 1462)=2.99<eoe>"
        ],
        "tar_number": [
            "2.99"
        ]
    },
    {
        "text": "Q: A rectangular garden has an area of 34505.73 square feet and a width of 18889.86 feet. What is the length of the garden?\nA: The length of the garden is 34505.73/18889.86=1.83 feet.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<divide>(34505.73, 18889.86)=1.83<eoe>"
        ],
        "tar_number": [
            "1.83"
        ]
    },
    {
        "text": "Q: A recipe calls for 821.24 cups of flour to make 494.47 servings of pancakes. How many cups of flour are needed to make one serving of pancakes?\nA: One serving of pancakes requires 821.24/494.47=1.66 cups of flour.",
        "start_token_idx": [
            79
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<divide>(821.24, 494.47)=1.66<eoe>"
        ],
        "tar_number": [
            "1.66"
        ]
    },
    {
        "text": "Q: A garden has a total area of 655.19 square feet. If the garden is 441.81 feet wide, how long is it?\nA: The garden is 655.19/441.81=1.48 feet long.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(655.19, 441.81)=1.48<eoe>"
        ],
        "tar_number": [
            "1.48"
        ]
    },
    {
        "text": "Q: If a store sells 170 items in a day and is open for 398.22 hours, how many items are sold per hour on average?\nA: On average, 170/398.22=0.43 items are sold per hour.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<divide>(170, 398.22)=0.43<eoe>"
        ],
        "tar_number": [
            "0.43"
        ]
    },
    {
        "text": "Q: A pizza can be divided into 606 equal slices. If a group of 574 people want to share the pizza equally, how many slices of pizza will each person get?\nA: Each person will get 606/574=1.06 slices of pizza.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<divide>(606, 574)=1.06<eoe>"
        ],
        "tar_number": [
            "1.06"
        ]
    },
    {
        "text": "Q: A company sells 630 units of a product for a total of 1775.68 dollars. What is the average price per unit?\nA: The average price per unit is 1775.68/630=2.82 dollars per unit.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<divide>(1775.68, 630)=2.82<eoe>"
        ],
        "tar_number": [
            "2.82"
        ]
    },
    {
        "text": "Q: If a person walks 88.19 miles in 328.87 hours, what is their average speed in miles per hour?\nA: The average speed of the person is 88.19/328.87=0.27 miles per hour.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<divide>(88.19, 328.87)=0.27<eoe>"
        ],
        "tar_number": [
            "0.27"
        ]
    },
    {
        "text": "Q: A recipe calls for 159.72 cups of flour to make 2 servings. How much flour would be needed to make one serving?\nA: One serving would require 159.72/2=79.86 cups of flour.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<divide>(159.72, 2)=79.86<eoe>"
        ],
        "tar_number": [
            "79.86"
        ]
    },
    {
        "text": "Q: A company sells 1127 units of a product for a total of 3863.82 dollars. What is the average price per unit?\nA: The average price per unit is 3863.82/1127=3.43 dollars per unit.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<divide>(3863.82, 1127)=3.43<eoe>"
        ],
        "tar_number": [
            "3.43"
        ]
    },
    {
        "text": "Q: A car travels 314.2 miles on 79.04 gallons of gas. How many miles per gallon does the car get?\nA: The car gets 314.2/79.04=3.98 miles per gallon.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<divide>(314.2, 79.04)=3.98<eoe>"
        ],
        "tar_number": [
            "3.98"
        ]
    },
    {
        "text": "Q: If a recipe calls for 914.11 cups of flour and makes 21 servings, how many cups of flour are needed per serving?\nA: Each serving will need 914.11/21=43.53 cups of flour.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(914.11, 21)=43.53<eoe>"
        ],
        "tar_number": [
            "43.53"
        ]
    },
    {
        "text": "Q: A car travels 3706.18 miles in 3933.29 hours. What is the car's speed in miles per hour?\nA: The car's speed is 3706.18/3933.29=0.94 miles per hour.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(3706.18, 3933.29)=0.94<eoe>"
        ],
        "tar_number": [
            "0.94"
        ]
    },
    {
        "text": "Q: A car travels 112.33 miles in 2.83 hours. What is the car's speed in miles per hour?\nA: The car's speed is 112.33/2.83=39.69 miles per hour.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<divide>(112.33, 2.83)=39.69<eoe>"
        ],
        "tar_number": [
            "39.69"
        ]
    },
    {
        "text": "Q: A garden has a total area of 332.44 square feet. If the garden is 103.29 feet wide, how long is it?\nA: The garden is 332.44/103.29=3.22 feet long.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(332.44, 103.29)=3.22<eoe>"
        ],
        "tar_number": [
            "3.22"
        ]
    },
    {
        "text": "Q: If a cake weighs 294.34 pounds and is divided into 109 equal pieces, how much does each piece weigh?\nA: Each piece of the cake weighs 294.34/109=2.7 pounds.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(294.34, 109)=2.7<eoe>"
        ],
        "tar_number": [
            "2.7"
        ]
    },
    {
        "text": "Q: A car can travel 776.93 miles on a full tank of gas. If the gas tank holds 455.09 gallons of gas, how far can the car travel per gallon of gas?\nA: The car can travel 776.93/455.09=1.71 miles per gallon of gas.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<divide>(776.93, 455.09)=1.71<eoe>"
        ],
        "tar_number": [
            "1.71"
        ]
    },
    {
        "text": "Q: If a car travels 4250.23 miles in 125.16 hours, what is the average speed of the car in miles per hour?\nA: The average speed of the car is 4250.23/125.16=33.96 miles per hour.",
        "start_token_idx": [
            66
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<divide>(4250.23, 125.16)=33.96<eoe>"
        ],
        "tar_number": [
            "33.96"
        ]
    },
    {
        "text": "Q: A store sells 31.74 pounds of ground beef for 850.04 dollars. What is the cost per pound of ground beef?\nA: The cost per pound of ground beef is 850.04/31.74=26.78 dollars per pound.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<divide>(850.04, 31.74)=26.78<eoe>"
        ],
        "tar_number": [
            "26.78"
        ]
    },
    {
        "text": "Q: A rectangular garden has an area of 957.48 square feet and a width of 979.28 feet. What is the length of the garden?\nA: The length of the garden is 957.48/979.28=0.98 feet.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(957.48, 979.28)=0.98<eoe>"
        ],
        "tar_number": [
            "0.98"
        ]
    },
    {
        "text": "Q: A company's quarterly profits were 816.2 dollars. If it has 75 shareholders, how much profit does each shareholder receive?\nA: Each shareholder will receive 816.2/75=10.88 dollars in profit.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<divide>(816.2, 75)=10.88<eoe>"
        ],
        "tar_number": [
            "10.88"
        ]
    },
    {
        "text": "Q: A store sells 38432 candy bars for 47577.89 dollars. How much does one candy bar cost?\nA: One candy bar costs 47577.89/38432=0.81 dollars.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<divide>(47577.89, 38432)=0.81<eoe>"
        ],
        "tar_number": [
            "0.81"
        ]
    },
    {
        "text": "Q: A company has a total budget of 360.27 dollars to spend on 352.92 employees. How much money can each employee receive?\nA: Each employee can receive 360.27/352.92=1.02 dollars.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<divide>(360.27, 352.92)=1.02<eoe>"
        ],
        "tar_number": [
            "1.02"
        ]
    },
    {
        "text": "Q: If a store sells 27998 items in a day and is open for 2082.75 hours, how many items are sold per hour on average?\nA: On average, 27998/2082.75=13.44 items are sold per hour.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<divide>(27998, 2082.75)=13.44<eoe>"
        ],
        "tar_number": [
            "13.44"
        ]
    },
    {
        "text": "Q: A box of chocolates costs 100.68 dollars. If you have 320.24 dollars, how many boxes of chocolates can you buy?\nA: You can buy 320.24/100.68=0.31 boxes of chocolates.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(320.24, 100.68)=0.31<eoe>"
        ],
        "tar_number": [
            "0.31"
        ]
    },
    {
        "text": "Q: A car travels 1541.81 miles in 2230.61 hours. What is the car's speed in miles per hour?\nA: The car's speed is 1541.81/2230.61=0.69 miles per hour.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(1541.81, 2230.61)=0.69<eoe>"
        ],
        "tar_number": [
            "0.69"
        ]
    },
    {
        "text": "Q: If a company has 566.06 dollars in profits and it is divided equally among 413 employees, how much money will each employee receive?\nA: Each employee will receive 566.06/413=1.37 dollars.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<divide>(566.06, 413)=1.37<eoe>"
        ],
        "tar_number": [
            "1.37"
        ]
    },
    {
        "text": "Q: If a recipe calls for 1956.54 teaspoons of salt to make 3831 servings, how many teaspoons of salt are needed to make one serving?\nA: One serving requires 1956.54/3831=0.51 teaspoons of salt.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<divide>(1956.54, 3831)=0.51<eoe>"
        ],
        "tar_number": [
            "0.51"
        ]
    },
    {
        "text": "Q: A car travels 1144.23 miles on 3645.84 gallons of gas. What is its fuel efficiency in miles per gallon?\nA: The car's fuel efficiency is 1144.23/3645.84=0.31 miles per gallon.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<divide>(1144.23, 3645.84)=0.31<eoe>"
        ],
        "tar_number": [
            "0.31"
        ]
    },
    {
        "text": "Q: If a recipe calls for 70.69 cups of flour and makes 489 servings, how many cups of flour are needed per serving?\nA: Each serving will need 70.69/489=0.14 cups of flour.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<divide>(70.69, 489)=0.14<eoe>"
        ],
        "tar_number": [
            "0.14"
        ]
    },
    {
        "text": "Q: A box of chocolates costs 352.24 dollars. If you have 645.73 dollars, how many boxes of chocolates can you buy?\nA: You can buy 645.73/352.24=1.83 boxes of chocolates.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(645.73, 352.24)=1.83<eoe>"
        ],
        "tar_number": [
            "1.83"
        ]
    },
    {
        "text": "Q: If a cake weighs 4791.86 pounds and is divided into 1023 equal pieces, how much does each piece weigh?\nA: Each piece of the cake weighs 4791.86/1023=4.68 pounds.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<divide>(4791.86, 1023)=4.68<eoe>"
        ],
        "tar_number": [
            "4.68"
        ]
    },
    {
        "text": "Q: A sports team has 7 players. If the coach wants to choose a starting lineup of 2 players, how many different lineups are possible?\nA: There are 21 different lineups that are possible.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<choose>(7,2)=21<eoe>"
        ],
        "tar_number": [
            "21"
        ]
    },
    {
        "text": "Q: A charity has 17 volunteers. If they need to select a team of 12 volunteers for a fundraiser event, how many different teams can they form?\nA: The number of different teams they can form is 17C12=6188.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<choose>(17,12)=6188<eoe>"
        ],
        "tar_number": [
            "6188"
        ]
    },
    {
        "text": "Q: A teacher has 16 students and wants to choose a team of 2 students for a competition. How many ways can the teacher choose the team?\nA: The teacher can choose the team in 120 ways.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<choose>(16,2)=120<eoe>"
        ],
        "tar_number": [
            "120"
        ]
    },
    {
        "text": "Q: A restaurant offers a lunch special where customers can choose any 14 dishes from a menu of 18 dishes. In how many ways can customers create their lunch?\nA: There are 3060 ways to create the lunch.",
        "start_token_idx": [
            47
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<choose>(18,14)=3060<eoe>"
        ],
        "tar_number": [
            "3060"
        ]
    },
    {
        "text": "Q: A company has 7 employees and needs to choose a team of 3 employees to attend a conference. How many ways can they choose the team?\nA: The company can choose the team in 35 ways.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<choose>(7,3)=35<eoe>"
        ],
        "tar_number": [
            "35"
        ]
    },
    {
        "text": "Q: In a lottery, there are 14 numbers to choose from. If players must choose 5 numbers, how many different combinations of numbers are possible?\nA: The number of different combinations of 5 numbers that can be chosen from 14 numbers in the lottery is 14C5=2002.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<choose>(14,5)=2002<eoe>"
        ],
        "tar_number": [
            "2002"
        ]
    },
    {
        "text": "Q: A pizza place offers 17 different toppings. If you can choose up to 15 toppings for your pizza, how many different pizzas can you order?\nA: There are 136 different pizzas you can order with up to 15 toppings.",
        "start_token_idx": [
            47
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<choose>(17,15)=136<eoe>"
        ],
        "tar_number": [
            "136"
        ]
    },
    {
        "text": "Q: A store has 20 different types of candy. A customer wants to buy 6 different types of candy. How many different combinations of candy can the customer buy?\nA: There are 38760 different combinations of candy the customer can buy.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<choose>(20,6)=38760<eoe>"
        ],
        "tar_number": [
            "38760"
        ]
    },
    {
        "text": "Q: A store has 16 different types of candy. A customer wants to buy 14 different types of candy. How many different combinations of candy can the customer buy?\nA: There are 120 different combinations of candy the customer can buy.",
        "start_token_idx": [
            47
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<choose>(16,14)=120<eoe>"
        ],
        "tar_number": [
            "120"
        ]
    },
    {
        "text": "Q: In a town, there are 19 parks and the city council wants to select a committee of 4 members to oversee the parks. How many ways can the council select the committee?\nA: The council can select the committee in 3876 ways.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<choose>(19,4)=3876<eoe>"
        ],
        "tar_number": [
            "3876"
        ]
    },
    {
        "text": "Q: A company has 16 employees and wants to form a team of 13 employees to work on a project. How many different teams can be formed?\nA: There are 560 different teams that can be formed.",
        "start_token_idx": [
            41
        ],
        "end_token_idx": [
            44
        ],
        "tar_eq": [
            "<choose>(16,13)=560<eoe>"
        ],
        "tar_number": [
            "560"
        ]
    },
    {
        "text": "Q: A school has 15 teachers and wants to form a committee of 5 teachers. How many ways can this be done?\nA: The number of ways to form a committee of 5 teachers from 15 teachers is 15C5=3003.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<choose>(15,5)=3003<eoe>"
        ],
        "tar_number": [
            "3003"
        ]
    },
    {
        "text": "Q: A restaurant has a menu with 5 entrees and a customer wants to order 2 dishes. How many different combinations of dishes can the customer order?\nA: The number of different combinations of dishes the customer can order is 10.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<choose>(5,2)=10<eoe>"
        ],
        "tar_number": [
            "10"
        ]
    },
    {
        "text": "Q: A clothing store has 3 different colors of shirts. How many different combinations of 2 shirts can a customer buy?\nA: There are 3 different combinations of 2 shirts that a customer can buy.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<choose>(3,2)=3<eoe>"
        ],
        "tar_number": [
            "3"
        ]
    },
    {
        "text": "Q: A store has 16 different types of fruits, and a customer wants to buy 5 types of fruits. How many different fruit combinations can the customer choose?\nA: The number of different fruit combinations the customer can choose is 16C5=4368.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<choose>(16,5)=4368<eoe>"
        ],
        "tar_number": [
            "4368"
        ]
    },
    {
        "text": "Q: A company has 13 employees who need to be split into 3 teams. How many different ways can the company form teams?\nA: The number of different ways the company can form teams is 286.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<choose>(13,3)=286<eoe>"
        ],
        "tar_number": [
            "286"
        ]
    },
    {
        "text": "Q: A company has 8 employees, but only 6 can attend a conference. How many different groups of employees can the company send to the conference?\nA: The number of different groups of employees the company can send to the conference is 8C6=28.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<choose>(8,6)=28<eoe>"
        ],
        "tar_number": [
            "28"
        ]
    },
    {
        "text": "Q: A teacher has 10 students in a class. If she wants to randomly select a group of 4 students for a project, how many different groups can she choose?\nA: There are 210 different groups of students that can be chosen for the project.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<choose>(10,4)=210<eoe>"
        ],
        "tar_number": [
            "210"
        ]
    },
    {
        "text": "Q: A company has 20 employees. How many ways can you choose 12 employees to attend a training session?\nA: There are 125970 ways to choose employees to attend a training session.",
        "start_token_idx": [
            33
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<choose>(20,12)=125970<eoe>"
        ],
        "tar_number": [
            "125970"
        ]
    },
    {
        "text": "Q: A school has 17 teachers and needs to form a committee of 9 teachers. How many different committees can be formed?\nA: There are 24310 different committees that can be formed from 17 teachers, if the committee needs to have 9 teachers.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<choose>(17,9)=24310<eoe>"
        ],
        "tar_number": [
            "24310"
        ]
    },
    {
        "text": "Q: A deck of cards has 19 cards. If you draw 3 cards, how many different combinations of cards can you get?\nA: The number of different combinations of 3 cards you can draw from a deck of 19 cards is 19C3=969.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<choose>(19,3)=969<eoe>"
        ],
        "tar_number": [
            "969"
        ]
    },
    {
        "text": "Q: A school has 18 buses that can each carry 3 students. What is the maximum number of students that can be transported by the buses at once?\nA: The maximum number of students that can be transported by the buses at once is 816.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<choose>(18,3)=816<eoe>"
        ],
        "tar_number": [
            "816"
        ]
    },
    {
        "text": "Q: In a group of 19 friends, how many ways can you select 15 friends to go on a trip?\nA: There are 3876 ways to select 15 friends from a group of 19 friends to go on a trip.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<choose>(19,15)=3876<eoe>"
        ],
        "tar_number": [
            "3876"
        ]
    },
    {
        "text": "Q: A company has 7 departments and they need to select 5 of them to participate in a team-building activity. How many different groups of departments can be selected?\nA: The number of different groups of 5 departments that can be selected from 7 departments is 7C5=21.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<choose>(7,5)=21<eoe>"
        ],
        "tar_number": [
            "21"
        ]
    },
    {
        "text": "Q: A pizza place offers 11 toppings. How many different combinations of 7 toppings can be chosen for a pizza?\nA: The number of different combinations of 7 toppings that can be chosen for a pizza with 11 toppings is 11C7=330.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<choose>(11,7)=330<eoe>"
        ],
        "tar_number": [
            "330"
        ]
    },
    {
        "text": "Q: A company has 14 employees. How many ways can you choose a team of 5 employees?\nA: There are 2002 ways to choose a team of 5 employees from 14 employees.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<choose>(14,5)=2002<eoe>"
        ],
        "tar_number": [
            "2002"
        ]
    },
    {
        "text": "Q: A company has 12 employees who need to be split into 8 teams. How many different ways can the company form teams?\nA: The number of different ways the company can form teams is 495.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<choose>(12,8)=495<eoe>"
        ],
        "tar_number": [
            "495"
        ]
    },
    {
        "text": "Q: In a game of poker, each player is dealt 10 cards (out of a deck of 52 cards). How many different hands can be dealt?\nA: The number of different hands that can be dealt is 15820024220.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<choose>(52,10)=15820024220<eoe>"
        ],
        "tar_number": [
            "15820024220"
        ]
    },
    {
        "text": "Q: A teacher has 8 different board games in their classroom. They want to choose 3 games to play during free time. How many different combinations of games can the teacher choose?\nA: The teacher can choose 56 different combinations of games to play during free time.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<choose>(8,3)=56<eoe>"
        ],
        "tar_number": [
            "56"
        ]
    },
    {
        "text": "Q: A company has 9 employees and wants to form a team of 7 employees to work on a project. How many different teams can be formed?\nA: There are 36 different teams that can be formed.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<choose>(9,7)=36<eoe>"
        ],
        "tar_number": [
            "36"
        ]
    },
    {
        "text": "Q: A store has 12 shirts and wants to display 3 shirts on a mannequin. How many ways can they choose the shirts to display?\nA: There are 220 ways to choose 3 shirts from 12 shirts.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<choose>(12,3)=220<eoe>"
        ],
        "tar_number": [
            "220"
        ]
    },
    {
        "text": "Q: In a group of 4 friends, how many ways can you choose 3 friends to attend a party?\nA: The number of ways to choose 3 friends to attend the party from a group of 4 friends is 4C3=4.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<choose>(4,3)=4<eoe>"
        ],
        "tar_number": [
            "4"
        ]
    },
    {
        "text": "Q: A teacher has 14 students and wants to choose a team of 2 students for a competition. How many ways can the teacher choose the team?\nA: The teacher can choose the team in 91 ways.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<choose>(14,2)=91<eoe>"
        ],
        "tar_number": [
            "91"
        ]
    },
    {
        "text": "Q: A committee of 13 people is to be selected from a group of 15 people. How many ways can the committee be selected?\nA: There are 105 ways to select the committee.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<choose>(15,13)=105<eoe>"
        ],
        "tar_number": [
            "105"
        ]
    },
    {
        "text": "Q: A restaurant has 13 dishes on its menu. If a customer wants to order 11 dishes, how many ways can they choose their order?\nA: The number of ways a customer can choose their order of 11 dishes from a menu of 13 dishes is 13C11=78.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<choose>(13,11)=78<eoe>"
        ],
        "tar_number": [
            "78"
        ]
    },
    {
        "text": "Q: A restaurant has 17 different dishes on the menu. If a customer wants to order 8 dishes, how many different combinations of dishes can they choose?\nA: The number of different combinations of dishes the customer can choose is 24310.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<choose>(17,8)=24310<eoe>"
        ],
        "tar_number": [
            "24310"
        ]
    },
    {
        "text": "Q: A basketball team has 16 games left in the season and the coach wants to rest 5 players for a game. How many different groups of players can the coach rest for the game?\nA: The coach can rest 4368 different groups of players for the game.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<choose>(16,5)=4368<eoe>"
        ],
        "tar_number": [
            "4368"
        ]
    },
    {
        "text": "Q: A company has 19 employees. If the CEO wants to form a team of 16 employees for a project, how many different teams can be formed?\nA: The number of different teams that can be formed is 19C16=969.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<choose>(19,16)=969<eoe>"
        ],
        "tar_number": [
            "969"
        ]
    },
    {
        "text": "Q: A pizza restaurant offers 16 toppings for their pizzas. How many different combinations of 4 toppings can a customer choose?\nA: The number of different topping combinations a customer can choose is 1820.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<choose>(16,4)=1820<eoe>"
        ],
        "tar_number": [
            "1820"
        ]
    },
    {
        "text": "Q: A restaurant offers a menu with 20 entrees and customers can choose 8 entrees for their meal. How many different meal combinations are possible?\nA: The number of different meal combinations is 20C8=125970.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<choose>(20,8)=125970<eoe>"
        ],
        "tar_number": [
            "125970"
        ]
    },
    {
        "text": "Q: A restaurant has 16 dishes on its menu. If a customer wants to order 6 dishes, how many ways can they choose their order?\nA: The number of ways a customer can choose their order of 6 dishes from a menu of 16 dishes is 16C6=8008.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<choose>(16,6)=8008<eoe>"
        ],
        "tar_number": [
            "8008"
        ]
    },
    {
        "text": "Q: In a group of 3 friends, they want to choose a team of 2 players to play a game. How many different teams can be chosen?\nA: The number of different teams that can be chosen is 3C2=3.",
        "start_token_idx": [
            52
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<choose>(3,2)=3<eoe>"
        ],
        "tar_number": [
            "3"
        ]
    },
    {
        "text": "Q: In a game of poker, each player is dealt 18 cards (out of a deck of 52 cards). How many different hands can be dealt?\nA: The number of different hands that can be dealt is 42671977361650.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<choose>(52,18)=42671977361650<eoe>"
        ],
        "tar_number": [
            "42671977361650"
        ]
    },
    {
        "text": "Q: A school has 15 teachers, but only 14 can go to a conference. How many different groups of teachers can attend the conference?\nA: The number of different groups of teachers that can attend the conference is 15C14=15.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<choose>(15,14)=15<eoe>"
        ],
        "tar_number": [
            "15"
        ]
    },
    {
        "text": "Q: How many ways can you select 9 books from a shelf containing 12 books?\nA: There are 220 ways to select 9 books from a shelf containing 12 books.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            31
        ],
        "tar_eq": [
            "<choose>(12,9)=220<eoe>"
        ],
        "tar_number": [
            "220"
        ]
    },
    {
        "text": "Q: A bookstore has 8 books on a shelf. If a customer can choose 6 books to purchase, how many different combinations of books can the customer buy?\nA: The number of different combinations of books the customer can buy is 8C6=28.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<choose>(8,6)=28<eoe>"
        ],
        "tar_number": [
            "28"
        ]
    },
    {
        "text": "Q: A company has 12 employees and wants to form a team of 8 employees for a project. How many ways can they form the team?\nA: The number of ways the company can form a team of 8 employees from its 12 employees is 12C8=495.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<choose>(12,8)=495<eoe>"
        ],
        "tar_number": [
            "495"
        ]
    },
    {
        "text": "Q: A factory produces 167 products per day. If they have already produced 87 products, how many more products do they need to produce to reach their daily goal?\nA: The factory needs to produce 167-87=80 more products to reach their daily goal.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            57
        ],
        "tar_eq": [
            "<subtract>(167, 87)=80<eoe>"
        ],
        "tar_number": [
            "80"
        ]
    },
    {
        "text": "Q: A store has 348 apples and sells 75 apples. How many apples are left?\nA: The store had 348 apples and sold 75 apples, so there are 348-75=273 apples left.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<subtract>(348, 75)=273<eoe>"
        ],
        "tar_number": [
            "273"
        ]
    },
    {
        "text": "Q: If a store has 408 pencils and sells 99 pencils, how many pencils are left?\nA: The store has 408-99=309 pencils left.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<subtract>(408, 99)=309<eoe>"
        ],
        "tar_number": [
            "309"
        ]
    },
    {
        "text": "Q: A train is traveling at 324 km/h. If it needs to slow down by 28 km/h, what will be its new speed?\nA: The train is traveling at 324 km/h and needs to slow down by 28 km/h, so its new speed will be 324-28=296 km/h.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            84
        ],
        "tar_eq": [
            "<subtract>(324, 28)=296<eoe>"
        ],
        "tar_number": [
            "296"
        ]
    },
    {
        "text": "Q: A person has 473 dollars in their wallet. They spend 432 dollars on a book. How much money do they have left?\nA: The person has 473 dollars and spends 432 dollars on a book, so they have 473-432=41 dollars left in their wallet.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<subtract>(473, 432)=41<eoe>"
        ],
        "tar_number": [
            "41"
        ]
    },
    {
        "text": "Q: A restaurant has 351 pizzas, but then sells 21 pizzas. How many pizzas are left in the restaurant?\nA: There are 351-21=330 pizzas left in the restaurant.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<subtract>(351, 21)=330<eoe>"
        ],
        "tar_number": [
            "330"
        ]
    },
    {
        "text": "Q: A store has 157 boxes of pencils, but then sells 93 boxes. How many boxes of pencils are left in the store?\nA: There are 157-93=64 boxes of pencils left in the store.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<subtract>(157, 93)=64<eoe>"
        ],
        "tar_number": [
            "64"
        ]
    },
    {
        "text": "Q: A store had 251 items in stock. They sold 93 items yesterday. How many items are left in stock?\nA: The store had 251 items in stock, and 93 items were sold. So, there are 251-93=158 items left in stock.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<subtract>(251, 93)=158<eoe>"
        ],
        "tar_number": [
            "158"
        ]
    },
    {
        "text": "Q: Sarah has 366 dollars in her bank account. She withdraws 7 dollars to pay her rent. How much money does she have left in her account?\nA: Sarah had 366 dollars in her account and withdraws 7 dollars, so she has 366-7=359 dollars left.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<subtract>(366, 7)=359<eoe>"
        ],
        "tar_number": [
            "359"
        ]
    },
    {
        "text": "Q: Mary has 368 apples and she gave away 119 apples to her friends. How many apples does she have left?\nA: Mary had 368 apples and gave away 119 apples, so she has 368-119=249 apples left.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<subtract>(368, 119)=249<eoe>"
        ],
        "tar_number": [
            "249"
        ]
    },
    {
        "text": "Q: A person has 233 dollars in their wallet. They spend 28 dollars on a book. How much money do they have left?\nA: The person has 233 dollars and spends 28 dollars on a book, so they have 233-28=205 dollars left in their wallet.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<subtract>(233, 28)=205<eoe>"
        ],
        "tar_number": [
            "205"
        ]
    },
    {
        "text": "Q: A restaurant has 431 pizzas, but then sells 232 pizzas. How many pizzas are left in the restaurant?\nA: There are 431-232=199 pizzas left in the restaurant.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<subtract>(431, 232)=199<eoe>"
        ],
        "tar_number": [
            "199"
        ]
    },
    {
        "text": "Q: A restaurant has 10 pizzas, but then sells 3 pizzas. How many pizzas are left in the restaurant?\nA: There are 10-3=7 pizzas left in the restaurant.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<subtract>(10, 3)=7<eoe>"
        ],
        "tar_number": [
            "7"
        ]
    },
    {
        "text": "Q: A person had 209 books in their backpack. They took out 11 books to read and left the rest in the backpack. How many books are left in the backpack?\nA: The person has 209-11=198 books left in the backpack.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<subtract>(209, 11)=198<eoe>"
        ],
        "tar_number": [
            "198"
        ]
    },
    {
        "text": "Q: If a store has 414 pencils and sells 136 pencils, how many pencils are left?\nA: The store has 414-136=278 pencils left.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<subtract>(414, 136)=278<eoe>"
        ],
        "tar_number": [
            "278"
        ]
    },
    {
        "text": "Q: Sarah has 326 dollars in her bank account. She withdraws 287 dollars to pay her rent. How much money does she have left in her account?\nA: Sarah had 326 dollars in her account and withdraws 287 dollars, so she has 326-287=39 dollars left.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<subtract>(326, 287)=39<eoe>"
        ],
        "tar_number": [
            "39"
        ]
    },
    {
        "text": "Q: A company produced 389 units of a product in January and 25 units in February. How many more units were produced in January than in February?\nA: The company produced 389 units of the product in January and 25 units in February, so they produced 389-25=364 more units in January than in February.",
        "start_token_idx": [
            71
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<subtract>(389, 25)=364<eoe>"
        ],
        "tar_number": [
            "364"
        ]
    },
    {
        "text": "Q: A teacher gave 111 candies to her students. She then took away 55 candies because some students misbehaved. How many candies does she have left to give away?\nA: The teacher has 111-55=56 candies left to give away.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<subtract>(111, 55)=56<eoe>"
        ],
        "tar_number": [
            "56"
        ]
    },
    {
        "text": "Q: A restaurant had 409 plates of food at the beginning of the day. During lunch, they served 198 plates of food. How many plates of food do they have left for dinner?\nA: The restaurant has 409-198=211 plates of food left for dinner.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<subtract>(409, 198)=211<eoe>"
        ],
        "tar_number": [
            "211"
        ]
    },
    {
        "text": "Q: A person had 377 books in their backpack. They took out 64 books to read and left the rest in the backpack. How many books are left in the backpack?\nA: The person has 377-64=313 books left in the backpack.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<subtract>(377, 64)=313<eoe>"
        ],
        "tar_number": [
            "313"
        ]
    },
    {
        "text": "Q: A store has 50 shirts on sale, but 25 of them have already been sold. How many shirts are left for sale?\nA: There are 25 shirts left for sale because 50-25=<subtract>(50,25)=25.",
        "start_token_idx": [],
        "end_token_idx": [],
        "tar_eq": [],
        "tar_number": []
    },
    {
        "text": "Q: A company made a profit of $115.4 in January. In February, they lost $90.13. What was their net profit for the two months?\nA: The company made a profit of $115.4 in January and lost $90.13 in February, so their net profit for the two months was $115.4-$90.13=25.27.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<subtract>(115.4, 90.13)=25.27<eoe>"
        ],
        "tar_number": [
            "25.27"
        ]
    },
    {
        "text": "Q: If a person weighs 472 pounds and loses 386 pounds, what is their new weight?\nA: The person's new weight is 472-386=86 pounds.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<subtract>(472, 386)=86<eoe>"
        ],
        "tar_number": [
            "86"
        ]
    },
    {
        "text": "Q: A store has 290 apples and sells 268 apples. How many apples are left?\nA: The store had 290 apples and sold 268 apples, so there are 290-268=22 apples left.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<subtract>(290, 268)=22<eoe>"
        ],
        "tar_number": [
            "22"
        ]
    },
    {
        "text": "Q: If a store has 490 pencils and sells 50 pencils, how many pencils are left?\nA: The store has 490-50=440 pencils left.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<subtract>(490, 50)=440<eoe>"
        ],
        "tar_number": [
            "440"
        ]
    },
    {
        "text": "Q: A store has 373 shirts in stock. If they sell 302 shirts today, how many shirts will be left in stock?\nA: The store has 373 shirts in stock and sells 302 shirts today, so they will be left with 373-302=71 shirts in stock.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<subtract>(373, 302)=71<eoe>"
        ],
        "tar_number": [
            "71"
        ]
    },
    {
        "text": "Q: A recipe calls for 475.96 cups of flour. You have already used 316.12 cups. How many cups of flour do you have left to use?\nA: The recipe calls for 475.96 cups of flour and you have already used 316.12 cups, so you have 475.96-316.12=159.84 cups of flour left to use.",
        "start_token_idx": [
            102
        ],
        "end_token_idx": [
            108
        ],
        "tar_eq": [
            "<subtract>(475.96, 316.12)=159.84<eoe>"
        ],
        "tar_number": [
            "159.84"
        ]
    },
    {
        "text": "Q: If a person has 458.27 hours of free time and spends 288.55 hours watching TV, how many hours of free time do they have left?\nA: The person has 458.27-288.55=169.72 hours of free time left.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<subtract>(458.27, 288.55)=169.72<eoe>"
        ],
        "tar_number": [
            "169.72"
        ]
    },
    {
        "text": "Q: A person had 415 books in their backpack. They took out 176 books to read and left the rest in the backpack. How many books are left in the backpack?\nA: The person has 415-176=239 books left in the backpack.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<subtract>(415, 176)=239<eoe>"
        ],
        "tar_number": [
            "239"
        ]
    },
    {
        "text": "Q: A restaurant has 205 pizzas, but then sells 98 pizzas. How many pizzas are left in the restaurant?\nA: There are 205-98=107 pizzas left in the restaurant.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<subtract>(205, 98)=107<eoe>"
        ],
        "tar_number": [
            "107"
        ]
    },
    {
        "text": "Q: A train is traveling at 494 km/h. If it needs to slow down by 402 km/h, what will be its new speed?\nA: The train is traveling at 494 km/h and needs to slow down by 402 km/h, so its new speed will be 494-402=92 km/h.",
        "start_token_idx": [
            84
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<subtract>(494, 402)=92<eoe>"
        ],
        "tar_number": [
            "92"
        ]
    },
    {
        "text": "Q: A company produced 100 units of a product in January and 52 units in February. How many more units were produced in January than in February?\nA: The company produced 100 units of the product in January and 52 units in February, so they produced 100-52=48 more units in January than in February.",
        "start_token_idx": [
            71
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<subtract>(100, 52)=48<eoe>"
        ],
        "tar_number": [
            "48"
        ]
    },
    {
        "text": "Q: Sarah has 187 dollars in her bank account. She withdraws 179 dollars to pay her rent. How much money does she have left in her account?\nA: Sarah had 187 dollars in her account and withdraws 179 dollars, so she has 187-179=8 dollars left.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<subtract>(187, 179)=8<eoe>"
        ],
        "tar_number": [
            "8"
        ]
    },
    {
        "text": "Q: A store had 307 pencils in stock. They sold 177 pencils today. How many pencils are left in the store?\nA: The store had 307 pencils and sold 177 pencils, so there are 307-177=130 pencils left in the store.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<subtract>(307, 177)=130<eoe>"
        ],
        "tar_number": [
            "130"
        ]
    },
    {
        "text": "Q: A restaurant had 43 plates of food at the beginning of the day. During lunch, they served 26 plates of food. How many plates of food do they have left for dinner?\nA: The restaurant has 43-26=17 plates of food left for dinner.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<subtract>(43, 26)=17<eoe>"
        ],
        "tar_number": [
            "17"
        ]
    },
    {
        "text": "Q: A teacher gave 162 candies to her students. She then took away 151 candies because some students misbehaved. How many candies does she have left to give away?\nA: The teacher has 162-151=11 candies left to give away.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<subtract>(162, 151)=11<eoe>"
        ],
        "tar_number": [
            "11"
        ]
    },
    {
        "text": "Q: A store had 419 boxes of cookies on Monday. On Tuesday, they sold 413 boxes of cookies. How many boxes of cookies are left in the store?\nA: The store had 419 boxes of cookies on Monday and sold 413 boxes on Tuesday, so they have 419-413=6 boxes of cookies left.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            82
        ],
        "tar_eq": [
            "<subtract>(419, 413)=6<eoe>"
        ],
        "tar_number": [
            "6"
        ]
    },
    {
        "text": "Q: A man had 468 dollars in his wallet. He spent 6 dollars on a movie ticket. How much money does he have left now?\nA: The man had 468 dollars and spent 6 dollars on a movie ticket, so he has 468-6=462 dollars left.",
        "start_token_idx": [
            66
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<subtract>(468, 6)=462<eoe>"
        ],
        "tar_number": [
            "462"
        ]
    },
    {
        "text": "Q: A store had 268 shirts on the shelf. They sold 28 shirts to customers. How many shirts are left on the shelf?\nA: The store has 268-28=240 shirts left on the shelf.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<subtract>(268, 28)=240<eoe>"
        ],
        "tar_number": [
            "240"
        ]
    },
    {
        "text": "Q: A store has 329 shirts in stock. If they sell 8 shirts today, how many shirts will be left in stock?\nA: The store has 329 shirts in stock and sells 8 shirts today, so they will be left with 329-8=321 shirts in stock.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<subtract>(329, 8)=321<eoe>"
        ],
        "tar_number": [
            "321"
        ]
    },
    {
        "text": "Q: A person had 463 books in their backpack. They took out 97 books to read and left the rest in the backpack. How many books are left in the backpack?\nA: The person has 463-97=366 books left in the backpack.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<subtract>(463, 97)=366<eoe>"
        ],
        "tar_number": [
            "366"
        ]
    },
    {
        "text": "Q: A company has 362 employees. If 131 employees leave the company, how many employees are left in the company?\nA: The company has 362 employees and 131 employees leave, so there are 362-131=231 employees left in the company.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<subtract>(362, 131)=231<eoe>"
        ],
        "tar_number": [
            "231"
        ]
    },
    {
        "text": "Q: A store had 268 shirts on the shelf. They sold 104 shirts to customers. How many shirts are left on the shelf?\nA: The store has 268-104=164 shirts left on the shelf.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<subtract>(268, 104)=164<eoe>"
        ],
        "tar_number": [
            "164"
        ]
    },
    {
        "text": "Q: If a store has 490 items in stock and 67 items are sold, how many items are left in stock?\nA: There are 490-67=423 items left in stock.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<subtract>(490, 67)=423<eoe>"
        ],
        "tar_number": [
            "423"
        ]
    },
    {
        "text": "Q: If a person has 431.01 hours of free time and spends 273.66 hours watching TV, how many hours of free time do they have left?\nA: The person has 431.01-273.66=157.35 hours of free time left.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<subtract>(431.01, 273.66)=157.35<eoe>"
        ],
        "tar_number": [
            "157.35"
        ]
    },
    {
        "text": "Q: A store had 374 shirts on the shelf. They sold 247 shirts to customers. How many shirts are left on the shelf?\nA: The store has 374-247=127 shirts left on the shelf.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<subtract>(374, 247)=127<eoe>"
        ],
        "tar_number": [
            "127"
        ]
    },
    {
        "text": "Q: A company has 476 employees. If 350 employees leave the company, how many employees are left in the company?\nA: The company has 476 employees and 350 employees leave, so there are 476-350=126 employees left in the company.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<subtract>(476, 350)=126<eoe>"
        ],
        "tar_number": [
            "126"
        ]
    },
    {
        "text": "Q: A car travels 474 miles per hour. If it travels for 36.59 hours, how many miles will it travel in total?\nA: The car will travel 474*36.59=17343.66 miles in total.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<multiply>(474, 36.59)=17343.66<eoe>"
        ],
        "tar_number": [
            "17343.66"
        ]
    },
    {
        "text": "Q: A car can travel 398.99 miles per gallon of gas. If the car's gas tank can hold 185.96 gallons of gas, how many miles can the car travel on a full tank?\nA: The car can travel 398.99 miles per gallon of gas, so it can travel 398.99*185.96=74196.18 miles on a full tank.",
        "start_token_idx": [
            94
        ],
        "end_token_idx": [
            102
        ],
        "tar_eq": [
            "<multiply>(398.99, 185.96)=74196.18<eoe>"
        ],
        "tar_number": [
            "74196.18"
        ]
    },
    {
        "text": "Q: A car travels at a speed of 280 kilometers per hour for 457 hours. How far does it go?\nA: The car travels 280*457=127960 kilometers.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<multiply>(280, 457)=127960<eoe>"
        ],
        "tar_number": [
            "127960"
        ]
    },
    {
        "text": "Q: A company produces 173 widgets per hour. How many widgets can they produce in a 385-hour workday?\nA: If the company produces 173 widgets per hour, then they can produce 173*385=66605 widgets in a 385-hour workday.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<multiply>(173, 385)=66605<eoe>"
        ],
        "tar_number": [
            "66605"
        ]
    },
    {
        "text": "Q: If there are 301 students in a classroom and each student has 295 pencils, how many pencils are there in total?\nA: There are 301*295=88795 pencils in total.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<multiply>(301, 295)=88795<eoe>"
        ],
        "tar_number": [
            "88795"
        ]
    },
    {
        "text": "Q: If a train travels at a speed of 236 miles per hour for 297.92 hours, how far will it travel?\nA: The train will travel 236*297.92=70309.12 miles in total.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<multiply>(236, 297.92)=70309.12<eoe>"
        ],
        "tar_number": [
            "70309.12"
        ]
    },
    {
        "text": "Q: If a wall is 313.51 feet long, and I want to paint 440 coats of paint on it, how much paint will I need in total?\nA: You will need a total of 313.51*440=137944.4 square feet of paint.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<multiply>(313.51, 440)=137944.4<eoe>"
        ],
        "tar_number": [
            "137944.4"
        ]
    },
    {
        "text": "Q: A company pays its employees 301.85 dollars per hour. If an employee works for 221 hours, how much will they earn?\nA: If an employee is paid 301.85 dollars per hour and works for 221 hours, then they will earn 301.85*221=66708.85 dollars.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            89
        ],
        "tar_eq": [
            "<multiply>(301.85, 221)=66708.85<eoe>"
        ],
        "tar_number": [
            "66708.85"
        ]
    },
    {
        "text": "Q: A field is 349.85 meters long and 421.36 meters wide. What is the area of the field?\nA: The area of the field is 349.85*421.36=147412.8 square meters.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<multiply>(349.85, 421.36)=147412.8<eoe>"
        ],
        "tar_number": [
            "147412.8"
        ]
    },
    {
        "text": "Q: If a car can travel 26 miles on a gallon of gas, and I have 6.16 gallons of gas, how many miles can I travel?\nA: You can travel a total of 26*6.16=160.16 miles.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<multiply>(26, 6.16)=160.16<eoe>"
        ],
        "tar_number": [
            "160.16"
        ]
    },
    {
        "text": "Q: If a recipe calls for 125.24 cups of flour and I want to make 253 batches, how many cups of flour will I need in total?\nA: You will need 125.24*253=31685.72 cups of flour in total.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<multiply>(125.24, 253)=31685.72<eoe>"
        ],
        "tar_number": [
            "31685.72"
        ]
    },
    {
        "text": "Q: If there are 190 students in a classroom and each student has 19 pencils, how many pencils are there in total?\nA: There are 190*19=3610 pencils in total.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<multiply>(190, 19)=3610<eoe>"
        ],
        "tar_number": [
            "3610"
        ]
    },
    {
        "text": "Q: A store sells 259 packs of pencils, with 389 pencils in each pack. How many pencils are in 259 packs?\nA: There are 259*389=100751 pencils in 259 packs.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<multiply>(259, 389)=100751<eoe>"
        ],
        "tar_number": [
            "100751"
        ]
    },
    {
        "text": "Q: A box contains 140 items and each item weighs 257.74 pounds. What is the total weight of the items in the box?\nA: Each item weighs 257.74 pounds, so 140 items weigh 140*257.74=36083.6 pounds in total.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            82
        ],
        "tar_eq": [
            "<multiply>(140, 257.74)=36083.6<eoe>"
        ],
        "tar_number": [
            "36083.6"
        ]
    },
    {
        "text": "Q: A box contains 123 items and each item weighs 125.14 pounds. What is the total weight of the items in the box?\nA: Each item weighs 125.14 pounds, so 123 items weigh 123*125.14=15392.22 pounds in total.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<multiply>(123, 125.14)=15392.22<eoe>"
        ],
        "tar_number": [
            "15392.22"
        ]
    },
    {
        "text": "Q: A car can travel 151.59 miles on one gallon of gas. How far can the car travel with 135 gallons of gas?\nA: The car can travel 151.59 miles on one gallon of gas, so it can travel 151.59*135=20464.65 miles with 135 gallons of gas.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            84
        ],
        "tar_eq": [
            "<multiply>(151.59, 135)=20464.65<eoe>"
        ],
        "tar_number": [
            "20464.65"
        ]
    },
    {
        "text": "Q: If a car travels at 468 miles per hour for 415 hours, how many miles does it travel?\nA: The car travels 468*415=194220 miles.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<multiply>(468, 415)=194220<eoe>"
        ],
        "tar_number": [
            "194220"
        ]
    },
    {
        "text": "Q: A company produces 355 units of a product every hour. How many units will the company produce in 474 hours?\nA: The company produces 355 units of the product every hour, so in 474 hours, it will produce 355*474=168270 units.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<multiply>(355, 474)=168270<eoe>"
        ],
        "tar_number": [
            "168270"
        ]
    },
    {
        "text": "Q: A store sells 253 shirts for $443.98 each. How much money will they make?\nA: If the store sells 253 shirts for $443.98 each, then they will make $253*443.98=112326.94 in total.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<multiply>(253, 443.98)=112326.94<eoe>"
        ],
        "tar_number": [
            "112326.94"
        ]
    },
    {
        "text": "Q: A pizza costs 160.63 dollars and you want to buy 47 pizzas. How much money will you spend?\nA: Each pizza costs 160.63 dollars, so 47 pizzas will cost 160.63*47=7549.61 dollars.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<multiply>(160.63, 47)=7549.61<eoe>"
        ],
        "tar_number": [
            "7549.61"
        ]
    },
    {
        "text": "Q: If a person works for 3.55 hours and earns 197.68 dollars per hour, how much will they earn?\nA: The person will earn 3.55*197.68=701.76 dollars.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<multiply>(3.55, 197.68)=701.76<eoe>"
        ],
        "tar_number": [
            "701.76"
        ]
    },
    {
        "text": "Q: A garden is 303.32 feet long and 459.63 feet wide. What is the area of the garden?\nA: The area of the garden is 303.32*459.63=139414.97 square feet.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<multiply>(303.32, 459.63)=139414.97<eoe>"
        ],
        "tar_number": [
            "139414.97"
        ]
    },
    {
        "text": "Q: If a store sells 404 shirts for $86.0 each, how much money will the store make if it sells all of the shirts?\nA: The store sells 404 shirts for $86.0 each, therefore, they will make $404*86.0=34744 in total.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<multiply>(404, 86.0)=34744<eoe>"
        ],
        "tar_number": [
            "34744"
        ]
    },
    {
        "text": "Q: A pizza costs 327.99 dollars and you want to buy 14 pizzas. How much money will you spend?\nA: Each pizza costs 327.99 dollars, so 14 pizzas will cost 327.99*14=4591.86 dollars.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<multiply>(327.99, 14)=4591.86<eoe>"
        ],
        "tar_number": [
            "4591.86"
        ]
    },
    {
        "text": "Q: A car travels at a speed of 167.08 miles per hour. How far can the car travel in 223.27 hours?\nA: The car travels at a speed of 167.08 miles per hour, so it can travel 167.08*223.27=37303.95 miles in 223.27 hours.",
        "start_token_idx": [
            79
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<multiply>(167.08, 223.27)=37303.95<eoe>"
        ],
        "tar_number": [
            "37303.95"
        ]
    },
    {
        "text": "Q: A car travels at a speed of 494 miles per hour. How far can it travel in 441.95 hours?\nA: The car can travel 494*441.95=218323.3 miles in 441.95 hours.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<multiply>(494, 441.95)=218323.3<eoe>"
        ],
        "tar_number": [
            "218323.3"
        ]
    },
    {
        "text": "Q: A package of paper towels contains 345 rolls, and each roll has 290 sheets. How many sheets are in the package?\nA: There are 345*290=100050 sheets in the package.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<multiply>(345, 290)=100050<eoe>"
        ],
        "tar_number": [
            "100050"
        ]
    },
    {
        "text": "Q: A garden is 92.24 feet long and 203.75 feet wide. What is the area of the garden?\nA: The area of the garden is 92.24*203.75=18793.9 square feet.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<multiply>(92.24, 203.75)=18793.9<eoe>"
        ],
        "tar_number": [
            "18793.9"
        ]
    },
    {
        "text": "Q: A store sells apples in bags of 82 apples. If a customer buys 107 bags, how many apples did the customer buy?\nA: Each bag has 82 apples, so the customer bought 82*107=8774 apples in total.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<multiply>(82, 107)=8774<eoe>"
        ],
        "tar_number": [
            "8774"
        ]
    },
    {
        "text": "Q: A garden is 26.85 feet long and 456.63 feet wide. What is the area of the garden in square feet?\nA: The area of the garden is 26.85*456.63=12260.52 square feet.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            67
        ],
        "tar_eq": [
            "<multiply>(26.85, 456.63)=12260.52<eoe>"
        ],
        "tar_number": [
            "12260.52"
        ]
    },
    {
        "text": "Q: If a bag of rice weighs 135.43 kg and I need to buy 132 bags of rice, what is the total weight of rice I will purchase?\nA: The total weight of rice I will purchase is 135.43*132=17876.76 kg.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<multiply>(135.43, 132)=17876.76<eoe>"
        ],
        "tar_number": [
            "17876.76"
        ]
    },
    {
        "text": "Q: A company produces 34 units of a product every hour. How many units will the company produce in 395 hours?\nA: The company produces 34 units of the product every hour, so in 395 hours, it will produce 34*395=13430 units.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<multiply>(34, 395)=13430<eoe>"
        ],
        "tar_number": [
            "13430"
        ]
    },
    {
        "text": "Q: If a car travels at 70 miles per hour for 308 hours, how many miles does it travel?\nA: The car travels 70*308=21560 miles.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<multiply>(70, 308)=21560<eoe>"
        ],
        "tar_number": [
            "21560"
        ]
    },
    {
        "text": "Q: If a recipe calls for 420.56 cups of flour and I want to make 429 batches, how many cups of flour will I need in total?\nA: You will need 420.56*429=180420.24 cups of flour in total.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<multiply>(420.56, 429)=180420.24<eoe>"
        ],
        "tar_number": [
            "180420.24"
        ]
    },
    {
        "text": "Q: A field is 13.14 meters long and 496.62 meters wide. What is the area of the field?\nA: The area of the field is 13.14*496.62=6525.59 square meters.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<multiply>(13.14, 496.62)=6525.59<eoe>"
        ],
        "tar_number": [
            "6525.59"
        ]
    },
    {
        "text": "Q: A company pays its employees 370.33 dollars per hour. If an employee works for 320 hours, how much will they earn?\nA: If an employee is paid 370.33 dollars per hour and works for 320 hours, then they will earn 370.33*320=118505.6 dollars.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            89
        ],
        "tar_eq": [
            "<multiply>(370.33, 320)=118505.6<eoe>"
        ],
        "tar_number": [
            "118505.6"
        ]
    },
    {
        "text": "Q: If a car travels at a speed of 15 miles per hour for 218 hours, how far does it travel?\nA: The car travels 3270 miles in total.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<multiply>(15, 218)=3270<eoe>"
        ],
        "tar_number": [
            "3270"
        ]
    },
    {
        "text": "Q: If a container can hold 262 ounces of liquid and you need to fill it 21 times, how many total ounces of liquid do you need?\nA: You need 262*21=5502<eoe>5502 ounces of liquid.",
        "start_token_idx": [],
        "end_token_idx": [],
        "tar_eq": [],
        "tar_number": []
    },
    {
        "text": "Q: A store sells 131 shirts for $429.38 each. How much money will they make?\nA: If the store sells 131 shirts for $429.38 each, then they will make $131*429.38=56248.78 dollars.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<multiply>(131, 429.38)=56248.78<eoe>"
        ],
        "tar_number": [
            "56248.78"
        ]
    },
    {
        "text": "Q: A car can travel 92.89 miles per gallon of gas. If the car's gas tank can hold 400.36 gallons of gas, how many miles can the car travel on a full tank?\nA: The car can travel 92.89 miles per gallon of gas, so it can travel 92.89*400.36=37189.44 miles on a full tank.",
        "start_token_idx": [
            91
        ],
        "end_token_idx": [
            99
        ],
        "tar_eq": [
            "<multiply>(92.89, 400.36)=37189.44<eoe>"
        ],
        "tar_number": [
            "37189.44"
        ]
    },
    {
        "text": "Q: If a recipe calls for 39 cups of flour and I want to make 220 batches, how many cups of flour do I need in total?\nA: You will need 39*220=8580 cups of flour in total.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<multiply>(39, 220)=8580<eoe>"
        ],
        "tar_number": [
            "8580"
        ]
    },
    {
        "text": "Q: A car travels 73 miles per hour. If it travels for 137.02 hours, how many miles will it travel in total?\nA: The car will travel 73*137.02=10002.46 miles in total.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<multiply>(73, 137.02)=10002.46<eoe>"
        ],
        "tar_number": [
            "10002.46"
        ]
    },
    {
        "text": "Q: A package of paper towels contains 442 rolls, and each roll has 48 sheets. How many sheets are in the package?\nA: There are 442*48=21216 sheets in the package.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<multiply>(442, 48)=21216<eoe>"
        ],
        "tar_number": [
            "21216"
        ]
    },
    {
        "text": "Q: If a car travels at a speed of 99.6 miles per hour for 162 hours, how far has it traveled?\nA: The car has traveled 99.6*162=16135.2 miles.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<multiply>(99.6, 162)=16135.2<eoe>"
        ],
        "tar_number": [
            "16135.2"
        ]
    },
    {
        "text": "Q: A store sells 113 shirts for $329.75 each. How much money will they make ?\nA: If the store sells 113 shirts for $329.75 each, then they will make $113*329.75=37261.75.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<multiply>(113, 329.75)=37261.75<eoe>"
        ],
        "tar_number": [
            "37261.75"
        ]
    },
    {
        "text": "Q: If a container can hold 211 ounces of liquid and you need to fill it 270 times, how many total ounces of liquid do you need?\nA: You need 211*270=56970<eoe>56970 ounces of liquid.",
        "start_token_idx": [],
        "end_token_idx": [],
        "tar_eq": [],
        "tar_number": []
    },
    {
        "text": "Q: If a company pays its employees $475.67 per hour and an employee works for 474.97 hours, how much will the employee earn?\nA: The employee will earn $475.67*474.97=225928.98 for 474.97 hours of work.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<multiply>(475.67, 474.97)=225928.98<eoe>"
        ],
        "tar_number": [
            "225928.98"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 559 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 23.64 inches.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<sqrt>(559)=23.64<eoe>"
        ],
        "tar_number": [
            "23.64"
        ]
    },
    {
        "text": "Q: A square garden has an area of 1004.25 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 31.69 feet.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(1004.25)=31.69<eoe>"
        ],
        "tar_number": [
            "31.69"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 7229?\nA: The square root of 7229 is 85.02.",
        "start_token_idx": [
            32
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<sqrt>(7229)=85.02<eoe>"
        ],
        "tar_number": [
            "85.02"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 275. What is the standard deviation of the list ?\nA: The standard deviation of the list is 16.58.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<sqrt>(275)=16.58<eoe>"
        ],
        "tar_number": [
            "16.58"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 1704.57?\nA: The square root of 1704.57 is 41.29.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<sqrt>(1704.57)=41.29<eoe>"
        ],
        "tar_number": [
            "41.29"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 4121, what is the standard deviation?\nA: The standard deviation is 64.2.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<sqrt>(4121)=64.2<eoe>"
        ],
        "tar_number": [
            "64.2"
        ]
    },
    {
        "text": "Q: What is the square root of 2786.65?\nA: The square root of 2786.65 is 52.79.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(2786.65)=52.79<eoe>"
        ],
        "tar_number": [
            "52.79"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 3783. What is the standard deviation of the list ?\nA: The standard deviation of the list is 61.51.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<sqrt>(3783)=61.51<eoe>"
        ],
        "tar_number": [
            "61.51"
        ]
    },
    {
        "text": "Q: What is the result of √5967.88?\nA: The value of √5967.88 is 77.25.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(5967.88)=77.25<eoe>"
        ],
        "tar_number": [
            "77.25"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 4816.44 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 69.4 inches.",
        "start_token_idx": [
            47
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(4816.44)=69.4<eoe>"
        ],
        "tar_number": [
            "69.4"
        ]
    },
    {
        "text": "Q: What is the square root of 7895.09?\nA: The square root of 7895.09 is 88.85.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(7895.09)=88.85<eoe>"
        ],
        "tar_number": [
            "88.85"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 4364. What is the standard deviation of the list ?\nA: The standard deviation of the list is 66.06.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<sqrt>(4364)=66.06<eoe>"
        ],
        "tar_number": [
            "66.06"
        ]
    },
    {
        "text": "Q: What is the result of √6337.44?\nA: The value of √6337.44 is 79.61.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(6337.44)=79.61<eoe>"
        ],
        "tar_number": [
            "79.61"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 8524.58. What is the standard deviation of the list ?\nA: The standard deviation of the list is 92.33.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<sqrt>(8524.58)=92.33<eoe>"
        ],
        "tar_number": [
            "92.33"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 4053 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 63.66 inches.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<sqrt>(4053)=63.66<eoe>"
        ],
        "tar_number": [
            "63.66"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 8774. What is the standard deviation of the list ?\nA: The standard deviation of the list is 93.67.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<sqrt>(8774)=93.67<eoe>"
        ],
        "tar_number": [
            "93.67"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 9720. What is the standard deviation of the list ?\nA: The standard deviation of the list is 98.59.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<sqrt>(9720)=98.59<eoe>"
        ],
        "tar_number": [
            "98.59"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 4387.16. What is the standard deviation of the list ?\nA: The standard deviation of the list is 66.24.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<sqrt>(4387.16)=66.24<eoe>"
        ],
        "tar_number": [
            "66.24"
        ]
    },
    {
        "text": "Q: What is the square root of 5195?\nA: The square root of 5195 is 72.08.",
        "start_token_idx": [
            29
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<sqrt>(5195)=72.08<eoe>"
        ],
        "tar_number": [
            "72.08"
        ]
    },
    {
        "text": "Q: What is the length of the side of a square with an area of 1600 square meters?\nA: The length of the side of the square is 40 meters.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(1600)=40<eoe>"
        ],
        "tar_number": [
            "40"
        ]
    },
    {
        "text": "Q: What is the square root of 6512?\nA: The square root of 6512 is 80.7.",
        "start_token_idx": [
            29
        ],
        "end_token_idx": [
            33
        ],
        "tar_eq": [
            "<sqrt>(6512)=80.7<eoe>"
        ],
        "tar_number": [
            "80.7"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 9571.1, what is the standard deviation?\nA: The standard deviation is 97.83.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<sqrt>(9571.1)=97.83<eoe>"
        ],
        "tar_number": [
            "97.83"
        ]
    },
    {
        "text": "Q: What is the result of √716?\nA: The value of √716 is 26.76.",
        "start_token_idx": [
            27
        ],
        "end_token_idx": [
            32
        ],
        "tar_eq": [
            "<sqrt>(716)=26.76<eoe>"
        ],
        "tar_number": [
            "26.76"
        ]
    },
    {
        "text": "Q: What is the square root of 8917.43?\nA: The square root of 8917.43 is 94.43.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(8917.43)=94.43<eoe>"
        ],
        "tar_number": [
            "94.43"
        ]
    },
    {
        "text": "Q: What is the length of the side of a square with an area of 4229.89 square meters?\nA: The length of the side of the square is 65.04 meters.",
        "start_token_idx": [
            41
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<sqrt>(4229.89)=65.04<eoe>"
        ],
        "tar_number": [
            "65.04"
        ]
    },
    {
        "text": "Q: A square garden has an area of 2878.73 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 53.65 feet.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(2878.73)=53.65<eoe>"
        ],
        "tar_number": [
            "53.65"
        ]
    },
    {
        "text": "Q: A square garden has an area of 4916.8 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 70.12 feet.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<sqrt>(4916.8)=70.12<eoe>"
        ],
        "tar_number": [
            "70.12"
        ]
    },
    {
        "text": "Q: A square garden has an area of 2274 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 47.69 feet.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<sqrt>(2274)=47.69<eoe>"
        ],
        "tar_number": [
            "47.69"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 4754, what is the standard deviation?\nA: The standard deviation is 68.95.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<sqrt>(4754)=68.95<eoe>"
        ],
        "tar_number": [
            "68.95"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 7275?\nA: The square root of 7275 is 85.29.",
        "start_token_idx": [
            32
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<sqrt>(7275)=85.29<eoe>"
        ],
        "tar_number": [
            "85.29"
        ]
    },
    {
        "text": "Q: A square garden has an area of 5813.51 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 76.25 feet.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(5813.51)=76.25<eoe>"
        ],
        "tar_number": [
            "76.25"
        ]
    },
    {
        "text": "Q: What is the square root of 4.96?\nA: The square root of 4.96 is 2.23.",
        "start_token_idx": [
            29
        ],
        "end_token_idx": [
            33
        ],
        "tar_eq": [
            "<sqrt>(4.96)=2.23<eoe>"
        ],
        "tar_number": [
            "2.23"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 9280 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 96.33 inches.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<sqrt>(9280)=96.33<eoe>"
        ],
        "tar_number": [
            "96.33"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 6796 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 82.44 inches.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<sqrt>(6796)=82.44<eoe>"
        ],
        "tar_number": [
            "82.44"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 9415, what is the standard deviation?\nA: The standard deviation is 97.03.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<sqrt>(9415)=97.03<eoe>"
        ],
        "tar_number": [
            "97.03"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 7584?\nA: The square root of 7584 is 87.09.",
        "start_token_idx": [
            32
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<sqrt>(7584)=87.09<eoe>"
        ],
        "tar_number": [
            "87.09"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 6800.0. What is the standard deviation of the list ?\nA: The standard deviation of the list is 82.46.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            44
        ],
        "tar_eq": [
            "<sqrt>(6800.0)=82.46<eoe>"
        ],
        "tar_number": [
            "82.46"
        ]
    },
    {
        "text": "Q: A square garden has an area of 7693 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 87.71 feet.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<sqrt>(7693)=87.71<eoe>"
        ],
        "tar_number": [
            "87.71"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 4722.09?\nA: The square root of 4722.09 is 68.72.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<sqrt>(4722.09)=68.72<eoe>"
        ],
        "tar_number": [
            "68.72"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 1806 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 42.5 inches.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<sqrt>(1806)=42.5<eoe>"
        ],
        "tar_number": [
            "42.5"
        ]
    },
    {
        "text": "Q: A square garden has an area of 4270 square feet. What is the length of one side of the garden?\nA: The length of one side of the square garden is 65.35 feet.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<sqrt>(4270)=65.35<eoe>"
        ],
        "tar_number": [
            "65.35"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 218.17 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 14.77 inches.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(218.17)=14.77<eoe>"
        ],
        "tar_number": [
            "14.77"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 8588?\nA: The square root of 8588 is 92.67.",
        "start_token_idx": [
            32
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<sqrt>(8588)=92.67<eoe>"
        ],
        "tar_number": [
            "92.67"
        ]
    },
    {
        "text": "Q: What is the result of √7496.38?\nA: The value of √7496.38 is 86.58.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<sqrt>(7496.38)=86.58<eoe>"
        ],
        "tar_number": [
            "86.58"
        ]
    },
    {
        "text": "Q: If a sqaure has an area of 2997.0 square inches, what is the length of one side of the square?\nA: The length of one side of the square is 54.74 inches.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<sqrt>(2997.0)=54.74<eoe>"
        ],
        "tar_number": [
            "54.74"
        ]
    },
    {
        "text": "Q: What is the value of the square root of 2477.54?\nA: The square root of 2477.54 is 49.77.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<sqrt>(2477.54)=49.77<eoe>"
        ],
        "tar_number": [
            "49.77"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 478.54, what is the standard deviation?\nA: The standard deviation is 21.88.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<sqrt>(478.54)=21.88<eoe>"
        ],
        "tar_number": [
            "21.88"
        ]
    },
    {
        "text": "Q: In a game of cards, how many ways can you arrange 5 cards from a deck of 6 cards?\nA: There are 6P5=720 ways to arrange the cards.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<permutate>(6,5)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: A group of 10 people are going to be arranged in a straight line for a parade. In how many ways can the people be arranged?\nA: The number of possible arrangements is 3628800.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<permutate>(10,10)=3628800<eoe>"
        ],
        "tar_number": [
            "3628800"
        ]
    },
    {
        "text": "Q: A music playlist has 11 songs on it. In how many ways can 4 songs be played in a row?\nA: The number of ways to play 4 songs in a row from a playlist with 11 songs is 7920.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<permutate>(11,4)=7920<eoe>"
        ],
        "tar_number": [
            "7920"
        ]
    },
    {
        "text": "Q: How many different ways can you arrange 9 books on 7 shelves if each shelf can hold all the books?\nA: The number of different ways is 181440.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<permutate>(9,7)=181440<eoe>"
        ],
        "tar_number": [
            "181440"
        ]
    },
    {
        "text": "Q: A group of 8 people are going to be arranged in a straight line for a parade. In how many ways can the people be arranged?\nA: The number of possible arrangements is 40320.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<permutate>(8,8)=40320<eoe>"
        ],
        "tar_number": [
            "40320"
        ]
    },
    {
        "text": "Q: A restaurant has 3 tables and needs to seat 2 customers. How many different ways can the customers be seated?\nA: There are 6 different ways the customers can be seated with 2 customers.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            35
        ],
        "tar_eq": [
            "<permutate>(3,2)=6<eoe>"
        ],
        "tar_number": [
            "6"
        ]
    },
    {
        "text": "Q: A school has 7 teachers and 6 classrooms. If each classroom must have a different teacher, how many ways can the teachers be assigned to the classrooms?\nA: The number of ways to assign the teachers to the classrooms is 7P6 = 5040.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<permutate>(7,6) = 5040<eoe>"
        ],
        "tar_number": [
            " 5040"
        ]
    },
    {
        "text": "Q: A restaurant has 6 tables, how many ways can the manager arrange 5 tables for a reservation?\nA: There are 6P5=720 ways to arrange the tables for a reservation.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<permutate>(6,5)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: A group of 7 friends wants to take a photo together. Only 6 of them can fit in the photo. How many possible arrangements are there?\nA: There are 6 friends in the photo, and the total number of friends is 7. Therefore, the number of ways to arrange them is 7P6=5040.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<permutate>(7,6)=5040<eoe>"
        ],
        "tar_number": [
            "5040"
        ]
    },
    {
        "text": "Q: A restaurant has 11 tables, how many ways can the manager arrange 2 tables for a reservation?\nA: There are 11P2=110 ways to arrange the tables for a reservation.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<permutate>(11,2)=110<eoe>"
        ],
        "tar_number": [
            "110"
        ]
    },
    {
        "text": "Q: A music playlist has 3 songs on it. In how many ways can 2 songs be played in a row?\nA: The number of ways to play 2 songs in a row from a playlist with 3 songs is 6.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<permutate>(3,2)=6<eoe>"
        ],
        "tar_number": [
            "6"
        ]
    },
    {
        "text": "Q: A team of 11 athletes is competing in a relay race. How many possible orders are there for the top 6 finishers?\nA: There are 332640 possible orders for the top 6 finishers.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<permutate>(11,6)=332640<eoe>"
        ],
        "tar_number": [
            "332640"
        ]
    },
    {
        "text": "Q: A store has 6 items on clearance. If they want to arrange 4 items in the display window, how many ways can they do so?\nA: The number of ways to arrange the items in the display window is 6P4=360.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<permutate>(6,4)=360<eoe>"
        ],
        "tar_number": [
            "360"
        ]
    },
    {
        "text": "Q: A deck of cards has 3 cards. How many ways can you arrange 2 cards in a row?\nA: The number of ways to arrange 2 cards out of 3 cards is 3P2=6.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<permutate>(3,2)=6<eoe>"
        ],
        "tar_number": [
            "6"
        ]
    },
    {
        "text": "Q: A music playlist has 5 songs on it. In how many ways can 2 songs be played in a row?\nA: The number of ways to play 2 songs in a row from a playlist with 5 songs is 20.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<permutate>(5,2)=20<eoe>"
        ],
        "tar_number": [
            "20"
        ]
    },
    {
        "text": "Q: A student is taking a multiple choice test with 6 questions. Each question has 4 answer choices. In how many ways can the student answer all the questions?\nA: There are 360 ways for the student to answer all the questions.",
        "start_token_idx": [
            42
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<permutate>(6,4)=360<eoe>"
        ],
        "tar_number": [
            "360"
        ]
    },
    {
        "text": "Q: A company has 7 employees and wants to form a committee of 6 members with different positions, how many ways can they form the committee?\nA: The number of ways to form a committee of 6 members out of 7 employees is 7P6=5040.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<permutate>(7,6)=5040<eoe>"
        ],
        "tar_number": [
            "5040"
        ]
    },
    {
        "text": "Q: A teacher has 6 students and wants to randomly assign them to 6 desks. How many different desk arrangements are possible?\nA: The number of different desk arrangements for 6 students on 6 desks is 720.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<permutate>(6,6)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: If there are 6 participants in a race, in how many ways can the top 4 finishers be determined?\nA: The number of ways is 6P4=360.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<permutate>(6,4)=360<eoe>"
        ],
        "tar_number": [
            "360"
        ]
    },
    {
        "text": "Q: A group of 8 people are going to be arranged in a straight line for a parade. In how many ways can the people be arranged?\nA: The number of possible arrangements is 40320.",
        "start_token_idx": [
            44
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<permutate>(8,8)=40320<eoe>"
        ],
        "tar_number": [
            "40320"
        ]
    },
    {
        "text": "Q: A deck of cards has 10 cards. In how many ways can you deal 8 cards to a player?\nA: The number of ways you can deal 8 cards to a player is 1814400.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<permutate>(10,8)=1814400<eoe>"
        ],
        "tar_number": [
            "1814400"
        ]
    },
    {
        "text": "Q: A group of 3 students want to form a committee consisting of a president, vice-president, and secretary. How many ways can the committee be formed if any student can hold any position?\nA: The number of possible committees is 3P3 = 6.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<permutate>(3,3)=6<eoe>"
        ],
        "tar_number": [
            "6"
        ]
    },
    {
        "text": "Q: A music festival has 12 bands playing. In how many ways can you choose a lineup of 8 bands to perform?\nA: The number of ways to choose a lineup of 8 bands is 19958400.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<permutate>(12,8)=19958400<eoe>"
        ],
        "tar_number": [
            "19958400"
        ]
    },
    {
        "text": "Q: A group of 10 friends are taking a road trip. In how many ways can they split into two groups, with one group having 3 members and the other group having the remaining members?\nA: The number of ways to split the group into two with one group having 3 members is 604800.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<permutate>(10,10-3)=604800<eoe>"
        ],
        "tar_number": [
            "604800"
        ]
    },
    {
        "text": "Q: A company has 9 employees who need to be assigned to 3 different teams. How many ways can the employees be assigned to the teams if each team has the same number of employees?\nA: The number of ways to assign employees to teams is 9P3=504.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<permutate>(9,3)=504<eoe>"
        ],
        "tar_number": [
            "504"
        ]
    },
    {
        "text": "Q: A restaurant has 11 tables, how many ways can the manager arrange 2 tables for a reservation?\nA: There are 11P2=110 ways to arrange the tables for a reservation.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<permutate>(11,2)=110<eoe>"
        ],
        "tar_number": [
            "110"
        ]
    },
    {
        "text": "Q: How many different ways can 6 letters be arranged if no letter is repeated?\nA: There are 720 different ways to arrange the letters.",
        "start_token_idx": [
            25
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<permutate>(6,6)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: A restaurant has 5 tables, how many ways can the manager arrange 2 tables for a reservation?\nA: There are 5P2=20 ways to arrange the tables for a reservation.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<permutate>(5,2)=20<eoe>"
        ],
        "tar_number": [
            "20"
        ]
    },
    {
        "text": "Q: A school has 8 classrooms. How many ways can the principal arrange 5 classrooms for a school event?\nA: The number of ways to arrange 5 classrooms out of 8 classrooms is 8P5=6720.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<permutate>(8,5)=6720<eoe>"
        ],
        "tar_number": [
            "6720"
        ]
    },
    {
        "text": "Q: A school has 12 lockers. If they want to assign 11 lockers to students, how many ways can they do so?\nA: The number of ways to assign the lockers is 12P11=479001600.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<permutate>(12,11)=479001600<eoe>"
        ],
        "tar_number": [
            "479001600"
        ]
    },
    {
        "text": "Q: A manager needs to schedule 5 meetings with 3 different clients. How many different ways can the manager arrange the meetings?\nA: The number of ways to schedule the meetings is 5P3=60.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            51
        ],
        "tar_eq": [
            "<permutate>(5,3)=60<eoe>"
        ],
        "tar_number": [
            "60"
        ]
    },
    {
        "text": "Q: A group of 12 friends are taking a photo together. How many ways can they arrange themselves in the photo?\nA: There are 479001600 ways to arrange themselves in the photo.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<permutate>(12,12)=479001600<eoe>"
        ],
        "tar_number": [
            "479001600"
        ]
    },
    {
        "text": "Q: A teacher has 7 students, and she wants to randomly assign each student to a different desk. In how many ways can the students be assigned to the desks?\nA: The number of ways to assign the students to the desks is 7P7=5040.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<permutate>(7,7)=5040<eoe>"
        ],
        "tar_number": [
            "5040"
        ]
    },
    {
        "text": "Q: In a race with 12 participants, how many ways are there to award a gold, silver, and bronze medal?\nA: There are 12P3 = 1320 ways to award the medals.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            44
        ],
        "tar_eq": [
            "<permutate>(12,3)=1320<eoe>"
        ],
        "tar_number": [
            "1320"
        ]
    },
    {
        "text": "Q: A school has 12 lockers and wants to assign 6 lockers to students, how many ways can the lockers be assigned?\nA: The number of ways to assign 6 lockers out of 12 lockers is 12P6=665280.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<permutate>(12,6)=665280<eoe>"
        ],
        "tar_number": [
            "665280"
        ]
    },
    {
        "text": "Q: A deck of cards has 7 cards. In how many ways can 5 cards be arranged in a row?\nA: The number of ways 5 cards can be arranged in a row is 7P5=2520.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<permutate>(7,5)=2520<eoe>"
        ],
        "tar_number": [
            "2520"
        ]
    },
    {
        "text": "Q: A company has 4 employees who need to be assigned to 2 different offices. In how many ways can this be done?\nA: There are 12 ways to assign employees to offices.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<permutate>(4,2)=12<eoe>"
        ],
        "tar_number": [
            "12"
        ]
    },
    {
        "text": "Q: A restaurant has 9 tables and wants to arrange 6 tables for a private event, how many ways can they arrange the tables?\nA: The number of ways to arrange 6 tables out of 9 tables is 9P6=60480.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<permutate>(9,6)=60480<eoe>"
        ],
        "tar_number": [
            "60480"
        ]
    },
    {
        "text": "Q: In a race with 8 participants, how many ways are there to award a gold, silver, and bronze medal?\nA: There are 8P3 = 336 ways to award the medals.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<permutate>(8,3)=336<eoe>"
        ],
        "tar_number": [
            "336"
        ]
    },
    {
        "text": "Q: A group of 10 students want to form a committee consisting of a president, vice-president, and secretary. How many ways can the committee be formed if any student can hold any position?\nA: The number of possible committees is 10P3 = 720.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<permutate>(10,3)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: If 5 different colors of paint are available and 3 walls in a row are to be painted, how many color combinations are possible for the walls?\nA: There are 60 possible color combinations to paint the walls.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<permutate>(5,3)=60<eoe>"
        ],
        "tar_number": [
            "60"
        ]
    },
    {
        "text": "Q: A deck of cards has 7 cards. How many ways can you arrange 3 cards in a row?\nA: The number of ways to arrange 3 cards out of 7 cards is 7P3=210.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<permutate>(7,3)=210<eoe>"
        ],
        "tar_number": [
            "210"
        ]
    },
    {
        "text": "Q: A restaurant has 5 tables and wants to arrange 3 tables for a private event, how many ways can they arrange the tables?\nA: The number of ways to arrange 3 tables out of 5 tables is 5P3=60.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<permutate>(5,3)=60<eoe>"
        ],
        "tar_number": [
            "60"
        ]
    },
    {
        "text": "Q: A teacher has 12 students and wants to randomly assign them to 12 desks. How many different desk arrangements are possible?\nA: The number of different desk arrangements for 12 students on 12 desks is 479001600.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<permutate>(12,12)=479001600<eoe>"
        ],
        "tar_number": [
            "479001600"
        ]
    },
    {
        "text": "Q: In a game of cards, how many ways can you arrange 3 cards from a deck of 4 cards?\nA: There are 4P3=24 ways to arrange the cards.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<permutate>(4,3)=24<eoe>"
        ],
        "tar_number": [
            "24"
        ]
    },
    {
        "text": "Q: How many different ways can 9 letters be arranged if no letter is repeated?\nA: There are 362880 different ways to arrange the letters.",
        "start_token_idx": [
            25
        ],
        "end_token_idx": [
            31
        ],
        "tar_eq": [
            "<permutate>(9,9)=362880<eoe>"
        ],
        "tar_number": [
            "362880"
        ]
    },
    {
        "text": "Q: A company has 6 employees and needs to form a committee of 5 members. How many different committees can be formed?\nA: There are 720 different committees that can be formed with 5 members.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<permutate>(6,5)=720<eoe>"
        ],
        "tar_number": [
            "720"
        ]
    },
    {
        "text": "Q: What is the natural log of 5719?\nA: The natural log of 5719 is ln(5719)=8.65.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(5719)=8.65<eoe>"
        ],
        "tar_number": [
            "8.65"
        ]
    },
    {
        "text": "Q: What is the natural log of 3245?\nA: The natural log of 3245 is ln(3245)=8.08.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(3245)=8.08<eoe>"
        ],
        "tar_number": [
            "8.08"
        ]
    },
    {
        "text": "Q:  ln(4172.27) is equal to what?\nA: ln(4172.27)=8.34.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(4172.27)=8.34<eoe>"
        ],
        "tar_number": [
            "8.34"
        ]
    },
    {
        "text": "Q: What the value of ln of 1784?\nA: The value of ln of 1784 is ln(1784)=7.49.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(1784)=7.49<eoe>"
        ],
        "tar_number": [
            "7.49"
        ]
    },
    {
        "text": "Q:  ln(3195.44) is equal to what?\nA: ln(3195.44)=8.07.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(3195.44)=8.07<eoe>"
        ],
        "tar_number": [
            "8.07"
        ]
    },
    {
        "text": "Q: What is the natural log of 6011.7?\nA: The natural log of 6011.7 is ln(6011.7)=8.7.",
        "start_token_idx": [
            42
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<ln>(6011.7)=8.7<eoe>"
        ],
        "tar_number": [
            "8.7"
        ]
    },
    {
        "text": "Q: What the value of ln of 570?\nA: The value of ln of 570 is ln(570)=6.35.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(570)=6.35<eoe>"
        ],
        "tar_number": [
            "6.35"
        ]
    },
    {
        "text": "Q: What is the natural log of 5807?\nA: The natural log of 5807 is ln(5807)=8.67.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(5807)=8.67<eoe>"
        ],
        "tar_number": [
            "8.67"
        ]
    },
    {
        "text": "Q: If e^x=667.21, what is x?\nA: If e^x=667.21, then x=ln(667.21)=6.5.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(667.21)=6.5<eoe>"
        ],
        "tar_number": [
            "6.5"
        ]
    },
    {
        "text": "Q:  ln(6180.94) is equal to what?\nA: ln(6180.94)=8.73.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(6180.94)=8.73<eoe>"
        ],
        "tar_number": [
            "8.73"
        ]
    },
    {
        "text": "Q: What is the natural log of 107?\nA: The natural log of 107 is ln(107)=4.67.",
        "start_token_idx": [
            33
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<ln>(107)=4.67<eoe>"
        ],
        "tar_number": [
            "4.67"
        ]
    },
    {
        "text": "Q: What the value of ln of 3346.17?\nA: The value of ln of 3346.17 is ln(3346.17)=8.12.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<ln>(3346.17)=8.12<eoe>"
        ],
        "tar_number": [
            "8.12"
        ]
    },
    {
        "text": "Q: What the value of ln of 2589?\nA: The value of ln of 2589 is ln(2589)=7.86.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(2589)=7.86<eoe>"
        ],
        "tar_number": [
            "7.86"
        ]
    },
    {
        "text": "Q: If e^x=9539.72, what is x?\nA: If e^x=9539.72, then x=ln(9539.72)=9.16.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<ln>(9539.72)=9.16<eoe>"
        ],
        "tar_number": [
            "9.16"
        ]
    },
    {
        "text": "Q: What is the natural log of 8684?\nA: The natural log of 8684 is ln(8684)=9.07.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(8684)=9.07<eoe>"
        ],
        "tar_number": [
            "9.07"
        ]
    },
    {
        "text": "Q: What the value of ln of 3170?\nA: The value of ln of 3170 is ln(3170)=8.06.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(3170)=8.06<eoe>"
        ],
        "tar_number": [
            "8.06"
        ]
    },
    {
        "text": "Q: What is the natural log of 7507.7?\nA: The natural log of 7507.7 is ln(7507.7)=8.92.",
        "start_token_idx": [
            42
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<ln>(7507.7)=8.92<eoe>"
        ],
        "tar_number": [
            "8.92"
        ]
    },
    {
        "text": "Q: What the value of ln of 83.07?\nA: The value of ln of 83.07 is ln(83.07)=4.42.",
        "start_token_idx": [
            42
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<ln>(83.07)=4.42<eoe>"
        ],
        "tar_number": [
            "4.42"
        ]
    },
    {
        "text": "Q: What the value of ln of 8213?\nA: The value of ln of 8213 is ln(8213)=9.01.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(8213)=9.01<eoe>"
        ],
        "tar_number": [
            "9.01"
        ]
    },
    {
        "text": "Q:  ln(5526.24) is equal to what?\nA: ln(5526.24)=8.62.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(5526.24)=8.62<eoe>"
        ],
        "tar_number": [
            "8.62"
        ]
    },
    {
        "text": "Q: What the value of ln of 7193.83?\nA: The value of ln of 7193.83 is ln(7193.83)=8.88.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<ln>(7193.83)=8.88<eoe>"
        ],
        "tar_number": [
            "8.88"
        ]
    },
    {
        "text": "Q: What the value of ln of 8402?\nA: The value of ln of 8402 is ln(8402)=9.04.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(8402)=9.04<eoe>"
        ],
        "tar_number": [
            "9.04"
        ]
    },
    {
        "text": "Q: What is the natural log of 9523?\nA: The natural log of 9523 is ln(9523)=9.16.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            40
        ],
        "tar_eq": [
            "<ln>(9523)=9.16<eoe>"
        ],
        "tar_number": [
            "9.16"
        ]
    },
    {
        "text": "Q: What the value of ln of 2808.8?\nA: The value of ln of 2808.8 is ln(2808.8)=7.94.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(2808.8)=7.94<eoe>"
        ],
        "tar_number": [
            "7.94"
        ]
    },
    {
        "text": "Q:  ln(6281.3) is equal to what?\nA: ln(6281.3)=8.75.",
        "start_token_idx": [
            32
        ],
        "end_token_idx": [
            36
        ],
        "tar_eq": [
            "<ln>(6281.3)=8.75<eoe>"
        ],
        "tar_number": [
            "8.75"
        ]
    },
    {
        "text": "Q: If e^x=1160, what is x?\nA: If e^x=1160, then x=ln(1160)=7.06.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            44
        ],
        "tar_eq": [
            "<ln>(1160)=7.06<eoe>"
        ],
        "tar_number": [
            "7.06"
        ]
    },
    {
        "text": "Q: What the value of ln of 8903.25?\nA: The value of ln of 8903.25 is ln(8903.25)=9.09.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<ln>(8903.25)=9.09<eoe>"
        ],
        "tar_number": [
            "9.09"
        ]
    },
    {
        "text": "Q: What the value of ln of 9678?\nA: The value of ln of 9678 is ln(9678)=9.18.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(9678)=9.18<eoe>"
        ],
        "tar_number": [
            "9.18"
        ]
    },
    {
        "text": "Q: If e^x=8586.62, what is x?\nA: If e^x=8586.62, then x=ln(8586.62)=9.06.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<ln>(8586.62)=9.06<eoe>"
        ],
        "tar_number": [
            "9.06"
        ]
    },
    {
        "text": "Q:  ln(3953) is equal to what?\nA: ln(3953)=8.28.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            32
        ],
        "tar_eq": [
            "<ln>(3953)=8.28<eoe>"
        ],
        "tar_number": [
            "8.28"
        ]
    },
    {
        "text": "Q:  ln(3477.81) is equal to what?\nA: ln(3477.81)=8.15.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(3477.81)=8.15<eoe>"
        ],
        "tar_number": [
            "8.15"
        ]
    },
    {
        "text": "Q: What is the natural log of 8420.75?\nA: The natural log of 8420.75 is ln(8420.75)=9.04.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(8420.75)=9.04<eoe>"
        ],
        "tar_number": [
            "9.04"
        ]
    },
    {
        "text": "Q: If e^x=1636, what is x?\nA: If e^x=1636, then x=ln(1636)=7.4.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(1636)=7.4<eoe>"
        ],
        "tar_number": [
            "7.4"
        ]
    },
    {
        "text": "Q:  ln(581) is equal to what?\nA: ln(581)=6.36.",
        "start_token_idx": [
            26
        ],
        "end_token_idx": [
            30
        ],
        "tar_eq": [
            "<ln>(581)=6.36<eoe>"
        ],
        "tar_number": [
            "6.36"
        ]
    },
    {
        "text": "Q:  ln(4650) is equal to what?\nA: ln(4650)=8.44.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            32
        ],
        "tar_eq": [
            "<ln>(4650)=8.44<eoe>"
        ],
        "tar_number": [
            "8.44"
        ]
    },
    {
        "text": "Q: What is the natural log of 4357.47?\nA: The natural log of 4357.47 is ln(4357.47)=8.38.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(4357.47)=8.38<eoe>"
        ],
        "tar_number": [
            "8.38"
        ]
    },
    {
        "text": "Q: What is the natural log of 1108.13?\nA: The natural log of 1108.13 is ln(1108.13)=7.01.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(1108.13)=7.01<eoe>"
        ],
        "tar_number": [
            "7.01"
        ]
    },
    {
        "text": "Q: If e^x=9968.16, what is x?\nA: If e^x=9968.16, then x=ln(9968.16)=9.21.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<ln>(9968.16)=9.21<eoe>"
        ],
        "tar_number": [
            "9.21"
        ]
    },
    {
        "text": "Q: What is the natural log of 9547.61?\nA: The natural log of 9547.61 is ln(9547.61)=9.16.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(9547.61)=9.16<eoe>"
        ],
        "tar_number": [
            "9.16"
        ]
    },
    {
        "text": "Q: What is the natural log of 5239.84?\nA: The natural log of 5239.84 is ln(5239.84)=8.56.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(5239.84)=8.56<eoe>"
        ],
        "tar_number": [
            "8.56"
        ]
    },
    {
        "text": "Q: What the value of ln of 8579?\nA: The value of ln of 8579 is ln(8579)=9.06.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(8579)=9.06<eoe>"
        ],
        "tar_number": [
            "9.06"
        ]
    },
    {
        "text": "Q:  ln(1510) is equal to what?\nA: ln(1510)=7.32.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            32
        ],
        "tar_eq": [
            "<ln>(1510)=7.32<eoe>"
        ],
        "tar_number": [
            "7.32"
        ]
    },
    {
        "text": "Q: What the value of ln of 3171?\nA: The value of ln of 3171 is ln(3171)=8.06.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(3171)=8.06<eoe>"
        ],
        "tar_number": [
            "8.06"
        ]
    },
    {
        "text": "Q: What the value of ln of 7212.82?\nA: The value of ln of 7212.82 is ln(7212.82)=8.88.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<ln>(7212.82)=8.88<eoe>"
        ],
        "tar_number": [
            "8.88"
        ]
    },
    {
        "text": "Q: What the value of ln of 6681.5?\nA: The value of ln of 6681.5 is ln(6681.5)=8.81.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(6681.5)=8.81<eoe>"
        ],
        "tar_number": [
            "8.81"
        ]
    },
    {
        "text": "Q: If e^x=9934, what is x?\nA: If e^x=9934, then x=ln(9934)=9.2.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            43
        ],
        "tar_eq": [
            "<ln>(9934)=9.2<eoe>"
        ],
        "tar_number": [
            "9.2"
        ]
    },
    {
        "text": "Q: What the value of ln of 2148.76?\nA: The value of ln of 2148.76 is ln(2148.76)=7.67.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<ln>(2148.76)=7.67<eoe>"
        ],
        "tar_number": [
            "7.67"
        ]
    },
    {
        "text": "Q: A virus spreads by tripling its infected population every hour. How many times will the number of infected people increase after 4 hours?\nA: After 4 hours, the number of infected people will be 3^4=81 times the original number.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<power>(3, 4)=81<eoe>"
        ],
        "tar_number": [
            "81"
        ]
    },
    {
        "text": "Q: A company has 8 employees, and each employee has 10 tasks to complete. How many tasks does the company have to complete in total?\nA: The company has to complete 8 x 10 tasks, which is equal to 8^(10)=1073741824.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            69
        ],
        "tar_eq": [
            "<power>(8, 10)=1073741824<eoe>"
        ],
        "tar_number": [
            "1073741824"
        ]
    },
    {
        "text": "Q: What is the reciprocal of 4?\nA: The reciprocal of 4 is 4^-1 = 0.25.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<power>(4, -1)=0.25<eoe>"
        ],
        "tar_number": [
            "0.25"
        ]
    },
    {
        "text": "Q: A sound wave travels at a speed of 343 meters per second. How far will it travel in 4 seconds?\nA: In 4 seconds, the sound wave will travel 10^4 meters = 10000.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<power>(10, 4)=10000<eoe>"
        ],
        "tar_number": [
            "10000"
        ]
    },
    {
        "text": "Q: The intensity of light decreases by 8% for every meter of distance from the source. After 7 meters, what will the intensity of light decrease by?\nA: The intensity of light will decrease by 0.92^7=0.56.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<power>(0.92, 7)=0.56<eoe>"
        ],
        "tar_number": [
            "0.56"
        ]
    },
    {
        "text": "Q: A company has 4 employees, and each employee has 8 tasks to complete. How many tasks does the company have to complete in total?\nA: The company has to complete 4 x 8 tasks, which is equal to 4^(8)=65536.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<power>(4, 8)=65536<eoe>"
        ],
        "tar_number": [
            "65536"
        ]
    },
    {
        "text": "Q: A virus spreads by tripling its infected population every hour. How many times will the number of infected people increase after 11 hours?\nA: After 11 hours, the number of infected people will be 3^11=177147 times the original number.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<power>(3, 11)=177147<eoe>"
        ],
        "tar_number": [
            "177147"
        ]
    },
    {
        "text": "Q: A computer's hard drive has certain gigabytes capacity. If a user stores twice the amount of data every year, how many times will the amount of data stored on the hard drive increase after 7 years?\nA: After 7 years, the amount of data stored on the hard drive will increase by 2^7=128 times.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<power>(2, 7)=128<eoe>"
        ],
        "tar_number": [
            "128"
        ]
    },
    {
        "text": "Q: A radioactive substance decays by 10% each day. After 6 days, what is the percentage of the substance remaining?\nA: The percentage of the substance remaining after 6 days is 0.9^6=0.53, which is 0.53<eoe>0.53% of the original amount.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<power>(0.9, 6)=0.53<eoe>"
        ],
        "tar_number": [
            "0.53"
        ]
    },
    {
        "text": "Q: A bacteria colony doubles every 5 minutes. How many times will the colony be in 8 minutes?\nA: The colony will be 2^(8/5)=3.03 times in 8 minutes.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<power>(2, 8/5)=3.03<eoe>"
        ],
        "tar_number": [
            "3.03"
        ]
    },
    {
        "text": "Q: A bacteria culture doubles every 3 hours. Starting with one bacterium, how many bacteria will there be after 39 hours?\nA: After 11 hours, the number of the bacteria will be 2^(39/3)=8192.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<power>(2, 39/3)=8192<eoe>"
        ],
        "tar_number": [
            "8192"
        ]
    },
    {
        "text": "Q: A square has sides of length 5. What is the area of the square?\nA: The area of the square is 5^2 = 25.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<power>(5, 2)=25<eoe>"
        ],
        "tar_number": [
            "25"
        ]
    },
    {
        "text": "Q: A computer's hard drive has certain gigabytes capacity. If a user stores twice the amount of data every year, how many times will the amount of data stored on the hard drive increase after 7 years?\nA: After 7 years, the amount of data stored on the hard drive will increase by 2^7=128 times.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<power>(2, 7)=128<eoe>"
        ],
        "tar_number": [
            "128"
        ]
    },
    {
        "text": "Q: What is the fourth power of 10.12?\nA: The fourth power of 10.12 is 10.12^4 = 10488.71.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<power>(10.12, 4)=10488.71<eoe>"
        ],
        "tar_number": [
            "10488.71"
        ]
    },
    {
        "text": "Q: A company has 4 employees, and each employee has 5 tasks to complete. How many tasks does the company have to complete in total?\nA: The company has to complete 4 x 5 tasks, which is equal to 4^(5)=1024.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<power>(4, 5)=1024<eoe>"
        ],
        "tar_number": [
            "1024"
        ]
    },
    {
        "text": "Q: A smartphone battery drains at a rate of 18% per hour. If it is fully charged right now, how much battery life will it have after 8 hours?\nA: After 8 hours, the smartphone will have 0.82^8=0.2 of its original battery life.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<power>(0.82, 8)=0.2<eoe>"
        ],
        "tar_number": [
            "0.2"
        ]
    },
    {
        "text": "Q: A bacteria colony doubles every 5 minutes. How many times will the colony be in 2 minutes?\nA: The colony will be 2^(2/5)=1.32 times in 2 minutes.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<power>(2, 2/5)=1.32<eoe>"
        ],
        "tar_number": [
            "1.32"
        ]
    },
    {
        "text": "Q: A computer's processing speed doubles every year. In 5 years, what will be the processing speed multiplier compared to the current processing speed?\nA: In 5 years, the processing speed will be 2^5=32 gigahertz.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<power>(2, 5)=32<eoe>"
        ],
        "tar_number": [
            "32"
        ]
    },
    {
        "text": "Q: A smartphone battery drains at a rate of 18% per hour. If it is fully charged right now, how much battery life will it have after 2 hours?\nA: After 2 hours, the smartphone will have 0.82^2=0.67 of its original battery life.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<power>(0.82, 2)=0.67<eoe>"
        ],
        "tar_number": [
            "0.67"
        ]
    },
    {
        "text": "Q: If a cube has an edge length of 9.44 meters, what is the volume of the cube in cubic centimeters?\nA: The volume of the cube is 9.44^3=841.23 cubic centimeters.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<power>(9.44, 3)=841.23<eoe>"
        ],
        "tar_number": [
            "841.23"
        ]
    },
    {
        "text": "Q: A population of bacteria doubles every minute. In 7 minutes, how many times will the population increase?\nA: The population will increase 2^7=128 times in 7 minutes.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<power>(2, 7)=128<eoe>"
        ],
        "tar_number": [
            "128"
        ]
    },
    {
        "text": "Q: A computer processor's speed doubles every 8 years. If the current speed is 1 gigahertz, what will be the speed after 8 years?\nA: The speed of the processor after 8 years will be 2^8=256 gigahertz.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<power>(2, 8)=256<eoe>"
        ],
        "tar_number": [
            "256"
        ]
    },
    {
        "text": "Q: A computer processor's speed doubles every 4 years. If the current speed is 1 gigahertz, what will be the speed after 4 years?\nA: The speed of the processor after 4 years will be 2^4=16 gigahertz.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<power>(2, 4)=16<eoe>"
        ],
        "tar_number": [
            "16"
        ]
    },
    {
        "text": "Q: If the price of a stock increases 3% every day, how much will it be worth after 2 days?\nA: After 2 days, the value of the stock will be 0.97^2=0.94 times its original value.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<power>(0.97, 2)=0.94<eoe>"
        ],
        "tar_number": [
            "0.94"
        ]
    },
    {
        "text": "Q: A smartphone battery drains at a rate of 18% per hour. If it is fully charged right now, how much battery life will it have after 10 hours?\nA: After 10 hours, the smartphone will have 0.82^10=0.14 of its original battery life.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<power>(0.82, 10)=0.14<eoe>"
        ],
        "tar_number": [
            "0.14"
        ]
    },
    {
        "text": "Q: What is the square of the reciprocal of 6?\nA: The square of the reciprocal of 6 is 6^(-1*2) = 0.028.",
        "start_token_idx": [
            40
        ],
        "end_token_idx": [
            45
        ],
        "tar_eq": [
            "<power>(6, -2)=0.028<eoe>"
        ],
        "tar_number": [
            "0.028"
        ]
    },
    {
        "text": "Q: A smartphone battery drains at a rate of 18% per hour. If it is fully charged right now, how much battery life will it have after 8 hours?\nA: After 8 hours, the smartphone will have 0.82^8=0.2 of its original battery life.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<power>(0.82, 8)=0.2<eoe>"
        ],
        "tar_number": [
            "0.2"
        ]
    },
    {
        "text": "Q: A company has 2 employees, and each employee has 7 tasks to complete. How many tasks does the company have to complete in total?\nA: The company has to complete 2 x 7 tasks, which is equal to 2^(7)=128.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<power>(2, 7)=128<eoe>"
        ],
        "tar_number": [
            "128"
        ]
    },
    {
        "text": "Q: A square has sides of length 4. What is the area of the square?\nA: The area of the square is 4^2 = 16.",
        "start_token_idx": [
            35
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<power>(4, 2)=16<eoe>"
        ],
        "tar_number": [
            "16"
        ]
    },
    {
        "text": "Q: The size of a cell increases by four times every division. What will be the size of the cell after 2 divisions?\nA: After 2 divisions, the size of the cell will be 4^2=16 times the original size.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<power>(4, 2)=16<eoe>"
        ],
        "tar_number": [
            "16"
        ]
    },
    {
        "text": "Q: A company's stock price increases by 10% every year. How many times will the stock price increase after 5 years?\nA: After 5 years, the stock price will increase 1.1^6.01=1.77 times.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<power>(1.1, 6.01)=1.77<eoe>"
        ],
        "tar_number": [
            "1.77"
        ]
    },
    {
        "text": "Q: A computer processor's speed doubles every 11 years. If the current speed is 1 gigahertz, what will be the speed after 11 years?\nA: The speed of the processor after 11 years will be 2^11=2048 gigahertz.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<power>(2, 11)=2048<eoe>"
        ],
        "tar_number": [
            "2048"
        ]
    },
    {
        "text": "Q: A sound wave travels at a speed of 343 meters per second. How far will it travel in 6 seconds?\nA: In 6 seconds, the sound wave will travel 10^6 meters = 1000000.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<power>(10, 6)=1000000<eoe>"
        ],
        "tar_number": [
            "1000000"
        ]
    },
    {
        "text": "Q: What is the reciprocal of 9?\nA: The reciprocal of 9 is 9^-1 = 0.11.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<power>(9, -1)=0.11<eoe>"
        ],
        "tar_number": [
            "0.11"
        ]
    },
    {
        "text": "Q: A computer's hard drive has certain gigabytes capacity. If a user stores twice the amount of data every year, how many times will the amount of data stored on the hard drive increase after 12 years?\nA: After 12 years, the amount of data stored on the hard drive will increase by 2^12=4096 times.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            79
        ],
        "tar_eq": [
            "<power>(2, 12)=4096<eoe>"
        ],
        "tar_number": [
            "4096"
        ]
    },
    {
        "text": "Q: A population of bacteria doubles every minute. In 3 minutes, how many times will the population increase?\nA: The population will increase 2^3=8 times in 3 minutes.",
        "start_token_idx": [
            38
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<power>(2, 3)=8<eoe>"
        ],
        "tar_number": [
            "8"
        ]
    },
    {
        "text": "Q: A virus spreads by tripling its infected population every hour. How many times will the number of infected people increase after 4 hours?\nA: After 4 hours, the number of infected people will be 3^4=81 times the original number.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<power>(3, 4)=81<eoe>"
        ],
        "tar_number": [
            "81"
        ]
    },
    {
        "text": "Q: A bacteria colony doubles every 5 minutes. How many times will the colony be in 9 minutes?\nA: The colony will be 2^(9/5)=3.48 times in 9 minutes.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<power>(2, 9/5)=3.48<eoe>"
        ],
        "tar_number": [
            "3.48"
        ]
    },
    {
        "text": "Q: A cell divides into two every 4 minutes. After 1 hour, how many cells will there be?\nA: After 1 hour, there will be 2^(60/4)=32768 cells.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<power>(2, 60/4)=32768<eoe>"
        ],
        "tar_number": [
            "32768"
        ]
    },
    {
        "text": "Q: A computer's processing speed doubles every year. In 6 years, what will be the processing speed multiplier compared to the current processing speed?\nA: In 6 years, the processing speed will be 2^6=64 gigahertz.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<power>(2, 6)=64<eoe>"
        ],
        "tar_number": [
            "64"
        ]
    },
    {
        "text": "Q: The interest rate on a savings account is 2.3% per year. In 10 years, how many times will the amount of money in the account increase?\nA: The amount of money in the account will increase 1.023^10=1.26 times in 10 years.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<power>(1.023, 10)=1.26<eoe>"
        ],
        "tar_number": [
            "1.26"
        ]
    },
    {
        "text": "Q: A tree grows three times as tall every year. How many times taller will it be after 10 years?\nA:  After 10 years, the tree's height will be 3^10=59049 times its original height.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<power>(3, 10)=59049<eoe>"
        ],
        "tar_number": [
            "59049"
        ]
    },
    {
        "text": "Q: A square has a side length of 4.1. What is the area of the square?\nA: The area of the square is 4.1^2=16.81.",
        "start_token_idx": [
            39
        ],
        "end_token_idx": [
            44
        ],
        "tar_eq": [
            "<power>(4.1, 2)=16.81<eoe>"
        ],
        "tar_number": [
            "16.81"
        ]
    },
    {
        "text": "Q: What is the reciprocal of 7?\nA: The reciprocal of 7 is 7^-1 = 0.14.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<power>(7, -1)=0.14<eoe>"
        ],
        "tar_number": [
            "0.14"
        ]
    },
    {
        "text": "Q: The interest rate on a savings account is 2.3% per year. In 9 years, how many times will the amount of money in the account increase?\nA: The amount of money in the account will increase 1.023^9=1.23 times in 9 years.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<power>(1.023, 9)=1.23<eoe>"
        ],
        "tar_number": [
            "1.23"
        ]
    },
    {
        "text": "Q: A company has 3 employees, and each employee has 6 tasks to complete. How many tasks does the company have to complete in total?\nA: The company has to complete 3 x 6 tasks, which is equal to 3^(6)=729.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<power>(3, 6)=729<eoe>"
        ],
        "tar_number": [
            "729"
        ]
    },
    {
        "text": "Q: A company's sales are projected to double every year. What will be the projected sales after 9 years if the current sales are $1 million?\nA: After 9 years, the projected sales will be 2^9 million dollars = 512 million dollars.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<power>(2, 9)=512<eoe>"
        ],
        "tar_number": [
            "512"
        ]
    },
    {
        "text": "Q: A company has three machines, A, B, and C, which complete a task in 451, 762, and 416 minutes, respectively. What is the least amount of time it will take to complete the task if all three machines work together?\nA: The least amount of time it will take to complete the task if all three machines work together is 71481696 minutes.",
        "start_token_idx": [
            84
        ],
        "end_token_idx": [
            92
        ],
        "tar_eq": [
            "<lcm>(451,762,416)=71481696<eoe>"
        ],
        "tar_number": [
            "71481696"
        ]
    },
    {
        "text": "Q: A factory produces 928 products every 267 hours. What is the least amount of time it will take for the factory to produce the same number of products on two consecutive days?\nA: The least amount of time it will take for the factory to produce the same number of products on two consecutive days is 247776.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<lcm>(928,267)=247776<eoe>"
        ],
        "tar_number": [
            "247776"
        ]
    },
    {
        "text": "Q: A factory produces two types of products. The first product is produced every 865 days, and the second product is produced every 460 days. If the factory starts producing both products at the same time, what is the least amount of time it will take for the factory to produce both products on the same day?\nA: The least amount of time it will take for the factory to produce both products on the same day is 79580.",
        "start_token_idx": [
            94
        ],
        "end_token_idx": [
            99
        ],
        "tar_eq": [
            "<lcm>(865,460)=79580<eoe>"
        ],
        "tar_number": [
            "79580"
        ]
    },
    {
        "text": "Q: A group of students are planning a fundraiser. One group wants to sell products every 215 days, while another group wants to sell products every 465 days. If they want to sell products on the same day, what is the least amount of days they have to wait until they can do it?\nA: The least amount of days they have to wait until they can sell products on the same day is 19995.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<lcm>(215,465)=19995<eoe>"
        ],
        "tar_number": [
            "19995"
        ]
    },
    {
        "text": "Q: A factory produces two types of products. Type A takes 501 hours to produce, and Type B takes 820 hours to produce. If the factory wants to produce both types of products at the same time, what is the least amount of time it will take to produce one unit of each type of product?\nA: The least amount of time it will take to produce one unit of each type of product is 410820.",
        "start_token_idx": [
            91
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<lcm>(501,820)=410820<eoe>"
        ],
        "tar_number": [
            "410820"
        ]
    },
    {
        "text": "Q: A family has two cars. Car A needs an oil change every 985 miles and Car B needs an oil change every 177 miles. If both cars have their oil changed at the same mileage, what is the least amount of mileage it will take for both cars to need an oil change at the same mileage again?\nA: The least amount of mileage it will take for both cars to need an oil change at the same mileage again is 174345.",
        "start_token_idx": [
            102
        ],
        "end_token_idx": [
            108
        ],
        "tar_eq": [
            "<lcm>(985,177)=174345<eoe>"
        ],
        "tar_number": [
            "174345"
        ]
    },
    {
        "text": "Q: A factory produces four different products and each product has a different production cycle of 268, 480, 339, and 630 days respectively. What is the shortest number of days the factory can produce all four products at the same time?\nA: The shortest number of days the factory can produce all four products at the same time is the least common multiple of 268, 480, 339, and 630, which is 76315680.",
        "start_token_idx": [
            111
        ],
        "end_token_idx": [
            119
        ],
        "tar_eq": [
            "<lcm>(268,480,339,630)=76315680<eoe>"
        ],
        "tar_number": [
            "76315680"
        ]
    },
    {
        "text": "Q: A music band is planning a concert that is going to last for 773 hours. The band wants to have a break every 767 hour during the concert. What is the least amount of time the band can have a break during the concert without missing any part of the concert?\nA: The least amount of time the band can have a break during the concert without missing any part of the concert is 592891.",
        "start_token_idx": [
            89
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<lcm>(773,767)=592891<eoe>"
        ],
        "tar_number": [
            "592891"
        ]
    },
    {
        "text": "Q: A group of students are given homework every 232, 116, and 960 days, respectively. If they all start their homework today, what is the least number of days they have to wait until they all have homework due on the same day again?\nA: The least number of days they have to wait until they all have homework due on the same day again is 27840.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<lcm>(232,116,960)=27840<eoe>"
        ],
        "tar_number": [
            "27840"
        ]
    },
    {
        "text": "Q: A factory produces four different products and each product has a different production cycle of 695, 150, 964, and 944 days respectively. What is the shortest number of days the factory can produce all four products at the same time?\nA: The shortest number of days the factory can produce all four products at the same time is the least common multiple of 695, 150, 964, and 944, which is 2371729200.",
        "start_token_idx": [
            111
        ],
        "end_token_idx": [
            121
        ],
        "tar_eq": [
            "<lcm>(695,150,964,944)=2371729200<eoe>"
        ],
        "tar_number": [
            "2371729200"
        ]
    },
    {
        "text": "Q: A company has two machines that produce a product. Machine A produces one unit every 284 minutes, while Machine B produces one unit every 95 minutes. If both machines start at the same time, what is the least amount of time it will take for both machines to produce the same number of units?\nA: The least amount of time it will take for both machines to produce the same number of units is 26980.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<lcm>(284,95)=26980<eoe>"
        ],
        "tar_number": [
            "26980"
        ]
    },
    {
        "text": "Q: A library has two bookshelves, one with books that are 643 pages long and the other with books that are 747 pages long. If both bookshelves need to be reorganized at the same time, what is the least amount of time it will take to reorganize both bookshelves?\nA: The least amount of time it will take to reorganize both bookshelves is 480321.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            102
        ],
        "tar_eq": [
            "<lcm>(643,747)=480321<eoe>"
        ],
        "tar_number": [
            "480321"
        ]
    },
    {
        "text": "Q: A family is planning a vacation. The parents want to rent a car for 649 days, the children want to rent a bike for 305 days, and the grandparents want to rent a scooter for 259 days. If they want to return all rentals on the same day, what is the earliest date they can return?\nA: The earliest date they can return is the least common multiple of 649, 305, and 259, which is 51267755.",
        "start_token_idx": [
            115
        ],
        "end_token_idx": [
            123
        ],
        "tar_eq": [
            "<lcm>(649,305,259)=51267755<eoe>"
        ],
        "tar_number": [
            "51267755"
        ]
    },
    {
        "text": "Q: A music store has two musicians who perform at the store. Musician A plays a set that lasts for 512 minutes, while Musician B plays a set that lasts for 952 minutes. If both musicians start playing at the same time, what is the least amount of time it will take for both musicians to finish playing at the same time?\nA: The least amount of time it will take for both musicians to finish playing at the same time is 60928.",
        "start_token_idx": [
            106
        ],
        "end_token_idx": [
            111
        ],
        "tar_eq": [
            "<lcm>(512,952)=60928<eoe>"
        ],
        "tar_number": [
            "60928"
        ]
    },
    {
        "text": "Q: A baker is preparing for a baking competition. One recipe requires 598 cups of flour, and another recipe requires 176 cups of flour. If the baker wants to prepare both recipes at the same time, what is the least amount of flour the baker needs to prepare?\nA: The least amount of flour the baker needs to prepare is 52624 cups.",
        "start_token_idx": [
            91
        ],
        "end_token_idx": [
            96
        ],
        "tar_eq": [
            "<lcm>(598,176)=52624<eoe>"
        ],
        "tar_number": [
            "52624"
        ]
    },
    {
        "text": "Q: A school choir practices every 374, 840, and 273 days, respectively. If they start practicing together today, what is the least number of days they have to wait until they can all practice together again?\nA: The least number of days they have to wait until they can all practice together again is 2042040.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            83
        ],
        "tar_eq": [
            "<lcm>(374,840,273)=2042040<eoe>"
        ],
        "tar_number": [
            "2042040"
        ]
    },
    {
        "text": "Q: A group of students are practicing for a quiz competition. One student can solve a set of questions in 402 minutes, and another student can solve the same set of questions in 738 minutes. If both students start solving the questions at the same time, what is the least amount of time it will take for them to finish solving the questions at the same time?\nA: The least amount of time it will take for the students to finish solving the questions at the same time is 49446.",
        "start_token_idx": [
            107
        ],
        "end_token_idx": [
            112
        ],
        "tar_eq": [
            "<lcm>(402,738)=49446<eoe>"
        ],
        "tar_number": [
            "49446"
        ]
    },
    {
        "text": "Q: A delivery truck can cover a distance of 818 miles while a car can cover the same distance in 99 miles. If both start at the same time and travel in the same direction, what is the least distance the car needs to travel to meet the delivery truck?\nA: The least distance the car needs to travel to meet the delivery truck is 80982.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<lcm>(818,99)=80982<eoe>"
        ],
        "tar_number": [
            "80982"
        ]
    },
    {
        "text": "Q: A family has two cars, one car needs to have its oil changed every 173 miles and the other car needs to have its oil changed every 252 miles. What is the least amount of miles the family needs to drive so they can take both cars to the mechanic for an oil change on the same day?\nA: The least amount of miles the family needs to drive is the least common multiple of 173 and 252, which is 43596.",
        "start_token_idx": [
            103
        ],
        "end_token_idx": [
            108
        ],
        "tar_eq": [
            "<lcm>(173,252)=43596<eoe>"
        ],
        "tar_number": [
            "43596"
        ]
    },
    {
        "text": "Q: A bakery has two ovens that bake cakes in cycles of 772 minutes and 55 minutes respectively. If both ovens are started at the same time, what is the least amount of time it will take for the ovens to finish baking cakes at the same time?\nA: The least amount of time it will take for the ovens to finish baking cakes at the same time is 42460.",
        "start_token_idx": [
            94
        ],
        "end_token_idx": [
            99
        ],
        "tar_eq": [
            "<lcm>(772,55)=42460<eoe>"
        ],
        "tar_number": [
            "42460"
        ]
    },
    {
        "text": "Q: A group of students are given homework every 394, 631, and 115 days, respectively. If they all start their homework today, what is the least number of days they have to wait until they all have homework due on the same day again?\nA: The least number of days they have to wait until they all have homework due on the same day again is 28590610.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            98
        ],
        "tar_eq": [
            "<lcm>(394,631,115)=28590610<eoe>"
        ],
        "tar_number": [
            "28590610"
        ]
    },
    {
        "text": "Q: A school choir practices every 989, 166, and 786 days, respectively. If they start practicing together today, what is the least number of days they have to wait until they can all practice together again?\nA: The least number of days they have to wait until they can all practice together again is 64520382.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            84
        ],
        "tar_eq": [
            "<lcm>(989,166,786)=64520382<eoe>"
        ],
        "tar_number": [
            "64520382"
        ]
    },
    {
        "text": "Q: A gardener needs to water her plants every 332 days and fertilize them every 806 days. If she wants to do both on the same day, what is the least amount of days she has to wait?\nA: The least amount of days she has to wait until she can water and fertilize her plants on the same day is 133796.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<lcm>(332,806)=133796<eoe>"
        ],
        "tar_number": [
            "133796"
        ]
    },
    {
        "text": "Q: A group of students is given a project that takes 628 days to complete if they work alone, and 821 days to complete if they work together. If they want to finish the project in the least amount of time possible, how many days will it take for them to finish the project together?\nA: It will take 515588 days for the group of students to finish the project together.",
        "start_token_idx": [
            74
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<lcm>(628,821)=515588<eoe>"
        ],
        "tar_number": [
            "515588"
        ]
    },
    {
        "text": "Q: A train arrives at a station every 842 minutes, while another train arrives at the same station every 980 minutes. What is the least amount of time it will take for both trains to arrive at the station at the same time?\nA: The least amount of time it will take for both trains to arrive at the station at the same time is 412580.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            87
        ],
        "tar_eq": [
            "<lcm>(842,980)=412580<eoe>"
        ],
        "tar_number": [
            "412580"
        ]
    },
    {
        "text": "Q: In a factory, machine A takes 661 minutes to produce a product while machine B takes 40 minutes. If both machines start producing at the same time, what is the least amount of time it will take for both machines to finish at the same time?\nA: The least amount of time it will take for both machines to finish at the same time is 26440.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            85
        ],
        "tar_eq": [
            "<lcm>(661,40)=26440<eoe>"
        ],
        "tar_number": [
            "26440"
        ]
    },
    {
        "text": "Q: A machine takes 990 minutes to produce a product, and another machine takes 71 minutes to produce the same product. If both machines start working together, what is the least amount of time it will take for both machines to produce the same product at the same time?\nA: The least amount of time it will take for both machines to produce the same product at the same time is 70290.",
        "start_token_idx": [
            85
        ],
        "end_token_idx": [
            90
        ],
        "tar_eq": [
            "<lcm>(990,71)=70290<eoe>"
        ],
        "tar_number": [
            "70290"
        ]
    },
    {
        "text": "Q: A group of students are going on a field trip. They have two bus options. Bus A leaves every 248 minutes and Bus B leaves every 880 minutes. If the two buses leave at the same time, what is the least amount of time it will take for the two buses to leave at the same time again?\nA: The least amount of time it will take for the two buses to leave at the same time again is 27280.",
        "start_token_idx": [
            99
        ],
        "end_token_idx": [
            104
        ],
        "tar_eq": [
            "<lcm>(248,880)=27280<eoe>"
        ],
        "tar_number": [
            "27280"
        ]
    },
    {
        "text": "Q: A farmer needs to harvest 603 acres of land. If it takes him 776 hours to harvest one acre of land, what is the least amount of time it will take him to harvest all of the land?\nA: The least amount of time it will take the farmer to harvest all of the land is 467928 hours.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            84
        ],
        "tar_eq": [
            "<lcm>(603,776)=467928<eoe>"
        ],
        "tar_number": [
            "467928"
        ]
    },
    {
        "text": "Q: A farmer has two fields, and it takes 706 days and 855 days to harvest crops in each field, respectively. If the farmer starts harvesting both fields at the same time, what is the least amount of time it will take to finish harvesting both fields?\nA: The least amount of time it will take to finish harvesting both fields is 603630.",
        "start_token_idx": [
            88
        ],
        "end_token_idx": [
            94
        ],
        "tar_eq": [
            "<lcm>(706,855)=603630<eoe>"
        ],
        "tar_number": [
            "603630"
        ]
    },
    {
        "text": "Q: A company wants to develop a new product that requires 104, 327, and 654 months respectively. If the company wants to launch all the products at the same time, what is the earliest launch date the company can set?\nA: The earliest launch date the company can set is the least common multiple of 104, 327, and 654, which is 34008.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<lcm>(104,327,654)=34008<eoe>"
        ],
        "tar_number": [
            "34008"
        ]
    },
    {
        "text": "Q: A train runs on three different tracks in 353, 663, and 609 minutes, respectively. If the train starts running on all three tracks at the same time, what is the least amount of time it will take for the train to complete one lap on all three tracks?\nA: The least amount of time it will take for the train to complete one lap on all three tracks is the least common multiple of 353, 663, and 609, which is 47509917.",
        "start_token_idx": [
            113
        ],
        "end_token_idx": [
            121
        ],
        "tar_eq": [
            "<lcm>(353,663,609)=47509917<eoe>"
        ],
        "tar_number": [
            "47509917"
        ]
    },
    {
        "text": "Q: A gardener waters her plants every 544 days and fertilizes them every 762 days. What is the least number of days before she can water and fertilize on the same day?\nA: The least number of days before she can water and fertilize on the same day is 207264.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<lcm>(544,762)=207264<eoe>"
        ],
        "tar_number": [
            "207264"
        ]
    },
    {
        "text": "Q: A group of students are practicing for a quiz competition. One student can solve a set of questions in 582 minutes, and another student can solve the same set of questions in 251 minutes. If both students start solving the questions at the same time, what is the least amount of time it will take for them to finish solving the questions at the same time?\nA: The least amount of time it will take for the students to finish solving the questions at the same time is 146082.",
        "start_token_idx": [
            107
        ],
        "end_token_idx": [
            113
        ],
        "tar_eq": [
            "<lcm>(582,251)=146082<eoe>"
        ],
        "tar_number": [
            "146082"
        ]
    },
    {
        "text": "Q: A delivery truck can cover a distance of 286 miles while a car can cover the same distance in 773 miles. If both start at the same time and travel in the same direction, what is the least distance the car needs to travel to meet the delivery truck?\nA: The least distance the car needs to travel to meet the delivery truck is 221078.",
        "start_token_idx": [
            82
        ],
        "end_token_idx": [
            88
        ],
        "tar_eq": [
            "<lcm>(286,773)=221078<eoe>"
        ],
        "tar_number": [
            "221078"
        ]
    },
    {
        "text": "Q: A farmer has two fields. Field A is watered every 37 days, while Field B is watered every 206 days. If the farmer wants to water both fields on the same day, what is the least amount of days he needs to wait to water both fields on the same day again?\nA: The least amount of days he needs to wait to water both fields on the same day again is 7622.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            96
        ],
        "tar_eq": [
            "<lcm>(37,206)=7622<eoe>"
        ],
        "tar_number": [
            "7622"
        ]
    },
    {
        "text": "Q: A group of friends want to meet up for a game night. Friend A is available every 622 days, and Friend B is available every 548 days. If they want to meet up on the same day as soon as possible, how many days will they have to wait?\nA: They will have to wait 170428 days to meet up on the same day.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<lcm>(622,548)=170428<eoe>"
        ],
        "tar_number": [
            "170428"
        ]
    },
    {
        "text": "Q: A music teacher wants to schedule her students' practice sessions on a rotation basis. One student needs to practice every 221 days, another student every 172 days, and the third student every 250 days. If the teacher wants the students to practice together on the same day, what is the least number of days before they can all practice together again?\nA: The least number of days before they can all practice together again is the least common multiple of 221, 172, and 250, which is 4751500.",
        "start_token_idx": [
            120
        ],
        "end_token_idx": [
            127
        ],
        "tar_eq": [
            "<lcm>(221,172,250)=4751500<eoe>"
        ],
        "tar_number": [
            "4751500"
        ]
    },
    {
        "text": "Q: A teacher wants to distribute a set of books to her students. One set contains 842 books, and the other set contains 181 books. If the teacher wants to distribute the books equally among all the students, what is the least number of sets the teacher needs to have?\nA: The least number of sets the teacher needs to have is 152402.",
        "start_token_idx": [
            80
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<lcm>(842,181)=152402<eoe>"
        ],
        "tar_number": [
            "152402"
        ]
    },
    {
        "text": "Q: A school choir practices every 384, 345, and 108 days, respectively. If they start practicing together today, what is the least number of days they have to wait until they can all practice together again?\nA: The least number of days they have to wait until they can all practice together again is 397440.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            82
        ],
        "tar_eq": [
            "<lcm>(384,345,108)=397440<eoe>"
        ],
        "tar_number": [
            "397440"
        ]
    },
    {
        "text": "Q: A company has two printers. Printer A can print all the documents in 135 minutes and Printer B can print all the documents in 343 minutes. If the company wants to print the same document from both printers at the same time, what is the least amount of time it will take to print the document?\nA: The least amount of time it will take to print the document is 46305.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            95
        ],
        "tar_eq": [
            "<lcm>(135,343)=46305<eoe>"
        ],
        "tar_number": [
            "46305"
        ]
    },
    {
        "text": "Q: A group of runners are training for a marathon. Runner A can run 717 miles every day, and Runner B can run 934 miles every day. If they want to run the same distance every day during training, how many miles will they have to run each day?\nA: They will have to run 669678 miles each day during training.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<lcm>(717,934)=669678<eoe>"
        ],
        "tar_number": [
            "669678"
        ]
    },
    {
        "text": "Q: Four friends, Emma, Finn, Grace, and Henry, have a weekly meeting every 730, 219, 287, and 892 days, respectively. What is the least number of weeks they have to wait until they can have a meeting on the same day of the week?\nA: The least number of weeks they have to wait until they can have a meeting on the same day of the week is 280324380.",
        "start_token_idx": [
            97
        ],
        "end_token_idx": [
            106
        ],
        "tar_eq": [
            "<lcm>(730,219,287,892)=280324380<eoe>"
        ],
        "tar_number": [
            "280324380"
        ]
    },
    {
        "text": "Q: A student has to attend two classes. The first class lasts for 649 minutes, and the second class lasts for 232 minutes. If the student starts attending both classes at the same time, what is the least amount of time it will take for the student to attend both classes at the same time on the same day?\nA: The least amount of time it will take for the student to attend both classes at the same time on the same day is 150568.",
        "start_token_idx": [
            103
        ],
        "end_token_idx": [
            109
        ],
        "tar_eq": [
            "<lcm>(649,232)=150568<eoe>"
        ],
        "tar_number": [
            "150568"
        ]
    },
    {
        "text": "Q: A group of students are planning a fundraiser. One group wants to sell products every 353 days, while another group wants to sell products every 709 days. If they want to sell products on the same day, what is the least amount of days they have to wait until they can do it?\nA: The least amount of days they have to wait until they can sell products on the same day is 250277.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            98
        ],
        "tar_eq": [
            "<lcm>(353,709)=250277<eoe>"
        ],
        "tar_number": [
            "250277"
        ]
    },
    {
        "text": "Q: A bakery has two ovens that bake cakes in cycles of 957 minutes and 249 minutes respectively. If both ovens are started at the same time, what is the least amount of time it will take for the ovens to finish baking cakes at the same time?\nA: The least amount of time it will take for the ovens to finish baking cakes at the same time is 79431.",
        "start_token_idx": [
            95
        ],
        "end_token_idx": [
            100
        ],
        "tar_eq": [
            "<lcm>(957,249)=79431<eoe>"
        ],
        "tar_number": [
            "79431"
        ]
    },
    {
        "text": "Q: Three machines take 89, 333, and 729 hours, respectively, to complete the same task. If the machines start working together, what is the least amount of time it will take for them to complete the task?\nA: The least amount of time it will take for them to complete the task is 2400597.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            80
        ],
        "tar_eq": [
            "<lcm>(89,333,729)=2400597<eoe>"
        ],
        "tar_number": [
            "2400597"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 5905.01?\nA:  The value of the logarithm of 5905.01 is log(5905.01)=3.77.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(5905.01)=3.77<eoe>"
        ],
        "tar_number": [
            "3.77"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 2093.6?\nA:  The value of the logarithm of 2093.6 is log(2093.6)=3.32.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<log>(2093.6)=3.32<eoe>"
        ],
        "tar_number": [
            "3.32"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 2164?\nA:  The value of the logarithm of 2164 is log(2164)=3.34.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(2164)=3.34<eoe>"
        ],
        "tar_number": [
            "3.34"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 7244?\nA:  The value of the logarithm of 7244 is log(7244)=3.86.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(7244)=3.86<eoe>"
        ],
        "tar_number": [
            "3.86"
        ]
    },
    {
        "text": "Q:  log(5169) equals?\nA:  log(5169)=3.71.",
        "start_token_idx": [
            24
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<log>(5169)=3.71<eoe>"
        ],
        "tar_number": [
            "3.71"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 893 is?\nA:  The 10th logarithm of 893 is log(893)=2.95.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<log>(893)=2.95<eoe>"
        ],
        "tar_number": [
            "2.95"
        ]
    },
    {
        "text": "Q:  10^x=2091, what is the value of x?\nA:  10^x=2091, so x=log(2091)=3.32.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(2091)=3.32<eoe>"
        ],
        "tar_number": [
            "3.32"
        ]
    },
    {
        "text": "Q:  10^x=4608, what is the value of x?\nA:  10^x=4608, so x=log(4608)=3.66.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(4608)=3.66<eoe>"
        ],
        "tar_number": [
            "3.66"
        ]
    },
    {
        "text": "Q:  10^x=3408, what is the value of x?\nA:  10^x=3408, so x=log(3408)=3.53.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(3408)=3.53<eoe>"
        ],
        "tar_number": [
            "3.53"
        ]
    },
    {
        "text": "Q:  log(7025.92) equals?\nA:  log(7025.92)=3.85.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<log>(7025.92)=3.85<eoe>"
        ],
        "tar_number": [
            "3.85"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 8123.35?\nA:  The value of the logarithm of 8123.35 is log(8123.35)=3.91.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(8123.35)=3.91<eoe>"
        ],
        "tar_number": [
            "3.91"
        ]
    },
    {
        "text": "Q:  log(4582.22) equals?\nA:  log(4582.22)=3.66.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<log>(4582.22)=3.66<eoe>"
        ],
        "tar_number": [
            "3.66"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 1972?\nA:  The value of the logarithm of 1972 is log(1972)=3.29.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(1972)=3.29<eoe>"
        ],
        "tar_number": [
            "3.29"
        ]
    },
    {
        "text": "Q:  10^x=1045.06, what is the value of x?\nA:  10^x=1045.06, so x=log(1045.06)=3.02.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(1045.06)=3.02<eoe>"
        ],
        "tar_number": [
            "3.02"
        ]
    },
    {
        "text": "Q:  10^x=2738.99, what is the value of x?\nA:  10^x=2738.99, so x=log(2738.99)=3.44.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(2738.99)=3.44<eoe>"
        ],
        "tar_number": [
            "3.44"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 846.45 is?\nA:  The 10th logarithm of 846.45 is log(846.45)=2.93.",
        "start_token_idx": [
            52
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<log>(846.45)=2.93<eoe>"
        ],
        "tar_number": [
            "2.93"
        ]
    },
    {
        "text": "Q:  10^x=7313.69, what is the value of x?\nA:  10^x=7313.69, so x=log(7313.69)=3.86.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(7313.69)=3.86<eoe>"
        ],
        "tar_number": [
            "3.86"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 2334?\nA:  The value of the logarithm of 2334 is log(2334)=3.37.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(2334)=3.37<eoe>"
        ],
        "tar_number": [
            "3.37"
        ]
    },
    {
        "text": "Q:  log(4991.96) equals?\nA:  log(4991.96)=3.7.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            33
        ],
        "tar_eq": [
            "<log>(4991.96)=3.7<eoe>"
        ],
        "tar_number": [
            "3.7"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 1353.1 is?\nA:  The 10th logarithm of 1353.1 is log(1353.1)=3.13.",
        "start_token_idx": [
            52
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<log>(1353.1)=3.13<eoe>"
        ],
        "tar_number": [
            "3.13"
        ]
    },
    {
        "text": "Q:  10^x=8993, what is the value of x?\nA:  10^x=8993, so x=log(8993)=3.95.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(8993)=3.95<eoe>"
        ],
        "tar_number": [
            "3.95"
        ]
    },
    {
        "text": "Q:  10^x=8001, what is the value of x?\nA:  10^x=8001, so x=log(8001)=3.9.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<log>(8001)=3.9<eoe>"
        ],
        "tar_number": [
            "3.9"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 7164?\nA:  The value of the logarithm of 7164 is log(7164)=3.86.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(7164)=3.86<eoe>"
        ],
        "tar_number": [
            "3.86"
        ]
    },
    {
        "text": "Q:  10^x=1508.76, what is the value of x?\nA:  10^x=1508.76, so x=log(1508.76)=3.18.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(1508.76)=3.18<eoe>"
        ],
        "tar_number": [
            "3.18"
        ]
    },
    {
        "text": "Q:  log(2320.09) equals?\nA:  log(2320.09)=3.37.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<log>(2320.09)=3.37<eoe>"
        ],
        "tar_number": [
            "3.37"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 8888.32 is?\nA:  The 10th logarithm of 8888.32 is log(8888.32)=3.95.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<log>(8888.32)=3.95<eoe>"
        ],
        "tar_number": [
            "3.95"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 832 is?\nA:  The 10th logarithm of 832 is log(832)=2.92.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            47
        ],
        "tar_eq": [
            "<log>(832)=2.92<eoe>"
        ],
        "tar_number": [
            "2.92"
        ]
    },
    {
        "text": "Q:  10^x=8162.85, what is the value of x?\nA:  10^x=8162.85, so x=log(8162.85)=3.91.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(8162.85)=3.91<eoe>"
        ],
        "tar_number": [
            "3.91"
        ]
    },
    {
        "text": "Q:  log(9222.3) equals?\nA:  log(9222.3)=3.96.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            32
        ],
        "tar_eq": [
            "<log>(9222.3)=3.96<eoe>"
        ],
        "tar_number": [
            "3.96"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 2371.4?\nA:  The value of the logarithm of 2371.4 is log(2371.4)=3.38.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<log>(2371.4)=3.38<eoe>"
        ],
        "tar_number": [
            "3.38"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 6606?\nA:  The value of the logarithm of 6606 is log(6606)=3.82.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(6606)=3.82<eoe>"
        ],
        "tar_number": [
            "3.82"
        ]
    },
    {
        "text": "Q:  10^x=9642, what is the value of x?\nA:  10^x=9642, so x=log(9642)=3.98.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(9642)=3.98<eoe>"
        ],
        "tar_number": [
            "3.98"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 3088.33 is?\nA:  The 10th logarithm of 3088.33 is log(3088.33)=3.49.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<log>(3088.33)=3.49<eoe>"
        ],
        "tar_number": [
            "3.49"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 8081 is?\nA:  The 10th logarithm of 8081 is log(8081)=3.91.",
        "start_token_idx": [
            46
        ],
        "end_token_idx": [
            50
        ],
        "tar_eq": [
            "<log>(8081)=3.91<eoe>"
        ],
        "tar_number": [
            "3.91"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 9489?\nA:  The value of the logarithm of 9489 is log(9489)=3.98.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(9489)=3.98<eoe>"
        ],
        "tar_number": [
            "3.98"
        ]
    },
    {
        "text": "Q:  10^x=3776, what is the value of x?\nA:  10^x=3776, so x=log(3776)=3.58.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(3776)=3.58<eoe>"
        ],
        "tar_number": [
            "3.58"
        ]
    },
    {
        "text": "Q:  10^x=9505, what is the value of x?\nA:  10^x=9505, so x=log(9505)=3.98.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(9505)=3.98<eoe>"
        ],
        "tar_number": [
            "3.98"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 9600.71 is?\nA:  The 10th logarithm of 9600.71 is log(9600.71)=3.98.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<log>(9600.71)=3.98<eoe>"
        ],
        "tar_number": [
            "3.98"
        ]
    },
    {
        "text": "Q:  The 10th logarithm of 3319.48 is?\nA:  The 10th logarithm of 3319.48 is log(3319.48)=3.52.",
        "start_token_idx": [
            55
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<log>(3319.48)=3.52<eoe>"
        ],
        "tar_number": [
            "3.52"
        ]
    },
    {
        "text": "Q:  10^x=3033.57, what is the value of x?\nA:  10^x=3033.57, so x=log(3033.57)=3.48.",
        "start_token_idx": [
            54
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<log>(3033.57)=3.48<eoe>"
        ],
        "tar_number": [
            "3.48"
        ]
    },
    {
        "text": "Q:  log(272) equals?\nA:  log(272)=2.43.",
        "start_token_idx": [
            22
        ],
        "end_token_idx": [
            26
        ],
        "tar_eq": [
            "<log>(272)=2.43<eoe>"
        ],
        "tar_number": [
            "2.43"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 205.01?\nA:  The value of the logarithm of 205.01 is log(205.01)=2.31.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            55
        ],
        "tar_eq": [
            "<log>(205.01)=2.31<eoe>"
        ],
        "tar_number": [
            "2.31"
        ]
    },
    {
        "text": "Q:  10^x=8421, what is the value of x?\nA:  10^x=8421, so x=log(8421)=3.93.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(8421)=3.93<eoe>"
        ],
        "tar_number": [
            "3.93"
        ]
    },
    {
        "text": "Q:  log(6873.42) equals?\nA:  log(6873.42)=3.84.",
        "start_token_idx": [
            30
        ],
        "end_token_idx": [
            34
        ],
        "tar_eq": [
            "<log>(6873.42)=3.84<eoe>"
        ],
        "tar_number": [
            "3.84"
        ]
    },
    {
        "text": "Q:  log(3429) equals?\nA:  log(3429)=3.54.",
        "start_token_idx": [
            24
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<log>(3429)=3.54<eoe>"
        ],
        "tar_number": [
            "3.54"
        ]
    },
    {
        "text": "Q:  log(1548) equals?\nA:  log(1548)=3.19.",
        "start_token_idx": [
            24
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<log>(1548)=3.19<eoe>"
        ],
        "tar_number": [
            "3.19"
        ]
    },
    {
        "text": "Q:  10^x=4003, what is the value of x?\nA:  10^x=4003, so x=log(4003)=3.6.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            48
        ],
        "tar_eq": [
            "<log>(4003)=3.6<eoe>"
        ],
        "tar_number": [
            "3.6"
        ]
    },
    {
        "text": "Q: A bakery made 201 loaves of bread in the morning and 31 in the afternoon. How many loaves of bread did they make in total?\nA: The total number of loaves of bread made is 201+31=232.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<add>(201, 31)=232<eoe>"
        ],
        "tar_number": [
            "232"
        ]
    },
    {
        "text": "Q: If a store sells 18 bananas today and 36 more bananas tomorrow, how many bananas will the store sell in total?\nA: The store sells 18 bananas today and 36 more bananas tomorrow, so the total number of bananas sold will be 18+36=54.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            77
        ],
        "tar_eq": [
            "<add>(18, 36)=54<eoe>"
        ],
        "tar_number": [
            "54"
        ]
    },
    {
        "text": "Q: A football team scored 251 points in the first half and 117 points in the second half. How many points did the team score in total?\nA: The total number of points scored by the football team is 251+117=368.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<add>(251, 117)=368<eoe>"
        ],
        "tar_number": [
            "368"
        ]
    },
    {
        "text": "Q: If a student scores 120 marks in the first exam and 169 marks in the second exam, what is the student's total score?\nA: The student scores 120 marks in the first exam and 169 marks in the second exam, so the total score is 120+169=289 marks.",
        "start_token_idx": [
            76
        ],
        "end_token_idx": [
            79
        ],
        "tar_eq": [
            "<add>(120, 169)=289<eoe>"
        ],
        "tar_number": [
            "289"
        ]
    },
    {
        "text": "Q: A class has 461 boys and 422 girls. How many students are in the class?\nA: The class has 461 boys and 422 girls. The total number of students is 461+422=883.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            62
        ],
        "tar_eq": [
            "<add>(461, 422)=883<eoe>"
        ],
        "tar_number": [
            "883"
        ]
    },
    {
        "text": "Q: A company has 317 employees in one office and 364 employees in another office. How many employees does the company have in total?\nA: The company has 317 employees in one office and 364 employees in another office. The company has 317+364=681 employees in total.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<add>(317, 364)=681<eoe>"
        ],
        "tar_number": [
            "681"
        ]
    },
    {
        "text": "Q: A student has 489 pencils and buys 160 more. How many pencils does the student have in total?\nA: The student has 489 pencils and buys 160 more. The student now has 489+160=649 pencils in total.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<add>(489, 160)=649<eoe>"
        ],
        "tar_number": [
            "649"
        ]
    },
    {
        "text": "Q: A box contains 296 red balls and 266 blue balls. How many balls are in the box in total?\nA: There are 296 red balls and 266 blue balls in the box. There are 296+266=562 balls in total.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<add>(296, 266)=562<eoe>"
        ],
        "tar_number": [
            "562"
        ]
    },
    {
        "text": "Q: A football team scored 300 points in the first half and 252 points in the second half. How many points did the team score in total?\nA: The total number of points scored by the football team is 300+252=552.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<add>(300, 252)=552<eoe>"
        ],
        "tar_number": [
            "552"
        ]
    },
    {
        "text": "Q: A car traveled 118.01 miles in the morning and 451.96 miles in the afternoon. How many miles did the car travel in total?\nA: The car traveled 118.01+451.96=569.97 miles in total.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            71
        ],
        "tar_eq": [
            "<add>(118.01, 451.96)=569.97<eoe>"
        ],
        "tar_number": [
            "569.97"
        ]
    },
    {
        "text": "Q: A pizza restaurant made 291 pizzas in the morning and 361 pizzas in the afternoon. How many pizzas did the restaurant make in total?\nA: The restaurant made 291+361=652 pizzas in total.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<add>(291, 361)=652<eoe>"
        ],
        "tar_number": [
            "652"
        ]
    },
    {
        "text": "Q: If a car travels 186 miles in the morning and 58 miles in the afternoon, how many miles did it travel in total?\nA: The car traveled 186 miles in the morning and 58 miles in the afternoon, so it traveled 186+58=244 miles in total.",
        "start_token_idx": [
            72
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<add>(186, 58)=244<eoe>"
        ],
        "tar_number": [
            "244"
        ]
    },
    {
        "text": "Q: A train travels 39.24 miles in the morning and 475.75 miles in the afternoon. How far does the train travel in total?\nA: The total distance traveled by the train is 39.24+475.75=514.99 miles.",
        "start_token_idx": [
            66
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<add>(39.24, 475.75)=514.99<eoe>"
        ],
        "tar_number": [
            "514.99"
        ]
    },
    {
        "text": "Q: A store sold 458 t-shirts on Monday and 320 t-shirts on Tuesday. How many t-shirts did the store sell in total?\nA: The store sold 458+320=778 t-shirts in total.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<add>(458, 320)=778<eoe>"
        ],
        "tar_number": [
            "778"
        ]
    },
    {
        "text": "Q: A recipe calls for 76 cups of flour and 18 cups of sugar. How many cups of ingredients are needed in total?\nA: The recipe calls for 76 cups of flour and 18 cups of sugar. The total amount of ingredients needed is 76+18=94 cups.",
        "start_token_idx": [
            79
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<add>(76, 18)=94<eoe>"
        ],
        "tar_number": [
            "94"
        ]
    },
    {
        "text": "Q: A car traveled 375.77 kilometers in the morning and 92.29 kilometers in the afternoon. How many kilometers did the car travel in total?\nA: The car traveled 375.77+92.29=468.06 kilometers in total.",
        "start_token_idx": [
            66
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<add>(375.77, 92.29)=468.06<eoe>"
        ],
        "tar_number": [
            "468.06"
        ]
    },
    {
        "text": "Q: If a company earns 139 dollars in January and 93 dollars in February, how much did the company earn in total?\nA: The company earns 139 dollars in January and 93 dollars in February, so the total amount earned is 139+93=232 dollars.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            72
        ],
        "tar_eq": [
            "<add>(139, 93)=232<eoe>"
        ],
        "tar_number": [
            "232"
        ]
    },
    {
        "text": "Q: What is the sum of 316 and 326?\nA: The sum of 316 and 326 is 316+326=642.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<add>(316, 326)=642<eoe>"
        ],
        "tar_number": [
            "642"
        ]
    },
    {
        "text": "Q: A bakery made 197 loaves of bread in the morning and 423 in the afternoon. How many loaves of bread did they make in total?\nA: The total number of loaves of bread made is 197+423=620.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<add>(197, 423)=620<eoe>"
        ],
        "tar_number": [
            "620"
        ]
    },
    {
        "text": "Q: A company received 65 orders on Monday and 187 on Tuesday. How many orders did they receive in total?\nA: The total number of orders received is 65+187=252.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<add>(65, 187)=252<eoe>"
        ],
        "tar_number": [
            "252"
        ]
    },
    {
        "text": "Q: A store sold 208 t-shirts on Monday and 176 t-shirts on Tuesday. How many t-shirts did the store sell in total?\nA: The store sold 208+176=384 t-shirts in total.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<add>(208, 176)=384<eoe>"
        ],
        "tar_number": [
            "384"
        ]
    },
    {
        "text": "Q: A box contains 341 red balls and 429 blue balls. How many balls are in the box in total?\nA: There are 341 red balls and 429 blue balls in the box. There are 341+429=770 balls in total.",
        "start_token_idx": [
            63
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<add>(341, 429)=770<eoe>"
        ],
        "tar_number": [
            "770"
        ]
    },
    {
        "text": "Q: A recipe calls for 2 cups of flour and 1 cup of sugar. How many cups of ingredients are needed in total?\nA: The total amount of ingredients needed is 2 cups of flour + 1 cup of sugar = 55 cups in total.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<add>(2, 1) = 55<eoe>"
        ],
        "tar_number": [
            " 55"
        ]
    },
    {
        "text": "Q: A bakery made 99 loaves of bread in the morning and 133 in the afternoon. How many loaves of bread did they make in total?\nA: The total number of loaves of bread made is 99+133=232.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            63
        ],
        "tar_eq": [
            "<add>(99, 133)=232<eoe>"
        ],
        "tar_number": [
            "232"
        ]
    },
    {
        "text": "Q: A student scored 194 points on the first exam and 146 points on the second exam. What is the student's total score?\nA: The student scored 194 points on the first exam and 146 points on the second exam, so the student's total score is 194+146=340 points.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<add>(194, 146)=340<eoe>"
        ],
        "tar_number": [
            "340"
        ]
    },
    {
        "text": "Q: A student scored 41 points on the first exam and 381 points on the second exam. What is the student's total score?\nA: The student scored 41 points on the first exam and 381 points on the second exam, so the student's total score is 41+381=422 points.",
        "start_token_idx": [
            75
        ],
        "end_token_idx": [
            78
        ],
        "tar_eq": [
            "<add>(41, 381)=422<eoe>"
        ],
        "tar_number": [
            "422"
        ]
    },
    {
        "text": "Q: A bakery sold 3 croissants in the morning and 234 croissants in the afternoon. How many croissants did the bakery sell in total?\nA: The bakery sold 3+234=237 croissants in total.",
        "start_token_idx": [
            57
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<add>(3, 234)=237<eoe>"
        ],
        "tar_number": [
            "237"
        ]
    },
    {
        "text": "Q: A train travels 446.88 miles in the morning and 147.86 miles in the afternoon. How far does the train travel in total?\nA: The total distance traveled by the train is 446.88+147.86=594.74 miles.",
        "start_token_idx": [
            68
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<add>(446.88, 147.86)=594.74<eoe>"
        ],
        "tar_number": [
            "594.74"
        ]
    },
    {
        "text": "Q: A pizza place sells 357 slices of pepperoni pizza and 195 slices of vegetarian pizza. How many slices of pizza did the place sell in total?\nA: The pizza place sold 357+195=552 slices of pizza in total.",
        "start_token_idx": [
            65
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<add>(357, 195)=552<eoe>"
        ],
        "tar_number": [
            "552"
        ]
    },
    {
        "text": "Q: A company received 446 orders on Monday and 135 on Tuesday. How many orders did they receive in total?\nA: The total number of orders received is 446+135=581.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<add>(446, 135)=581<eoe>"
        ],
        "tar_number": [
            "581"
        ]
    },
    {
        "text": "Q: What is the sum of 367 and 288?\nA: The sum of 367 and 288 is 367+288=655.",
        "start_token_idx": [
            43
        ],
        "end_token_idx": [
            46
        ],
        "tar_eq": [
            "<add>(367, 288)=655<eoe>"
        ],
        "tar_number": [
            "655"
        ]
    },
    {
        "text": "Q: A student scored 166 points on the first exam and 342 points on the second exam. What is the student's total score?\nA: The student scored 166 points on the first exam and 342 points on the second exam, so the student's total score is 166+342=508 points.",
        "start_token_idx": [
            78
        ],
        "end_token_idx": [
            81
        ],
        "tar_eq": [
            "<add>(166, 342)=508<eoe>"
        ],
        "tar_number": [
            "508"
        ]
    },
    {
        "text": "Q: A company sold 380 units of product A and 67 units of product B. How many units of products did the company sell in total?\nA: The total number of units of products sold by the company is 380+67=447.",
        "start_token_idx": [
            58
        ],
        "end_token_idx": [
            61
        ],
        "tar_eq": [
            "<add>(380, 67)=447<eoe>"
        ],
        "tar_number": [
            "447"
        ]
    },
    {
        "text": "Q: A store sells 168 apples and 303 oranges. How many fruits are sold in total?\nA: The total number of fruits sold by the store is 168+303=471.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<add>(168, 303)=471<eoe>"
        ],
        "tar_number": [
            "471"
        ]
    },
    {
        "text": "Q: A car travels 265.78 miles in the morning and 370.92 miles in the evening. How far does the car travel in one day?\nA: If a car travels 265.78 miles in the morning and 370.92 miles in the evening, then it travels 265.78+370.92=636.7 miles in one day.",
        "start_token_idx": [
            92
        ],
        "end_token_idx": [
            97
        ],
        "tar_eq": [
            "<add>(265.78, 370.92)=636.7<eoe>"
        ],
        "tar_number": [
            "636.7"
        ]
    },
    {
        "text": "Q: A store sells 277 apples and 209 oranges. How many fruits are sold in total?\nA: The total number of fruits sold by the store is 277+209=486.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<add>(277, 209)=486<eoe>"
        ],
        "tar_number": [
            "486"
        ]
    },
    {
        "text": "Q: A store has sold 422 shirts on Monday and 444 shirts on Tuesday. How many shirts have they sold in total?\nA: The store has sold 422 shirts on Monday and 444 shirts on Tuesday, so they have sold 422+444=866 shirts in total.",
        "start_token_idx": [
            82
        ],
        "end_token_idx": [
            85
        ],
        "tar_eq": [
            "<add>(422, 444)=866<eoe>"
        ],
        "tar_number": [
            "866"
        ]
    },
    {
        "text": "Q: A company has 241 full-time employees and 57 part-time employees. How many employees does the company have in total?\nA: The total number of employees in the company is 241+57=298.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<add>(241, 57)=298<eoe>"
        ],
        "tar_number": [
            "298"
        ]
    },
    {
        "text": "Q: A family has 228 adults and 278 children. How many people are in the family in total?\nA: The total number of people in the family is 228+278=506.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<add>(228, 278)=506<eoe>"
        ],
        "tar_number": [
            "506"
        ]
    },
    {
        "text": "Q: A family has 201 adults and 349 children. How many people are in the family in total?\nA: The total number of people in the family is 201+349=550.",
        "start_token_idx": [
            50
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<add>(201, 349)=550<eoe>"
        ],
        "tar_number": [
            "550"
        ]
    },
    {
        "text": "Q: A train travels 9.8 miles in the morning and 132.23 miles in the afternoon. How far does the train travel in total?\nA: The total distance traveled by the train is 9.8+132.23=142.03 miles.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            68
        ],
        "tar_eq": [
            "<add>(9.8, 132.23)=142.03<eoe>"
        ],
        "tar_number": [
            "142.03"
        ]
    },
    {
        "text": "Q: A bakery sold 392 croissants in the morning and 480 croissants in the afternoon. How many croissants did the bakery sell in total?\nA: The bakery sold 392+480=872 croissants in total.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<add>(392, 480)=872<eoe>"
        ],
        "tar_number": [
            "872"
        ]
    },
    {
        "text": "Q: A store sells 311 apples and 112 oranges. How many fruits are sold in total?\nA: The total number of fruits sold by the store is 311+112=423.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<add>(311, 112)=423<eoe>"
        ],
        "tar_number": [
            "423"
        ]
    },
    {
        "text": "Q: If a car travels 396 miles in the morning and 92 miles in the afternoon, how many miles does it travel in total?\nA: The car travels 396 miles in the morning and 92 miles in the afternoon, so it travels 396+92=488 miles in total.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<add>(396, 92)=488<eoe>"
        ],
        "tar_number": [
            "488"
        ]
    },
    {
        "text": "Q: A farmer harvested 240 bushels of corn and 484 bushels of wheat. How many bushels of crops did the farmer harvest in total?\nA: The total number of bushels of crops harvested by the farmer is 240+484=724.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<add>(240, 484)=724<eoe>"
        ],
        "tar_number": [
            "724"
        ]
    },
    {
        "text": "Q: A company has 291 employees in one office and 215 employees in another office. How many employees does the company have in total?\nA: The company has 291 employees in one office and 215 employees in another office. The company has 291+215=506 employees in total.",
        "start_token_idx": [
            70
        ],
        "end_token_idx": [
            73
        ],
        "tar_eq": [
            "<add>(291, 215)=506<eoe>"
        ],
        "tar_number": [
            "506"
        ]
    },
    {
        "text": "Q: A farmer harvested 64 bushels of corn and 458 bushels of wheat. How many bushels of crops did the farmer harvest in total?\nA: The total number of bushels of crops harvested by the farmer is 64+458=522.",
        "start_token_idx": [
            71
        ],
        "end_token_idx": [
            74
        ],
        "tar_eq": [
            "<add>(64, 458)=522<eoe>"
        ],
        "tar_number": [
            "522"
        ]
    },
    {
        "text": "Q: A baker is dividing 7105 pounds of dough into loaves of bread that weigh 5783 pounds each. How many pounds of dough will be left over if they cannot make a complete loaf of bread with the remaining dough?\nA: The amount of dough left over will be 7105 mod 5783=1322 pounds.",
        "start_token_idx": [
            84
        ],
        "end_token_idx": [
            88
        ],
        "tar_eq": [
            "<remainder>(7105,5783)=1322<eoe>"
        ],
        "tar_number": [
            "1322"
        ]
    },
    {
        "text": "Q: A farmer has 7558 eggs and wants to put them into crates that hold 3788 eggs each. How many eggs will be left over?\nA: The number of eggs left over is 7558%3788=3770.",
        "start_token_idx": [
            60
        ],
        "end_token_idx": [
            64
        ],
        "tar_eq": [
            "<remainder>(7558,3788)=3770<eoe>"
        ],
        "tar_number": [
            "3770"
        ]
    },
    {
        "text": "Q: A pizza has 4696 slices and 3245 people want to share it equally. How many slices will be left?\nA: Divide 4696 by 3245, the remainder is 1451.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            60
        ],
        "tar_eq": [
            "<remainder>(4696,3245)=1451<eoe>"
        ],
        "tar_number": [
            "1451"
        ]
    },
    {
        "text": "Q: A rectangular room has a length of 427 meters and a width of 901 meters. What is the maximum length of a tile that can be used to cover the entire floor without cutting any tile?\nA: The maximum length of a tile that can be used is the greatest common divisor of 427 and 901, which is 1.",
        "start_token_idx": [
            81
        ],
        "end_token_idx": [
            82
        ],
        "tar_eq": [
            "<gcd>(427,901)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A group of students wants to distribute 237 pencils and 894 erasers evenly among themselves. What is the maximum number of students in the group that can receive the same number of pencils and erasers?\nA: The maximum number of students is the greatest common divisor of 237 and 894, which is 3.",
        "start_token_idx": [
            84
        ],
        "end_token_idx": [
            85
        ],
        "tar_eq": [
            "<gcd>(237,894)=3<eoe>"
        ],
        "tar_number": [
            "3"
        ]
    },
    {
        "text": "Q: A store has 716 shirts in one color and 103 shirts in another color. The store wants to arrange them in rows with the same number of shirts in each row. What is the largest possible number of shirts in each row?\nA: The largest possible number of shirts in each row is the greatest common divisor of 716 and 103, which is 1.",
        "start_token_idx": [
            97
        ],
        "end_token_idx": [
            98
        ],
        "tar_eq": [
            "<gcd>(716,103)=1<eoe>"
        ],
        "tar_number": [
            "1"
        ]
    },
    {
        "text": "Q: A recipe calls for 159.44 cups of flour to make 621.15 servings. How much flour is needed per serving?\nA: Each serving requires 159.44/621.15=0.26 cups of flour.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<divide>(159.44, 621.15)=0.26<eoe>"
        ],
        "tar_number": [
            "0.26"
        ]
    },
    {
        "text": "Q: If an athlete can run 106.84 meters in 477.05 seconds, how many meters can they run in one minute?\nA: The athlete can run 106.847.95 meters in one minute.",
        "start_token_idx": [
            52
        ],
        "end_token_idx": [
            56
        ],
        "tar_eq": [
            "<divide>(477.05, 60)=7.95<eoe>"
        ],
        "tar_number": [
            "7.95"
        ]
    },
    {
        "text": "Q: A car can travel 20282.14 miles on a full tank of gas. If the gas tank holds 16758.92 gallons of gas, how far can the car travel on one gallon of gas?\nA: The car can travel 20282.14/16758.92=1.21 miles on one gallon of gas.",
        "start_token_idx": [
            82
        ],
        "end_token_idx": [
            86
        ],
        "tar_eq": [
            "<divide>(20282.14, 16758.92)=1.21<eoe>"
        ],
        "tar_number": [
            "1.21"
        ]
    },
    {
        "text": "Q: A company has 9 employees. How many ways can you choose a team of 7 employees?\nA: There are 36 ways to choose a team of 7 employees from 9 employees.",
        "start_token_idx": [
            29
        ],
        "end_token_idx": [
            31
        ],
        "tar_eq": [
            "<choose>(9,7)=36<eoe>"
        ],
        "tar_number": [
            "36"
        ]
    },
    {
        "text": "Q: A store has 15 different colored shirts. How many ways can you choose 11 shirts?\nA: There are 1365 ways to choose shirts.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<choose>(15,11)=1365<eoe>"
        ],
        "tar_number": [
            "1365"
        ]
    },
    {
        "text": "Q: A restaurant offers 15 different types of pizza toppings. If a customer can choose 5 toppings for their pizza, how many different pizzas can they order?\nA: The customer can order 3003 different pizzas.",
        "start_token_idx": [
            49
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<choose>(15,5)=3003<eoe>"
        ],
        "tar_number": [
            "3003"
        ]
    },
    {
        "text": "Q: A company made a profit of $399.63 in January. In February, they lost $319.68. What was their net profit for the two months?\nA: The company made a profit of $399.63 in January and lost $319.68 in February, so their net profit for the two months was $399.63-$319.68=79.95.",
        "start_token_idx": [
            96
        ],
        "end_token_idx": [
            101
        ],
        "tar_eq": [
            "<subtract>(399.63, 319.68)=79.95<eoe>"
        ],
        "tar_number": [
            "79.95"
        ]
    },
    {
        "text": "Q: A restaurant has 311 bottles of soda in stock. They use 226 bottles of soda to serve customers today. How many bottles of soda are left in the restaurant?\nA: The restaurant initially has 311 bottles of soda, and 226 bottles of soda are used, so now there are 311-226=85 bottles of soda left.",
        "start_token_idx": [
            90
        ],
        "end_token_idx": [
            92
        ],
        "tar_eq": [
            "<subtract>(311, 226)=85<eoe>"
        ],
        "tar_number": [
            "85"
        ]
    },
    {
        "text": "Q: A store had 464 pencils in stock. They sold 301 pencils today. How many pencils are left in the store?\nA: The store had 464 pencils and sold 301 pencils, so there are 464-301=163 pencils left in the store.",
        "start_token_idx": [
            73
        ],
        "end_token_idx": [
            76
        ],
        "tar_eq": [
            "<subtract>(464, 301)=163<eoe>"
        ],
        "tar_number": [
            "163"
        ]
    },
    {
        "text": "Q: If a bag of apples weighs 387.84 pounds and I want to buy 257 bags, how many pounds of apples will I have in total?\nA: You will have 387.84*257=99674.88 pounds of apples in total.",
        "start_token_idx": [
            62
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<multiply>(387.84, 257)=99674.88<eoe>"
        ],
        "tar_number": [
            "99674.88"
        ]
    },
    {
        "text": "Q: If a package of cookies has 142 cookies, and I want to buy 231 packages, how many cookies will I have in total?\nA: You will have a total of 142*231=32802 cookies.",
        "start_token_idx": [
            53
        ],
        "end_token_idx": [
            58
        ],
        "tar_eq": [
            "<multiply>(142, 231)=32802<eoe>"
        ],
        "tar_number": [
            "32802"
        ]
    },
    {
        "text": "Q: A box contains 14 items and each item weighs 44.76 pounds. What is the total weight of the items in the box?\nA: Each item weighs 44.76 pounds, so 14 items weigh 14*44.76=626.64 pounds in total.",
        "start_token_idx": [
            69
        ],
        "end_token_idx": [
            75
        ],
        "tar_eq": [
            "<multiply>(14, 44.76)=626.64<eoe>"
        ],
        "tar_number": [
            "626.64"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 4953. What is the standard deviation of the list ?\nA: The standard deviation of the list is 70.38.",
        "start_token_idx": [
            37
        ],
        "end_token_idx": [
            42
        ],
        "tar_eq": [
            "<sqrt>(4953)=70.38<eoe>"
        ],
        "tar_number": [
            "70.38"
        ]
    },
    {
        "text": "Q:  If we know the variance of the weather data is 9831, what is the standard deviation?\nA: The standard deviation is 99.15.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            39
        ],
        "tar_eq": [
            "<sqrt>(9831)=99.15<eoe>"
        ],
        "tar_number": [
            "99.15"
        ]
    },
    {
        "text": "Q:  The variance of a float list is 746. What is the standard deviation of the list ?\nA: The standard deviation of the list is 27.31.",
        "start_token_idx": [
            36
        ],
        "end_token_idx": [
            41
        ],
        "tar_eq": [
            "<sqrt>(746)=27.31<eoe>"
        ],
        "tar_number": [
            "27.31"
        ]
    },
    {
        "text": "Q: A group of 7 friends are taking a photo together. How many ways can they arrange themselves in the photo?\nA: There are 5040 ways to arrange themselves in the photo.",
        "start_token_idx": [
            33
        ],
        "end_token_idx": [
            37
        ],
        "tar_eq": [
            "<permutate>(7,7)=5040<eoe>"
        ],
        "tar_number": [
            "5040"
        ]
    },
    {
        "text": "Q: A teacher has 5 students who need to present their projects. The teacher wants to randomly select 3 students to present their projects. How many possible orders are there for the students to present their projects?\nA: The number of orders the teacher can select the students is 5P3 = 60.",
        "start_token_idx": [
            64
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<permutate>(5,3) = 60<eoe>"
        ],
        "tar_number": [
            " 60"
        ]
    },
    {
        "text": "Q: A restaurant has 12 tables and wants to arrange 7 tables for a private event, how many ways can they arrange the tables?\nA: The number of ways to arrange 7 tables out of 12 tables is 12P7=3991680.",
        "start_token_idx": [
            59
        ],
        "end_token_idx": [
            66
        ],
        "tar_eq": [
            "<permutate>(12,7)=3991680<eoe>"
        ],
        "tar_number": [
            "3991680"
        ]
    },
    {
        "text": "Q:  ln(4230.98) is equal to what?\nA: ln(4230.98)=8.35.",
        "start_token_idx": [
            34
        ],
        "end_token_idx": [
            38
        ],
        "tar_eq": [
            "<ln>(4230.98)=8.35<eoe>"
        ],
        "tar_number": [
            "8.35"
        ]
    },
    {
        "text": "Q: What is the natural log of 3576.01?\nA: The natural log of 3576.01 is ln(3576.01)=8.18.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<ln>(3576.01)=8.18<eoe>"
        ],
        "tar_number": [
            "8.18"
        ]
    },
    {
        "text": "Q:  ln(5451) is equal to what?\nA: ln(5451)=8.6.",
        "start_token_idx": [
            28
        ],
        "end_token_idx": [
            31
        ],
        "tar_eq": [
            "<ln>(5451)=8.6<eoe>"
        ],
        "tar_number": [
            "8.6"
        ]
    },
    {
        "text": "Q: A sqaure has a side length of 2.39 meters. What is the area of the square in square meters?\nA:  The area of the square is 2.39^2=5.71 square meters.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            52
        ],
        "tar_eq": [
            "<power>(2.39, 2)=5.71<eoe>"
        ],
        "tar_number": [
            "5.71"
        ]
    },
    {
        "text": "Q: A sqaure has a side length of 7.89 meters. What is the area of the square in square meters?\nA:  The area of the square is 7.89^2=62.25 square meters.",
        "start_token_idx": [
            48
        ],
        "end_token_idx": [
            53
        ],
        "tar_eq": [
            "<power>(7.89, 2)=62.25<eoe>"
        ],
        "tar_number": [
            "62.25"
        ]
    },
    {
        "text": "Q: A bacteria culture doubles every 3 hours. Starting with one bacterium, how many bacteria will there be after 39 hours?\nA: After 11 hours, the number of the bacteria will be 2^(39/3)=8192.",
        "start_token_idx": [
            61
        ],
        "end_token_idx": [
            65
        ],
        "tar_eq": [
            "<power>(2, 39/3)=8192<eoe>"
        ],
        "tar_number": [
            "8192"
        ]
    },
    {
        "text": "Q: A group of friends wants to go on a road trip and must choose from three different routes. Route A takes 493 hours, Route B takes 545 hours, and Route C takes 601 hours. If the friends want to arrive at their destination at the same time, what is the earliest departure time they can choose?\nA: The earliest departure time the friends can choose is the least common multiple of 493, 545, and 601, which is 161479685.",
        "start_token_idx": [
            110
        ],
        "end_token_idx": [
            119
        ],
        "tar_eq": [
            "<lcm>(493,545,601)=161479685<eoe>"
        ],
        "tar_number": [
            "161479685"
        ]
    },
    {
        "text": "Q: A group of students have to complete two different assignments. The first assignment takes 373 days to complete while the second assignment takes 316 days. If both assignments start at the same time, what is the least amount of time it will take for the students to complete both assignments?\nA: The least amount of time it will take for the students to complete both assignments is 117868.",
        "start_token_idx": [
            87
        ],
        "end_token_idx": [
            93
        ],
        "tar_eq": [
            "<lcm>(373,316)=117868<eoe>"
        ],
        "tar_number": [
            "117868"
        ]
    },
    {
        "text": "Q: A choir is practicing for a concert. The soprano section practices their part every 908 minutes, while the alto section practices their part every 970 minutes. If both sections start practicing at the same time, what is the least amount of time it will take for both sections to practice their parts at the same time?\nA: The least amount of time it will take for both sections to practice their parts at the same time is 440380.",
        "start_token_idx": [
            98
        ],
        "end_token_idx": [
            104
        ],
        "tar_eq": [
            "<lcm>(908,970)=440380<eoe>"
        ],
        "tar_number": [
            "440380"
        ]
    },
    {
        "text": "Q:  log(7791) equals?\nA:  log(7791)=3.89.",
        "start_token_idx": [
            24
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<log>(7791)=3.89<eoe>"
        ],
        "tar_number": [
            "3.89"
        ]
    },
    {
        "text": "Q:  What is the value of the logarithm of 8878?\nA:  The value of the logarithm of 8878 is log(8878)=3.95.",
        "start_token_idx": [
            45
        ],
        "end_token_idx": [
            49
        ],
        "tar_eq": [
            "<log>(8878)=3.95<eoe>"
        ],
        "tar_number": [
            "3.95"
        ]
    },
    {
        "text": "Q:  log(7548) equals?\nA:  log(7548)=3.88.",
        "start_token_idx": [
            24
        ],
        "end_token_idx": [
            28
        ],
        "tar_eq": [
            "<log>(7548)=3.88<eoe>"
        ],
        "tar_number": [
            "3.88"
        ]
    },
    {
        "text": "Q: A farmer harvested 147 apples and 167 oranges. How many fruits did he harvest in total?\nA: The total number of fruits harvested is 147+167=314.",
        "start_token_idx": [
            56
        ],
        "end_token_idx": [
            59
        ],
        "tar_eq": [
            "<add>(147, 167)=314<eoe>"
        ],
        "tar_number": [
            "314"
        ]
    },
    {
        "text": "Q: A company received 494 orders on Monday and 209 on Tuesday. How many orders did they receive in total?\nA: The total number of orders received is 494+209=703.",
        "start_token_idx": [
            51
        ],
        "end_token_idx": [
            54
        ],
        "tar_eq": [
            "<add>(494, 209)=703<eoe>"
        ],
        "tar_number": [
            "703"
        ]
    },
    {
        "text": "Q: A company has 224 employees in one office and 77 employees in another office. How many employees does the company have in total?\nA: The company has 224 employees in one office and 77 employees in another office. The company has 224+77=301 employees in total.",
        "start_token_idx": [
            67
        ],
        "end_token_idx": [
            70
        ],
        "tar_eq": [
            "<add>(224, 77)=301<eoe>"
        ],
        "tar_number": [
            "301"
        ]
    }
]